[{
  "id": "49530511",
  "date_of_birth": null,
  "obituary_text": "CRANE -- Horace R. Poole, 93, of Odessa, died Saturday, Dec 13.Services are 2 p.m. Wednesday, Dec. 17, at the Crane County Cemetery, with Minister Mike Smith officiating. Arrangements are under the direction of Shaffer-Nichols Funeral Home of Crane.He is survived by his wife, Mary Poole, of Odessa; daughter Linda Lively, of Odessa; son Ron Poole, of Roseburg, Ore.; brother Clyde Poole, of Palestine; and sisters Oleta Lewis, of Houma, La., and Doris Fay Lucas, of Houston.",
  "date_of_death": null
}, {
  "id": "15887338",
  "date_of_birth": null,
  "obituary_text": "FULLER LOUISE BARNHART FULLER, 86. Beloved wife of the late Robert W. Fuller; loving mother of Daniel (Christine) Fuller, Thomas (Kathryn) Fuller and Duncan Fuller; grandmother of Scott and Amy Fuller, Alice, Anne and Claire Fuller; sister of the late George Ford and Kay Schnackel. Memorial Services will be announced at a later date. A private burial will be held at Lake View Cemetery, in Cleveland. Louise was a long time member of Forest Hill Presbyterian Church, in Cleveland Hts. She is a retired teacher from the East Cleveland School District, after 20 years of service, where she was awarded Ohio Teacher of the year in 1977. Donations to Forest Hill Presbyterian Church, 3031 Monticello Blvd., Cleveland Hts. 44118.",
  "date_of_death": null
}, {
  "id": "16121593",
  "date_of_birth": null,
  "obituary_text": "ROSEMARY HARMON, beloved wife of the late Dolie C.; dear mother of Gregory A. Harmon and Tracy L. Petro (Mark); grandmother of Katelyn Marie and Allison Rose Petro; sister of Elmer Wells, Jr. (Mary Jo), Herman Wells (Janette), Neva Sue Baker (Lex) and the late Janice Adkins (Paul); cherished aunt of Ronnie, Donnie (deceased), Debbie, Gary, Pam, Jeff, Dwayne, Karen, Tim and Scott; friend of many. VISITATION THURSDAY, 2 - 4 and 7 - 9PM in THE CHAPEL AT SUNSET MEMORIAL PARK, 6245 COLUMBIA RD., where services will be held Friday, Feb. 27 at 9:30AM. Memorials may be made to the American Heart Association, 1689 E. 115 St., Cleveland, OH 44106. ARRANGEMENTS BY DOSTAL FUNERAL SERVICE dostalfuneralservices.com",
  "date_of_death": null
}, {
  "id": "48118560",
  "date_of_birth": null,
  "obituary_text": "RUTLEDGE, Mo. -- Joe Neese Jr., 87, of Rutledge, died March 31, 2011, in Scotland County Hospital, Memphis. Services will be at 11 a.m. Monday in First Baptist Church, Memphis. Burial will be in Memphis Cemetery. Visitation will be 6-8 p.m. Sunday in the Memphis Funeral Home.",
  "date_of_death": null
}, {
  "id": "26838758",
  "date_of_birth": null,
  "obituary_text": "Shawn Loren KELLOGG Shawn was born November 4, 1974 in Nairobi, Kenya, to Richard and Peggy Kellogg. He died April 2, 2011 at Providence Hospital, Everett. Shawn grew up in the sunshine of Kisumu, Kenya, and moved to the Seattle area with his family when he was 5½ years old. He attended North Seattle Christian School, Shoreline Community College, and Northwest University. He rowed on the Green Lake Crew, and enjoyed it immensely. Shawn served in Youth With A Mission in Switzerland and Bolivia. He worked at all kinds of jobs, and was good at whatever he did. Shawn enjoyed skiing, snowboarding, motorcycling, SCUBA diving, hiking and camping, and hanging out with friends. He fished in Alaska out of Dutch Harbor. Shawn had plenty of struggles in life, and always thought he would be able to overcome them. Now his struggles are over. He loved Jesus, and wanted to be used of God. Shawn was a lover of people, and people enjoyed Shawn. He was great fun to be with and talk to. Shawn is survived by his parents; his brother, Chad; his grandmother, Leona Cettolin; his aunts, Kathryn Kellogg, Debbie Kellogg, Paulette Stickland, and Sheryl Love; his uncles, Brent Kellogg, Bill Stickland, and Don Stickland. A memorial service will be held at 12:00 noon, Thursday, April 7 at The Westside Church, 7758 Earl Avenue NW, Seattle, WA 98177. Memorial gifts may be made to New Heart Place, care of Westgate Chapel, 22901 Edmonds Way, Edmonds, WA 98020.",
  "date_of_death": null
}, {
  "id": "29869092",
  "date_of_birth": null,
  "obituary_text": "WAYNESBORO, Ga.- Mrs. Virginia Wilson Rowland, 78, wife of the late Mr. T. R. (Buddy) Rowland, entered into rest February 23, 2004 at the Brentwood Terrace, Waynesboro. Mrs. Rowland was a homemaker and native of Doraville, Ga. and spent most of her adult life in Vidette, Ga. She was a member of the Bethel Associated Reformed Presbyterian Church of Vidette. A charter member of White Columns Women\u0027s Club, Waynesboro, Ladies Shrine Auxiliary and the Sarah Pressley Missionary Circle. Funeral services will be held 11 a.m. Wednesday, February 25, 2004 at the Bethel ARP Church with Dr. Roy Beckham officiating with interment following at Rose Dhu Cemetery, Vidette. Survivors include one son, Tommy Rowland, Vidette; two daughters, Susan R. Coursey, Waynesboro and Pat R. Smith of Hephzibah. Also survived by seven grandchildren and four great-grandchildren. Pallbearers will be Dr. Jimmy Alexander, Lloyd Martin, J.S. Thomas, Bill Stallsmith, Dr. B. Lamar Murray, Ja mes Hollingsworth, Manton Horton, Jr. and Frank Agerton. Family will receive friends Tuesday, February 24, 2004 from 7 to 9 p.m. at the funeral home. Memorial contributions may be made to the Bethel ARP Church, 7256 Hwy. 24, West, Louisville, Ga. 30434. Services entrusted to DeLoach-Kennedy Funeral Home, 842 Liberty Street, Waynesboro, Ga. 706-554-3531. Sign the guestbook at AugustaChronicle.com",
  "date_of_death": null
}, {
  "id": "49775757",
  "date_of_birth": null,
  "obituary_text": "Lowell E. Durham: The visitation will be from 10 a.m. until the funeral at 11 a.m. Saturday, May 3, at Immanuel Lutheran Church, 178 McHenry Ave., Crystal Lake. Interment will be in McHenry County Memorial Park in Woodstock. For information, call Querhammer \u0026 Flagg Funeral Home at 815-459-1760.",
  "date_of_death": null
}, {
  "id": "49570634",
  "date_of_birth": null,
  "obituary_text": "83, of 216 Perkins Drive, Hampstead, died Wednesday, Nov. 12, 2008, at Lower Cape Fear Hospice \u0026 LifeCareCenter. The funeral will be at 11 a.m. Monday at Manhollow Missionary Baptist Church, Hampstead, Burial will be at Edgecomb Community Cemetery. Dunn Funeral Home, Burgaw.",
  "date_of_death": null
}, {
  "id": "38506130",
  "date_of_birth": null,
  "obituary_text": "LLOYD, Bobby 61, Plant City, died Dec. 26, 2022. Visit Jan. 3, 3-5 pm, Service Jan. 4, 10 am both at Haught FH.",
  "date_of_death": null
}, {
  "id": "9621037",
  "date_of_birth": null,
  "obituary_text": "JIM FALLS -- Darrell J. \"Dude\" Felmlee, 71, of 13671 195th St., Jim Falls, town of Anson, died Monday, July 5, 2004, at his residence with St. Joseph\u0027s Hospice. He was born Sept. 26, 1932, in Jim Falls, the son of John S. and Bessee (Sherman) Felmlee. He worked for Jim Falls Dairy for 40 years and was a supervisor on the Jim Falls town board. He married Neomi Fox on Aug. 13, 1957, at Sacred Heart Church, Jim Falls. He was a member of the Knights of Columbus Jean Brunet Council #4948 and Sacred Heart Church, Jim Falls where he was very active in his church. He is survived by: his wife, Neomi; three brothers, George (Wilma) of Billings, Mont., Glen (Wanda) of Cokato, Minn., and Bill (Joan) of Jim Falls; one sister, Lorraine Heidtke of Chippewa Falls; and several nieces and nephews and other relatives and friends. He was preceded in death by: his parents; one brother, John Felmlee; and one sister, Virginia Felmlee. Funeral services will be held at 10:30 a.m. Thursday, July 8 at Sacred Heart Church, Jim Falls. Interment will be in Copp Cemetery, town of Anson. Friends may call from 4 to 8 p.m. Wednesday, July 7 and until 9:30 a.m. Thursday at the Horan Funeral Home, Chippewa Falls. There will be a Christian Vigil Service at 4:30 p.m. Wednesday at the funeral home. ",
  "date_of_death": null
}, {
  "id": "24344023",
  "date_of_birth": null,
  "obituary_text": "SOUTHINGTON - Ingrid Gale, 88 of Meriden Ave., died Saturday, Jan. 26, 2008, at the HCC @ Bradley Memorial. She was the beloved wife of Albert Gale.   Born Aug.19, 1919 in Waterbury, a daughter of the late Charles and Valborg (Svenning) Green. Ingrid retired from Town Dry Cleaners and was also a well known Silk Finisher in the area. She was a member of St. Paul Episcopal Church and the Southington Calendar House.   Besides her husband, she is survived by three children, Nancy Almquist and her husband, Richard Sr. of Southington, Thomas Gale Sr. and his wife, Michele of Southington and Barbara Gale of Kensington; four grandchildren, Karen Perry and her husband, Bo, Richard Almquist Jr., Melanie Deal and her husband, Brian and Thomas Gale Jr. and his wife, Melissa; four great-grandchildren, Thomas and Olivia Deal, Isabella and Annelise Gale. She was predeceased by a son-in-law, Gerald Thibeault.   The funeral will be held on Tuesday, Jan. 29, 10 a.m. at St. Paul Episcopal Church, 145 Main St., Southington. Burial will follow in St. Thomas Cemetery. Calling hours will be Monday from 4 to 7 p.m. In lieu of flowers donations may be made to the Southington Calendar House Memorial Fund, 388 Pleasant St., Southington, CT 06489. For online condolences and directions please visit, www.dellavecchiafh.com.",
  "date_of_death": null
}, {
  "id": "49001470",
  "date_of_birth": null,
  "obituary_text": "Cloyd Allen Bookout, 72, of 109 Richfield Terrace, husband of Martha Wiley Bookout, died Tuesday, June 10, 2008, at Greenville Memorial Medical Center. Born in Gastonia, N.C., he was the son of the late Reverend Leslie Edward and Creola Pernell Coffey Bookout. Mr. Bookout was a Broadcaster with WPTF, Raleigh, N.C.; WAME and WSOC in Charlotte, N.C.; WESC, WSSL, and WSPA TV in the upstate. He was a member of Brushy Creek Baptist Church, where he was a deacon and teacher. He formerly served as music director for Beulah Baptist Church, Fountain Inn; Tanglewood Baptist Church, Greenville; Brushy Creek Baptist Church, Taylors; and Victory Baptist Church, Gastonia, N.C. Surviving, in addition to his wife, are two sons, SFC Edward Bookout and his wife, Emily, of Vicenza, Italy and David Bookout and his wife, Andrea, of Greenville; and three grandsons, Ethan, Dawson and Joseph Bookout. Memorials may be made to the Mission Projects of Brushy Creek Baptist Church, 4999 Old Spartanburg Road, Taylors, SC 29687. Visitation will be held Friday, June 13, 2008, from 6 to 8 p.m. at Thomas McAfee Funeral Home, Downtown. The funeral service will be held Saturday, June 14, 2008, at 11 a.m. at Brushy Creek Baptist Church. Burial will follow in Graceland East Memorial Park. The family will be at the residence.Condolences may be sent to the family by visiting www.thomasmcafee.com",
  "date_of_death": null
}, {
  "id": "22538085",
  "date_of_birth": null,
  "obituary_text": "Donald F. Smith Sr., 69, of Elmhurst Twp., died Wednesday at home after a courageous battle with lung cancer. His wife of 46 years is the former Judith Elaine Flesch, originally from Scranton.Don was born in his family\u0027s Elmhurst Twp. home on Nov. 23, 1940, and was the oldest son of the late Franklin Z. and Wilma Yeager Smith. Don graduated from Scranton Central High School in 1957 and Broome Technical Community College. Before retirement, he was an engineer with General Electric and managed Bard Electronics. He also served as Elmhurst Twp. tax collector for many years.Don was a woodworking and metalworking craftsman, designing and creating countless projects for himself and others, including most prominently making his own violins. He enjoyed bluegrass music and the camaraderie of his friends when playing the fiddle or shooting pool.Until recently, he was an avid fisherman and golfer. He enjoyed going out to eat with his wife and friends and spending time with his family, especially his two grandchildren. Don also liked to work outdoors, planting flowers, picking blueberries and feeding the deer in his yard.Don was active in community organizations, serving as treasurer of First Presbyterian Church for many years, was a member and treasurer of Elmhurst/Roaring Brook Volunteer Fire Company, past master of Moscow Masonic Lodge and a member of Moscow Sportsman\u0027s Club.Don was a loving and caring husband, father and grandfather who will be greatly missed by all who knew him.The family wishes to thank Mercy Hospice for its compassionate care of Don for these last weeks.Also surviving are two sons, Donald F. Smith Jr., Pittsburgh; and Douglas A. Smith; a daughter-in-law, Amy Smith; and two grandchildren, Dayle Lynn Smith and Doug Smith Jr., all of Mount Cobb; three brothers, Kenneth and wife, Elyse, Somers, N.Y.; Robert and wife, Patricia, Haines City, Fla.; and Frank and wife, Cathy, Cortland, N.Y.; two aunts, Alice Smith, Beacon, N.Y.; and Evelyn Searing, Scranton; several nieces and nephews.Don wished that his body be donated to Commonwealth Medical College, Scranton, supporting his lifelong interest in science.There will be no visitation, but a memorial service will be May 22 at 11 a.m. in First Presbyterian Church of Elmhurst.In lieu of flowers, the family suggests donations to either First Presbyterian Church of Elmhurst or the American Cancer Society.Arrangements by Snowdon Funeral Home Inc., Moscow.",
  "date_of_death": null
}, {
  "id": "45380470",
  "date_of_birth": null,
  "obituary_text": "Mr. Gary Lance Wenner, 58, of Lovettsville, Va., died Friday, May 18, 2007, at his residence.Mr. Wenner was born in Leesburg, Va., on June 19, 1948, to Glendon and Capitola Coates Wenner.He was a groundskeeper.Surviving are his wife, Donna Wenner of Lovettsville, Va.; two sons, Robert Wenner and Michael Wenner and wife Jennifer, both of Brunswick; one grandson, Tommy Wenner; two sisters, Mary Martha Rude of Arlington, Va., and her son, David Alan Rude, and Marion Wenner Anderson and husband Douglas E. Anderson Sr. of Amelia, Va., and their children, John Christopher Henkle and wife Rachel Dawn with their two daughters, Shelbi Elizabeth and Marissa Joy and Michael Glendon Henkle; stepchildren, Douglas E. Anderson Jr. and wife Tiffany and their daughter, Corrinne, Michael R. Anderson and wife Carol and their daughter, Mikayla, John W. Anderson and wife Shadlynn Renee and their children, Alexandria, Samantha and Brenna Reed and Susan Anderson Kvavan and husband Erik and their daughter, Kiersty Grace.Mr. Wenner was preceded in death by his parents.A memorial service will be held at 11 a.m. Wednesday, May 30, at Mt. Pleasant United Methodist Church, 13266 Taylorstown Rd., Leesburg, Va., with the Rev. Gay Lynn Tonelli officiating.Arrangements are by John T. Williams Funeral Home, 100 Petersville Road, Brunswick._PaperDate 5/22/07",
  "date_of_death": null
}, {
  "id": "29373354",
  "date_of_birth": null,
  "obituary_text": "Edward R. Fortin, 79, of Bedford, died Thursday, September 21, 2006. Mass of Resurrection will be at 9:30 a.m. today at Holy Name of Mary Catholic Church. Arrangements by Tharp Funeral Home \u0026 Crematory, Bedford.",
  "date_of_death": null
}, {
  "id": "47713009",
  "date_of_birth": null,
  "obituary_text": "NEW ALBANY - Harris, James E., 69, died January 10, 2012. Kraft Funeral Home, Charlestown Rd. Chapel",
  "date_of_death": null
}, {
  "id": "46358783",
  "date_of_birth": null,
  "obituary_text": " Ruben Waren, 79, Cleveland, died 02-17-2013.  Arrangements: Cleveland.",
  "date_of_death": null
}, {
  "id": "30074091",
  "date_of_birth": null,
  "obituary_text": "Mientkiewicz, Blanche A. (nee Kowalczyk), beloved wife of the late Frank P., loving mother of Robert (Angie), Richard (Carol) and Marianne (Walter) Slepawic, dearest grandmother of Richard Jr., Adam, Daniel, David and Sarah and great-grandmother, dear sister of Mary Gruca, Sophie Grudzien, late John, Frank, Andy, Stanley, Joseph, Walter and the late Sister Dulciosa, fond aunt, cousin and friend of many. Funeral Saturday, from Wolniak Funeral Home, 5700 S. Pulaski Rd., to Nativity, BVM Church for Mass 10:30 a.m.. Interment Resurrection Cemetery. Visitation Friday, 2 to 9 p.m. Please omit flowers. For info: 773-767-4500",
  "date_of_death": null
}, {
  "id": "50140425",
  "date_of_birth": null,
  "obituary_text": "Mrs. Lily Ann Hughes, age 69, was born on July 16, 1936 in Palestine, TX to Winfred and Grace Adams, and passed away on February 22, 2006 in San Antonio, TX. She is survived by her husband, Harold Hughes; mother, Grace Adams; sons, Hal Hughes and wife Shari, Mark Hughes and wife Pat, Thomas Hughes and wife Jana, and Adam Hughes and wife Terry; daughter, Sandra Sursa and husband Travis; eighteen grandchildren; brother, Fred Adams; sisters, Quincy Roland, Lana Caperton, and Beverly Skelton; and numerous nieces and nephews. SERVICE There will be a public visitation on Friday, February 24, 2006 from 5 - 7 p.m. in the Mission Park Funeral Chapels North. A funeral service will be held on Saturday, February 25, 2006 at 12 p.m. in the funeral home chapel, with burial to follow in the Mission Burial Park North. In lieu of flowers contributions may be made to the American Diabetes Association, P.O. Box 1132, Fairfax, Virginia, 22038-1132, c/o Memorial Program. You may sign the on-line guestbook at www.missionparks.com under the obituary section. Mission Park Funeral Chapels North.",
  "date_of_death": null
}, {
  "id": "51285424",
  "date_of_birth": null,
  "obituary_text": "JAMISON, LUCILLE H., 80, of Palm Springs, died Thursday. A Cremation Service of the Palm Beaches, Boynton Beach.",
  "date_of_death": null
}, {
  "id": "26722585",
  "date_of_birth": null,
  "obituary_text": "SZEWCZYKJUDITH ELIZABETH (CHAKLOS)Age 63, of North Braddock, on Monday, August 15, 2005; loving mother of Terry Lynn Kalan of North Huntingdon and Robert K. Szewczyk (Linda Lee) of Pittsburgh; sister of Barry (Bonnie) Chaklos of MO; daughter of George Chaklos of Sharon. Judith was a Registered Nurse at the VA Hospital and Braddock Hospital for many years. Friends will be received Wednesday 4-9pm at the JOBE FUNERAL HOME, INC., corner Shaw \u0026 Triboro Ave. Turtle Creek where service will be held Thursday 11 o\u0027clock AM.Send condolences at post-gazette.com/gb",
  "date_of_death": null
}, {
  "id": "50739840",
  "date_of_birth": null,
  "obituary_text": "Stockton, CA Aug. 5, 1981 - May 25, 2006 Robert Franklin Williams, age 24 of Stockton, passed away Thurs., May 25, 2006. Services: Memorial, Sun., June 10, 2006, 2 p.m., Lake View Assembly, 211 Quail Lakes Dr., Stockton, CA 95207. Neptune Society of Northern California, Stockton Branch in charge of arrangements. ",
  "date_of_death": null
}, {
  "id": "38805523",
  "date_of_birth": null,
  "obituary_text": "Daniel Thomas Woodriff, 79, transitioned to the other side of the veil, on Monday night June 15, 2020.He was born in Bozeman, MT on March 26, 1941 to Margaret Oswald Woodriff and Ray Alan Woodriff. No matter what Daniels\u0027 personal circumstances, he was always positive and always willing to help others. He was a good friend to many and a student of all things that he believed influenced life on earth and beyond. His Friends are holding a \"Celebration of Life\" gathering on Thursday evening 6/25 at the gazebo on the south end of Sacajawea Park in Livingston, starting at 6pm. If you crossed paths with Daniel in this life, please come and Celebrate with his other Friends and Family.A more complete obituary is forthcoming.",
  "date_of_death": "2020-06-15"
}, {
  "id": "31317104",
  "date_of_birth": null,
  "obituary_text": "Summer Dawn Dysert  April 12, 1976 - October 27, 2021  Tacoma, Washington - Summer Dysert was a loving mother and grandmother. She loved life.  Summer is preceded in death by her brothers, Christopher and Benjamin.  She is survived by her son, Caleb Langworthy/Samantha, her grandsons, Jaxson and Avery, and her mother, Linda Guttormson/Tom. She was loved.",
  "date_of_death": null
}, {
  "id": "20963896",
  "date_of_birth": null,
  "obituary_text": "SANDRA FAY (QUEEN) KELLER, 66The Ledger/Publix LAKELAND - Sandra Fay (Queen)Keller, age 66 of Lakeland, died December 31, 2010 of renal failure.  Sandra was born November 7, 1944 in Harrisonburg, Virginia and moved to Lakeland in 1966. She retired from The Ledger and Publix. Ms. Keller is survived by her children Charles Edwards, Alan Edwards, and Steven Edwards of Lakeland, Angela Hoenicke of Orlando, and four grandchildren.  A private service is planned.",
  "date_of_death": null
}, {
  "id": "26429613",
  "date_of_birth": null,
  "obituary_text": "POLITANO Al Politano, age 80, of Milford, a self-employed salesman, died on Sunday, November 6, 2005, at the West Haven Veterans Hospital. Born in Italy and raised in Bridgeport, he had been a Milford resident for more than 30 years. He was a U.S. Army veteran of World War II and was a member of the North End Columbus Association. Survivors include a daughter, Eileen Klein of Milford; a son, Richard Politano of Ansonia; five grandchildren, Jessica Klein, April Kandrach, Rikki, Sara and Zachary Politano; four great-grandchildren, Joey, Miranda, Trevanna and Risten; and several nieces and nephews. Funeral services will take place on Thursday, November 10, 2005 at 9:30 a.m. in the Abriola Parkview Funeral Home, 419 White Plains Rd., Trumbull. Interment will follow in Kings Highway Cemetery, Milford. Friends may call on Wednesday (TODAY) from 4 to 8 p.m. To light a virtual candle, visit us at www.abriola.com.",
  "date_of_death": null
}, {
  "id": "28636414",
  "date_of_birth": null,
  "obituary_text": "Viola Janette Till, 81, died on March 21, 2008, from a long illness at her home in Klamath Falls with her daughter Debra Till at her bedside.  At her request, there will be no services.  Viola was born on April 26, 1926, in Fort William, Ontario, Canada, to David Ross and Jane Cecilia Hayes.  She went to school in Rock Island, Ill.  On April 22, 1946, Viola married Frank H. Till Jr.  She enjoyed fishing, camping, spending time with her family and friends, cooking and entertaining groups of friends, and being with her cats.  Viola is survived by her daughter and caregiver Debra Till, Klamath Falls, Ore.; two sons Rodney Till and his wife Kathy and grandson Michael, all Oxford, Ala., and Dennis Till, San Francisco, Calif.; one brother Victor Ross in Iowa; plus nieces and nephews.  Viola also has left behind a lot of special friends who will miss her dearly: Gerald Hartley, James Auld, Mary Macher and her father Frank Benac and Georgianna Garrison, and all the wonderful people of Klamath Hospice.  She was preceded in death by her parents, three sisters, a son, a baby daughter and a nephew.  \"I want to thank Klamath Hospice for the wonderful job they did for Viola Till!\" Debra, with much Love!  Davenport\u0027s Chapel of the Good Shepherd, directors, is in charge of the arrangements.",
  "date_of_death": null
}, {
  "id": "27340663",
  "date_of_birth": null,
  "obituary_text": "Family-Placed Death Notice BAILEY, James Celebration of Life for Mr. James Bailey of 4442 Yates Road, College Park, Ga 30337 will be held Saturday August 7, 2010 2:00Pm Gus Thornhill\u0027s Funeral Home Chapel 1315 Gus Thornhill Jr. Dr. East Point Ga. 30344. Rev. Craig McClure officiating. Interment: Ga. National Cemetery, Canton Ga. He is survived by James L. Bailey, Gregory Sims, Taffie Bailey; brothers, Amos Johnson, George W. Bailey; sisters, Rebecca Parker, Maeola Houston, Irene Marable, Barbara Sims (Arthur Sims) 5 grandchildren, and a host of nieces, nephews, other relatives and friends. Family and friends are asked to assemble at 2840 Norman Berry Dr. #103 East Point Ga 30344. GUS THORNHILL\u0027S FUNERAL HOME. lNC. 404-768-2993-4",
  "date_of_death": null
}, {
  "id": "22219804",
  "date_of_birth": null,
  "obituary_text": "PEEBLES, Stuart A. Stuart A. Peebles passed away March 10, 2017, in Dunwoody, following an extended illness. He was born April 2, 1926, in Syracuse, NY, and is survived by his wife Sallie Moore Peebles of Dunwoody; two sons David Peebles (Sheila Lemke) of Syracuse and Andrew Peebles (Genelle) of Skaneateles, NY; and daughter Susan McLaughlin (David) of Seneca, S.C. as well as six grandchildren; and six great grandchildren; nephew Chuck Sandford of Atlanta and niece Priscilla Worral of Skaneateles, NY. Mr. Peebles was a graduate of Syracuse University with a degree in Civil Engineering and a master\u0027s degree in Business Accounting. He was associated with Allied Chemical Co. in Syracuse and New York City until 1970. From 1971 until 1999, he was president and principal owner of the Tidwell Office Supply Company in downtown Atlanta. He headed the Fairlie Poplar Task Force and was instrumental in restoration of the area. He was a member of the Atlanta Chamber of Commerce, the Atlanta Convention Bureau and Central Atlanta Progress. He was a member of the Peachtree Kiwanis Club where he served as president and lieutenant governor of Division 1. He was a member of the Atlanta Chapter of the Financial Executives Institute where he served as president. He and his wife lived in Rome, Georgia from 2003 until 2012 where they were involved in St. Peters Episcopal Church and a variety of civic activities. They returned to Atlanta to be near family. In addition to his immediate family, he leaves a step son, three step daughters, several step grandchildren and step great grandchildren. Mr. Peebles was a long time communicant of the Cathedral of St. Philip. A service will be held there on Monday, March 20th, at 3:00 p.m. with a reception to follow. In lieu of flowers, the family requests donations be made to the Cathedral of St. Philip.",
  "date_of_death": null
}, {
  "id": "19719071",
  "date_of_birth": null,
  "obituary_text": "WALERYSZAK, Claudette M. (Leveillee)74, passed away on Saturday, June 19, 2021. Wife of the late Thomas Waleryszak. Mother of Adam Waleryszak, Linda Langevin and John Sestilli Jr.Full obituary and condolences at carpenterjenks.com",
  "date_of_death": null
}, {
  "id": "48459039",
  "date_of_birth": null,
  "obituary_text": "VERLAND J. BECKHAMNewtonVerland, 74, died on Monday, December 7, 2009. Funeral services will be held at 1:30 p.m., Friday, December 11 at the funeral home. The family will greet friends from 12:30 to 1:30 p.m., Friday, at the funeral home.",
  "date_of_death": null
}, {
  "id": "44443569",
  "date_of_birth": null,
  "obituary_text": "Eugene R. Thompson, 41, of Iowa City, died Friday, April 3, 2009, at his home. Cremation services were provided by Gay \u0026 Ciha Funeral and Cremation Service. No other services are planned.",
  "date_of_death": null
}, {
  "id": "49600777",
  "date_of_birth": null,
  "obituary_text": "Athens - John Smith, 41, of Athens, died Wednesday, October 8, 2008. Services will be 2pm, Thursday, October 16, 2008 at Coy C. Williamson Jr. Memorial Chapel of Gardenview. Survivors include father, James Dowdy Sr.; daughter, Lisa Smith; five brothers; two sisters. Gardenview Funeral Chapel, Athens, has charge of arrangements.",
  "date_of_death": null
}, {
  "id": "41210302",
  "date_of_birth": null,
  "obituary_text": "January 12, 2006 Age 88. Beloved wife of the late William. Loving mother of Andrew (Nancy Orr) Grzelak and Cynthia (Robert Mcauliffe) Grzelak. Dear sister of Florence (Joseph) Chmielewski. Also survived by two nieces Pam and Sandy. Long time friend Arlene. In state Saturday 9:00 a.m. at St. Mark Catholic Church until the time of Mass 9:30 a.m. Visitation Friday 2-9 p.m. with a 7 p.m. Vigil Service at the D.S. Temrowski \u0026 Sons Funeral Home, 30009 Hoover Road at Common (12½ Mile). see obit at: www.temrowski.com",
  "date_of_death": null
}, {
  "id": "29485374",
  "date_of_birth": null,
  "obituary_text": "Margaret Moore Kennedy GRISWOLD Margaret Moore Griswold was born on Capitol Hill, Seattle, December 18, 1918 to John \u0026 Jessie Kennedy. She graduated from Garfield High School in 1937 and worked at Frederick and Nelson until August 2, 1941 when she and Norris were married in her parent\u0027s home. Margaret and Norris moved many places, Fairbanks, Anaheim \u0026 Seattle, preferring the Northwest. They lived in 16 different houses. They both appreciated the various areas they lived in and felt enlarged by each. Margaret was always (since age 16) been an enthusiastic golfer and hiker. She loved classical and jazz music, good books and pictorial arts. She did wood carving and watercolor. She attended Des Moines Gospel Chapel and through their ministry she became a Christian in 1952. Margaret and Norris had four children. Bill (Sharon) now living in San Diego, Gary (Lois) lives in Boston, Joan (John) Hatchel in West Seattle and Patricia (Clifford) Russell, Lake Oswego Oregon. There are 9 grandchildren and 6 great grand children so far. Her elder sisters Becky and Agnes preceded her in death. Memorial Services are Saturday, August 16, 2003 at 2:00 p.m. at the Des Moines Gospel Chapel. Memorials are suggested to His Fathers Ranch, P.O. Box 13521, Tonasket, WA. 98855 or Highline Hospice.",
  "date_of_death": null
}, {
  "id": "48271527",
  "date_of_birth": null,
  "obituary_text": " Visitation for Bettie Jo Albertson of Longview will be from 5-7 p.m. today, February 10, 2011, at Rader Funeral Home of Longview, 1617 Judson Road, Longview, Texas. Graveside services will begin 10 a.m. Friday, February 11, 2011, at Rosewood Park Cemetery, 1884 FM 1844, Longview, Texas. Mrs. Albertson suddenly passed away Tuesday, February 8, 2011, in Longview .   Mrs. Albertson was born August 4, 1942, in El Paso, Texas. She was a member of Trinity Episcopal Church in Longview, Texas. She was a loving, devoted wife, mother and grandmother, and as all know, she had a special place in her heart and home for many beloved pets. She will be deeply missed.   Survivors include her husband of 39 years, Fred Albertson of Longview; son and daughter-in-law, Sean Albertson and wife, Dawn, of Longview , Texas; grandson, Ryan Albertson and wife, Korie; granddaughter, Lauren Albertson; father, Ray Burrows of Van Buren, Arkansas; brother, Ronnie Vaughan of Fort Smith, Arkansas; and many other extended family members and friends.   A memorial guestbook may be signed at www.raderfh.com  ",
  "date_of_death": null
}, {
  "id": "29899477",
  "date_of_birth": null,
  "obituary_text": "Elsie O. Mumaw, 82 of Grafton ( Lucretia Community) passed away on Saturday, May 8, 2004 at Fairmont General Hospital after a brief illness.  She was born on September 21, 1921 in Grafton a daughter of the late Luther and Flora Cox Funk.  She was employed at the West Virginia Industrial School for Boys as a secretary for several years.  She was presently employed in the Taylor County Clerk’s office as a deputy clerk a position she had held for 30 years.  She was a member of the Grafton Business Women and a member of the First Grace Brethren Church in Grafton. In addition to her parents she was preceded in death by her husband; Lloyd Mumaw and one sister; Hazel McDaniel. She is survived by two sisters; Alta Crist of Charlotte, NC, Dorothy Hoffman of Albany, CA, two brothers; Joe Funk of Lakeland, FL and Herb Funk of Arlington, VA. Funeral services will be held 2:00 p.m. Thursday, May 13, 2004 at the Bartlett Funeral Home with the Rev. Joshua Brown officiating.  Interment will follow in Woodsdale Memorial Park, Grafton. Friends may call at the funeral home from 2-9 p.m. on Wednesday. In lieu of flowers contributions may be made to the First Grace Brethren Church of Grafton.  Condolences may be extended to the family at www.bartlettfunerals.com.",
  "date_of_death": null
}, {
  "id": "20523074",
  "date_of_birth": null,
  "obituary_text": "Wright, Allan Henry,  age 68, a resident of Orange, passed away June 14, 2011. He is survived by his loving family: wife, Sallie Wright; daughter, Jill Nash (Steve); son, Jeff Wright (Cynthia); 5 grandchildren, Brooke, Carter, Nolan, Nixon, Nevin; and brother, Wayne Wright. \"Papa\" loved to enjoy his Hot Rods, relax with friends at the river and spend time with the grandchildren. After retiring from Verizon, with 40 years of service, he enjoyed his retirement by lunching with Grammy at Ruta\u0027s and visiting family in North Carolina. He will be dearly missed by all that knew him, but he will never be forgotten. A visitation will be held Monday, June 20, 2011 from 4:00-8:00 pm at Shannon-Bryan Mortuary. A Funeral Service will be held Tuesday, June 21, 2011 at 1:00 pm at St. John Lutheran Church in Orange with interment to follow at St. John Lutheran Cemetery. In lieu of flowers, donations may be made to CHOC or the charity of your choice.  Shannon-Bryan Mortuary ",
  "date_of_death": null
}, {
  "id": "48408595",
  "date_of_birth": null,
  "obituary_text": "DECK, GORDON R., 60, Committal Service: 10:30 a.m. Nov. 15, 2010 at Ft. Bliss National Cemetery. Survived by sons Russel, Ryan \u0026 Brian Deck, mother Gerlinde Kiefer, brothers Charlie \u0026 Ralf Deck, sisters Connie Quinones, Carmen Cereceres, Marian Deck, Corinna Crandall, \u0026 Kirsten Edwards.",
  "date_of_death": null
}, {
  "id": "20981685",
  "date_of_birth": null,
  "obituary_text": "Hapke, Ruth, passed into the loving arms of her Savior on Jan. 29, 2011. She is survived by her loving husband, Walter Hapke of 58 years; 2 sons, Marc and Scott; a daughter in law; 3 grandchildren; and 3 great-grandchildren. Service will be held at Pacific View Memorial Park in Corona Del Mar, Feb. 12 at 2:30 pm. She will be missed but never forgotten. ",
  "date_of_death": null
}, {
  "id": "47568663",
  "date_of_birth": null,
  "obituary_text": "LEWIS, Willie Sr. \"\"Crack\"\", aresident of Montgomery,Alabama expired Monday,October 3, 2011 at his residence. Funeral arrangements and survivors will beannounced by E. G. Cummings Memorial FuneralHome, Inc.",
  "date_of_death": null
}, {
  "id": "10141655",
  "date_of_birth": null,
  "obituary_text": "Died Feb. 8, 2008 Walter J. Murray Jr., 77, of Gainesville died Friday. Memorial Park Funeral Home, Gainesville.",
  "date_of_death": null
}, {
  "id": "49622521",
  "date_of_birth": null,
  "obituary_text": "News Obituary ListingWINIFRED MERRILL, 82, of Buford died Monday. Funeral plans will be announced; Flanigan Funeral Home.",
  "date_of_death": null
}, {
  "id": "12598859",
  "date_of_birth": null,
  "obituary_text": "John \"Ray\" Sobotka, 77, of Springdale, died Wednesday, April 24, 2019. He was born Nov. 17, 1941, in New Kensington, to the late John J. and Cecelia (Kaniecki) Sobotka. He was a 1959 graduate of Springdale High School. Ray was the owner of the former Sobotka\u0027s Market, Natrona, for many years. He then went to work for Community Market, working in the meat department as a meat cutter. He was a member of the West Deer VFD No. 1 and was a constable of elections in West Deer. He enjoyed watching his cowboy movies and series, especially John Wayne movies. Survivors include his children, Anita M. Sobotka, at home, Michael J. Sobotka, of Ft. Lauderdale, Fla., and Jeannie R. (Ed) Skripets, of Springdale; his companion of 11 years, Bernadette Mundy, of West Deer; sister, Anita (Rodger) Cleis, of Harwick; sisters-in-law, Helen (Pastierik) Sobotka, of Springdale, and Marcy Funkouser, of Springdale; and many nieces and nephews and his furry friend, Leo. Besides his parents, he was preceded in death by his wife, Carol J. (Pearson) Sobotka, Dec. 31, 2004, his brother, David Sobotka, and his brother-in-law, Gary Funkhouser. Friends will be received from 6 to 8 p.m. Saturday April 27, 2019, and from 2 to 4 and 6 to 8 p.m. Sunday, April 28, 2019, in the SIWICKI-YANICKO FUNERAL HOME, 23 McKrell Road, Russellton, West Deer Township, where parting prayers will be conducted at 9:30 a.m. Monday, April 29, 2019, with a Catholic funeral Mass following in Transfiguration Roman Catholic Church, Russellton, West Deer, with the Rev. James P. Holland, officiating. He will be laid to rest next to his wife in Mt. Airy Cemetery, Harrison Township. View obituary and leave condolences at www.siwicki-yanickofh.com.",
  "date_of_death": "2019-04-24"
}, {
  "id": "24811471",
  "date_of_birth": null,
  "obituary_text": "WALLACE, Beverley A., 79, of North Chesterfield, passed away on Friday, February 15, 2013. She loved sewing, crafting, gardening and her chickens. Mrs. Wallace was a great cook and made a fantastic banana pudding that her family always enjoyed. She loved family get-togethers, especially at Christmas. Mrs. Wallace was a member of Bellwood Baptist Church and loved working in the nursery. She was also an avid traveler. Mrs. Wallace is preceded in death by her first husband, Raymond J. Corbin; her second husband, Flay Wallace; two sons, David A. Corbin and Christopher A. Corbin; and her parents, Raymond and Mabel A. Harter Brown. She is survived by her sons, Raymond L. Corbin and his wife, Lea, Edward A. Corbin and his wife, Margaret, James M. Corbin and his wife, Wanda, Ronald J. Corbin, Michael W. Corbin, Steven F. Corbin, Eugene L. Corbin and his wife, Allison, and Hank W. Corbin and his wife, Michelle; daughter, Delilah A. Stevenson and her husband, John; a brother, Cecil Brown and his wife, Joan; 30 grandchildren, 26 great-grandchildren and other loving family and friends. The family will receive friends from 6 to 8 p.m. on Sunday, February 17, 2013 at the Chester Chapel of J.T. Morriss \u0026 Son Funeral Home. A funeral service will be held at 2 p.m. on Monday, February 18, 2013 at Bellwood Baptist Church, with Pastor Tony Young officiating. Interment will be private. In lieu of flowers, memorial contributions may be made to Bellwood Baptist Church, 9138 Quinnford Blvd., North Chesterfield, Va. 23237. Condolences may be registered online at www.jtmorriss.com.  This obituary was originally published in the Richmond Times-Dispatch.",
  "date_of_death": null
}, {
  "id": "30014482",
  "date_of_birth": null,
  "obituary_text": "Rose M. Gula Stanger,  80, a lifetime resident of the Akron, Ohio, area, a member of St. Nicholas Byzantine Catholic Church, died on Tuesday, September 25, 2001. The family will receive friends on Friday, September 28, 2001, 4-8 p.m., at Schlup-Pucak Funeral Home, 788 Kenmore Boulevard, Akron. Parastas services are scheduled for Friday, 6:45 p.m., at the funeral home. Lying in state on Saturday, September 29, 8:30 a.m., at St. Nicholas Byzantine Catholic Church, 1051 Robinson Avenue, Barberton, Ohio. A Divine Liturgy will be offered on Saturday, 9:30 a.m., at the church, officiated by Fr. Stephen Muth. Burial will be at Greenlawn Memorial Park. Arrangements entrusted to Schlup-Pucak Funeral Home, Akron, Ohio.",
  "date_of_death": null
}, {
  "id": "13254108",
  "date_of_birth": null,
  "obituary_text": "Mr. Robert V. Shupe, of Fisher, W.Va., passed away Saturday, Feb. 27, 2010.Born Aug. 8, 1940, he was the son of the late Ethel Mills and George Shupe.Mr. Shupre was retired from the Montgomery County School Board.He is survived by a son, Robert V. Shupe Jr.; two grandchildren; brothers, Roscoe Shupe of West Virginia, William Shupe of Texas, and Guy Mills of Frederick; and a sister, Virginia Rabbitt of West Virginia.He was predeceased by two daughters.Visitation will be held from 9 to 11 a.m. Wednesday, March 3, at Devol Funeral Home, 10 E. Deer Park Drive, Gaithersburg. Burial will be private.",
  "date_of_death": null
}, {
  "id": "50363658",
  "date_of_birth": null,
  "obituary_text": "Lalla Cain, 84, died Friday, Oct. 24, 2003. The funeral will be at 2 p.m. today at New Bethel Baptist Church, with burial in New Bethal Church Cemetery. Deaton Funeral Home, Belmont, is directing.She was preceded in death by her husband, Lester Cain, in 1986.",
  "date_of_death": null
}, {
  "id": "12190468",
  "date_of_birth": null,
  "obituary_text": "On April 20, 2016, Joseph Harry James a United States Navy Veteran of Baltimore; beloved husband of the late Geraldine Viola James; devoted father of Beverly Carol Taylor and her late husband Gary, Joseph Glen James and his wife Kathleen, Natalie Grace McNally and her late husband Robert; cherished grandfather of Terry, Gary, Irene, Ryan, Matthew, Emily, Stephanie, Stacy and Shelly. Also survived by 20 great grandchildren and 2 great great grandchildren. Joseph is preceded in death by his two granddaughters Cynthia and Lisa. Family and friends will honor Josephs\u0027 life at the family owned Evans Funeral Chapel and Cremation Services - Parkville, 8800 Harford Rd. on Sunday, April 24, 2016 from 2-4 \u0026 6-8 PM where a funeral service will be held on Monday, April 25, 2016 at 11 AM. Interment Moreland Memorial Park.",
  "date_of_death": null
}, {
  "id": "6360934",
  "date_of_birth": null,
  "obituary_text": "Willie Henry Sullivan age 76 passed Sunday at the Condor Health. Graveside services will be held Saturday at 11:00A.M. at Anderson Memorial Gardens. Public viewing will be today from 12:00-6:00P.M. at Foggie-Holloway\u0027s Funeral Home. The family is at 28 Lewis Street Anderson S.C.",
  "date_of_death": "2021-08-22"
}, {
  "id": "41657874",
  "date_of_birth": null,
  "obituary_text": "December 12, 2008. Beloved wife of James P. Dear mother of James P. III (Suzanne), Toni A. (John) Panzo, Dan C. and Randy J. (Debbie). Grandmother of Randy II (Kim), Gina, Julie, Chris, Torrie and Alex. Great Grandmother of Briannah Mary. Sister of I. J. Poupard, Kathleen Linderman and Dolores Smith. Funeral Monday 11 a.m. from the chapel of the L. J. Griffin Funeral Home, 7707 Middlebelt Rd. (at Ann Arbor Trail). Family will receive visitors Sunday 1-9 p.m. Share a \"Memorial Tribute\" with the family at griffinfuneralhome.com",
  "date_of_death": null
}, {
  "id": "8545766",
  "date_of_birth": null,
  "obituary_text": "HAMPTON - Rose Agnes Marcotte, 102, passed away on Sunday, August 23, 2020. Rose was born in Haverhill, Mass., on November 23, 1917, a daughter of the late Edward and Rose Anna (Proulx) Highe. She shared over 57 years of beautiful marriage with her late husband, Arthur C. Marcotte who died in 1997. She is survived by her daughters, Alice Moline and her husband, Russ, Colette Oleson and Michele Coughlin and her husband, John, and her son, Arthur Bernard Marcotte and her four grandchildren and eight great-grandchildren. In addition to her parents and her dear husband Arthur, Rose was predeceased by her sisters, Marie Highe, Sister Alice Highe S.C.O. and Helen Mooshian and her infant grandson, Eric Oleson. SERVICES: A Mass of Christian Burial will be celebrated at 11 a.m., on Monday, August 31, 2020 at Our Lady of the Miraculous Medal Church, 289 Lafayette Rd., Hampton. Burial will follow in the High Street Cemetery. Arrangements are by the Remick \u0026 Gendron Funeral Home – Crematory, Hampton. Please visit www.RemickGendron.com to read Rose\u0027s complete obituary, to sign her tribute wall and for additional information.",
  "date_of_death": null
}, {
  "id": "26360983",
  "date_of_birth": null,
  "obituary_text": "ROBERT ALFRED BARNES - 81, of Greenwich, husband of the late Helen Scully Barnes, passed away peacefully at home Friday evening, December 9th.Mr. Barnes was born in Greenwich January 4, 1924, son of the late W. Everett and Adelheide Scherer Barnes and has been a lifelong resident. He was a 1941 graduate of Greenwich High School and attended the University of Connecticut. During World War II Bob joined the Navy and following boot camp in Newport, RI, he volunteered for the submarine service and attended battery-gyro school. He was assigned to new construction at Electric Boat in Groton and served on the commissioning crew of the U.S.S. Angler (SS240) on which he made three war patrols in the south pacific out of the home port of Fremantle, Australia. Bob was then transferred to the U.S.S. Gurnard (SS254) and made three more war patrols until the war in the pacific ended.Following the war he completed studies to become a Funeral Director and Embalmer and was licensed in the State of Connecticut where he was associated with the Fred D. Knapp \u0026 Son Funeral Home for fifty years. He is past president and board member of the Greenwich Exchange Club, a member of Submarine Vets of World War II, the Navy League and the Naval Institute. Bob was appointed as Greenwich Harbor Master by Gov. Lowell Weicker and served from 1991 through 1994. He is an original member of Christ Church Boys Choir under the direction of Claude Means, he also served as co-chair for Lowell P. Weicker Campaign for Connecticut Governor; he is a charter member and former director of the Greenwich Horseneck Club.Bob was a member of the Old Greenwich Yacht Club, owned a 22\u0027 sailboat moored in Tod\u0027s Point Point Cove and sailed Long Island Sound for forty years making numerous trips up and down the eastern seaboard as far as Tortola B.V.I.Survivors include one son, David Everett Barnes of Greenwich, Ct., three daughters, Cheryl B. McMahon of Chestnut Ridge, NY, Elise B. Kennedy of Sanibel Island, FL, and Juliette B. Rota of Greenwich, Ct.; one sister, Jean B. Burr of Dennis, MA, a dear friend, Karen, three grandchildren, Erin M. Johnson, Lynda M. DiMena, Samantha Kennedy and two great grandchildren, Nicholas Johnson, and Kayla DiMena. he was also predeceased by one son, R. Macy Barnes.Friends are invited to attend a funeral service Wednesday 10:30 am at Christ Church, 254 East Putnam Ave., Greenwich. Private interment will take place in Union Cemetery. The family will receive friends Tuesday from 4 to 8 pm in the Fred D. Knapp \u0026 Son Funeral Home, 267 Greenwich Ave. Greenwich, CT. Contributions in memory of Bob may be made to a charity of choice.",
  "date_of_death": null
}, {
  "id": "13560323",
  "date_of_birth": null,
  "obituary_text": "Beloved daughter of the late Andrew and Josephine (nee Mucha); dear sister of Andrea; cherished aunt of Adrienne and the late Jesse; loving great aunt of Tyler and Logan. Mass of Christian Burial, Thursday, October 26 at 10am at Transfiguration Parish, 12608 Madison Ave. Friends may call at THE JOSEPH MISENCIK FUNERAL HOME, 12500 MADISON AVE., LAKEWOOD, WEDNESDAY OCTOBER 25, 4-6PM. Interment Holy Cross Cemetery.",
  "date_of_death": null
}, {
  "id": "24039915",
  "date_of_birth": null,
  "obituary_text": "Rosella M. Toppenberg passed away Feb. 4, 2008, in Sacramento at the age of 90.   Born in Buffalo County, Neb. on Nov. 24, 1917, to the late Frank A. Richter and Ottilla Pauline \"Dotty\" Litty. While attending business school in Iowa City, her eyes met those of Otto Toppenberg in Reich\u0027s Cafe. Their marrage of 1939 was interrupted by Otto\u0027s service with the U.S. Navy and his work on the Alcan Highway. During that period Rosella lived in Iowa City, Los Angeles, San Francisco and Seattle. The couple moved to California in 1949, and Rosella spent 38 years with the U.S. Postal Service where she became Hesperia\u0027s Assistant Postmaster.  She retired in 1984.  She leaves behind her children; Christine of Las Vegas; Janet (Denny Lewis) of Galt; Lily of Sacramento; and Val (Susan) of West Sacramento; and her dear grandchildren, Alec and Kelly. She worked tirelessly to help provide for her children and help them attend college, but always had time for kids activities and clubs.  Preceded in death by her husband, Otto; sisters Helen Hand (Russ); Katherine Thomas (George); Pauline Priebe (Earl); and Loretta True (Harry); and brothers Joseph (Pat); and Kenneth.  Also survived by sisters Edith Grantham (Wilfred); Francis Behn (Harry) and Waunita Kouba (Stanley); and brother Harold (Billie).   Memorial services will be held on March 17, 2008, at 10:30 a.m. at Riverside National Cemetary. The family requests, in lieu of flowers, remembrances to the Alzheimer\u0027s Assocation, Yolo Hospice or the Asian Community Nursing Home in Sacramento in recognition of their kind assistance to Rosella and her family.",
  "date_of_death": null
}, {
  "id": "15438708",
  "date_of_birth": null,
  "obituary_text": "CABRAL, AUDREY R. 90, died December 19, 2013. A Mass of Christian Burial will be held Monday at 10 am in Mary, Mother of Mankind Church. Calling hours Sunday 4-6 pm in the Robbins Funeral Home. For full obituary, visit robbinsfuneralhome.com",
  "date_of_death": null
}, {
  "id": "26469987",
  "date_of_birth": null,
  "obituary_text": "GRACIE RAE SNIDER passed away on February 21, 2007. She is survived by her parents Gregory Snider and Stephanie R. Harper Snider; siblings, Ava, Aylssa, Joshua and Jakob; maternal grandmother, Alona Atkinson; paternal grandmother, Gillian Snider; paternal grandfather, Wendell Snider; paternal great grandparents, Harold and Mavis Barbin; maternal great grandparents, Everett and Dianne Atkinson along with other relatives. Funeral services will be held at 10:30 AM on Saturday, February 24, 2007 in the Chapel of Woodlawn Funeral Home with Pastor Jack Pidgeon. Visitation will be one hour prior to service. Interment in Woodlawn Garden of Memories.",
  "date_of_death": null
}, {
  "id": "25706397",
  "date_of_birth": null,
  "obituary_text": "VOISINE, Wilfred \"Puss\" A. Wilfred \"Puss\" Voisine, 54, passed away Friday, (October 6, 2006) at home surrounded by his family. Will was born in Presque Isle, ME on May 23, 1952 to the late Gilman and Winnifred June Voisine. He worked in construction all of his life. Will lived in Connecticut for 19 years before moving to Manchester, NH. He leaves behind: a loving wife of 37 years Juanita Voisine; two sons, Douglas Wilfred Voisine Sr. and his wife Lisa, Dennis Voisine and his longtime girlfriend Nicole; One daughter, Stacey Chauvette and her husband Kevin; seven grandchildren, Ashley, Douglas Jr., Trista, Antonia, Jarett, Monique and Nichole all of NH; four sisters, Rachel Roy, Rhonda LaPlante, Sharon Thibodeau and Geneva Deutschi; one brother, Gilman \"Wayne\" Voisine all of CT. He also leaves behind many aunts, uncles, nieces, nephews, cousins and friends. He was predeceased by a brother Ervin Voisine. Will loved old western movies and country music. He loved being around family and friends and was known by all for his jokes. He always had you smiling and will surely be missed. A calling hour will be at Phaneuf Funeral Homes and Crematorium, 243 Hanover St, Manchester, NH on Monday from 2-4 p.m. and 7-9 p.m. His Funeral Mass will be celebrated on Tuesday at 10 a.m. at the Church of the Transfiguration, Manchester, NH. Following cremation burial will be at St. Joseph Cemetery, Bedford, NH. Donations may be made to Mr. Voisine\u0027s family to help with his expenses. To view an on-line memorial, get directions or for more information, go to www.phaneuf.net.",
  "date_of_death": null
}, {
  "id": "49164896",
  "date_of_birth": null,
  "obituary_text": "FARMERSVILLE - Miriam Edna Ruth Kent of Farmersville died Friday, Oct. 16, 2009 at the Hinton Nursing Home in Farmersville. She was 76. Services will be at 10 a.m. Monday at Hurst\u0027s Fielder-Baker Chapel in Farmersville with Rev. David Meeks officiating. Burial will follow at IOOF Cemetery in Farmersville. Surviving are her daughters, Debra Krieger of Waynesboro, Tenn. and Jeanie Shackelford of Princeton; sister, Moneta Jane Beasley of  Manvel, Texas; brother, Ben Byrd of Hurst; one grandchild and two great-grandchildren. The family will receive friends at the funeral home from 5 -7 p.m. Sunday.",
  "date_of_death": null
}, {
  "id": "19046993",
  "date_of_birth": null,
  "obituary_text": "RODNEY \"BIG SHO\" T.WILLIAMS, 45Warehouse Services LAKELAND - Rodney \"Big Sho\" T. Williams, 45 died 8/27/12 (cardiac). Memorial service today, Sat. at 3pm at Oldham Funeral Chapel (1537 N. Kettles Ave.)",
  "date_of_death": null
}, {
  "id": "39858396",
  "date_of_birth": null,
  "obituary_text": "BARBA, DYLAN, 7, Visitation: 5-9 p.m. Fri. at Hillcrest Funeral Home-Carolina with Vigil at 7 p.m. Funeral Mass: 9 a.m. Sat. at Corpus Christi Catholic Church. Interment to follow at Mount Carmel Cemetery.",
  "date_of_death": null
}, {
  "id": "15706978",
  "date_of_birth": null,
  "obituary_text": "Donald R. Lebo, 74, of 201 S. Yohe Street, Tower City, died Thursday afternoon at his home. Born in Clarks Valley on April 7, 1929, he was a son of the late Clarence and Ruth Hossler Lebo. He was the retired co-owner of the former Lebo Saw Mill, Kalmia for over 55 years. He was of the Protestant faith. He was predeceased by an infant daughter, Rose Marie. Surviving are his wife, Carol \"Guelle\" Brown, to whom he was married 55 years; 2 daughters, Yvonne M. Seiger and her husband, Gary and Linda J. Faust and her husband, Robert, both of Tower City; 5 brothers, Paul of FL, Richard of Tower City, Harry of Bernville, Fred of New Cumberland, Dale of Grantville; 3 sisters, Dorothy Bender of Tower City, Betty Kemmerling of Pine Grove and Carol Walker of SC; 3 grandchildren 8 great-grandchildren and nieces and nephews. Funeral services will be private. Burial will be in Greenwood Cemetery, Tower City R.D. Memorial donations can be made to PinnacleHealth Hospice, 301 One Norwegian Plaza, Pottsville, PA 17901. Dimon Funeral Homes, Inc., is in charge of arrangements. www.pennlive.com/obits",
  "date_of_death": null
}, {
  "id": "13288297",
  "date_of_birth": null,
  "obituary_text": "HADLEY  Jane Lewellyn Hadley  NJ Bell retiree, 74   Jane Lewellyn Hadley, 74, of Springfield died on Tuesday, Sept. 9, 2008, at the Center for Hope Hospice in Scotch Plains surrounded by her loving family.  A funeral service will be held at Bradley, Smith \u0026 Smith Funeral Home, 415 Morris Ave., Springfield, on Saturday, Sept. 13, at 10 a.m. Relatives and friends are invited to attend. Interment will follow at Glendale Cemetery, Bloomfield. Visitation will be on Friday from 2 to 4 and 7 to 9 p.m. To send the family a condolences or for directions, visit bradleyfuneralhomes.com.  Born in Newark, Miss Hadley lived in Irvington before moving to Springfield in 1983.  She was employed as a finance clerk with N.J. Bell Telephone in Newark for 34 years, retiring in 1992.  Miss Hadley was a member of the Telephone Pioneers of America and the Springfield Senior Citizens Group 1.  She was the beloved daughter of the late Clarence and Theresa Hadley; devoted sister of Florence Granata and her husband, Mike, of Belleville, and the late Russell and George Hadley, and loving aunt of Russell Hadley, Margaret Kerns, Theresa, Michael and Georgette Granata. She is also survived by many great-nieces and great-nephews and great-great-nieces and -nephews.  In lieu of flowers, contributions in her memory may be made to the American Diabetes Association, P.O. Box 11454, Alexandria, Va. 22312, or the American Cancer Society, 669 Littleton Rd., Parsippany, N.J. 07054.",
  "date_of_death": null
}, {
  "id": "22258792",
  "date_of_birth": null,
  "obituary_text": "Dominick W. Summa, 87, formerly of Franklin Street, Dunmore, died Monday in Moses Taylor Hospital. Born in Dunmore, son of the late Vito and Margaret Verrastro Summa, he was a graduate of Dunmore High School and a member of SS. Anthony and Rocco Parish. He served in the Navy in the South Pacific during World War II and was a member of the VFW McHugh-Bushweller Post 3474, Dunmore. Before retirement, he was employed by the Tobyhanna Army Depot. He was a New York Yankees fan, an avid golfer and a devoted uncle to many nieces and nephews.Surviving are a sister, Carmella Summa, Scranton; nieces and nephews.He was also preceded in death by a sister, Jane Santorsa; and three brothers, Pasquale, Donato and Mark Summa.Private services were held Wednesday with a Mass of Christian Burial in St. Anthony of Padua Church, Dunmore. Interment, Mount Carmel Cemetery, Dunmore.Arrangements by Carlucci-Golden-DeSantis Funeral Directors. To leave an online condolence, visit www.CGD funeralhome.com.",
  "date_of_death": null
}, {
  "id": "20909464",
  "date_of_birth": null,
  "obituary_text": "Jesus Martinez Otero (\"Jesse\"Mr. Jesus Martinez Otero, known fondly as \"Jesse,\" age 83, of New Castle, DE, passed away on Wednesday, February 23, 2011.Jesse was born in Morovis, Puerto Rico, on June 2, 1927, son of the late Basilio Martinez and Mercedes Otero. A hard worker and excellent provider for his family, he was employed with the New Castle County Department of Parks and Recreation for 40 years until his retirement as a crew chief. Jesse was a devout Catholic and a longtime member of St. Paul\u0027s parish in Wilmington. He enjoyed playing golf, dominoes, and pool, as well as gardening around his home and cheering for his favorite team, the Phillies. A devoted family man above all else, he delighted in spending time with his beloved grandchildren and great grandchildren.He is survived by his beloved wife of 61 years, Carmen Vega Torres; children, Maria Clark (William) of North East, MD, Jose Martinez (Mickeyann) of Smyrna, DE, and Annie Hall (Perry) of Cambridge, MD; brother, Manuel Martinez of Morovis, PR; sisters, Juanita Martinez of Morovis, PR, and Asuncion Martinez of Bayamon, PR; 10 grandchildren; and 15 great grandchildren.Mass of Christian Burial will be offered at 10:30 am on Monday, February 28th, at St. Matthew\u0027s R.C. Church, 901 E. Newport Pike, Woodcrest, Wilmington, DE, where visitation will begin at 9:30 am. Interment will follow in Cathedral Cemetery, 2400 Lancaster Ave., Wilmington, DE. SPICER-MULLIKINFUNERAL HOMES\u0026 CREMATORY To sign guest book, visitspicermullikin.com302-328-2213",
  "date_of_death": null
}, {
  "id": "39944538",
  "date_of_birth": null,
  "obituary_text": "CRAWFORD - Phillip Joshua Crawford, 42, of Jacksonville, FL passed away January 1, 2017. Arrangements by Broadus-Raines Funeral Home, 501 Spring St., Green Cove Springs, FL 32043 (904) 284-4000.",
  "date_of_death": null
}, {
  "id": "7653017",
  "date_of_birth": null,
  "obituary_text": "Jerold Harris  September 2, 1941 - January 15, 2021  Parkville, Missouri - Jerold Lewis Harris, 79, of Parkville, MO passed away on Friday, January 15, 2021 at McCrite Plaza at Briarcliff. Jerold was born September 2, 1941 to Ansyl L. and LaVern (Divan) Harris in Gordon, NE.  He graduated from Colorado State University in 1963 and began a career with the Farm Credit System. He retired as President and Chief Executive Officer of US AgBank, FCB, Wichita, KS in January 2007. He served on the board of directors of American AgCredit, Santa Rosa, CA until 2017.  Jerold loved a cold beer, going fishing, road trips and his family. He will be sadly missed by all who knew him and loved him. He was truly our hero!  Jerold is survived by his loving wife, Janet Harris; three children: David Harris (Shannon) of Wichita, KS; Susan Woodard (David) of Cheney, KS; Brett Bird (Allison) of Phoenix, AZ; six grandchildren: Blake Harris; Reanna Lynn (Gordon); Dylan Woodard; Abigail Woodard; Ava Bird; Bennie Bird; Trevor Lathrop and Jared Lathrop; three great-grandchildren: Gordon Lynn IV; Waylon Lynn and Jaxton Lynn. He was preceded in death by both parents, a brother, Eugene and a sister Geraldine \"Gerry\".  The family would like to thank the staff of McCrite Plaza at Briarcliff and especially Stephanie Leu of Kansas City Hospice and Palliative Care and the Care team.  No formal services will be held at this time. In lieu of flowers Memorial contributions are suggested to Children\u0027s Mercy Hospital, Kansas City, MO and may be left in care of Meyers Northland Chapel. Memories of Jerold and condolences to the family may be shared at meyersfuneralchapel.com Arr: Cremation arrangements entrusted with Meyers Northland Chapel in Parkville, MO.",
  "date_of_death": null
}, {
  "id": "24026831",
  "date_of_birth": null,
  "obituary_text": "Alice S. Merrill of Fort Walton Beach passed away peacefully in her sleep on April 19, 2008. Mrs. Merrill was born in Repton, Ala., on Aug. 18, 1917, to Albert and Minnie Henderson Stringer. She resided in Conecuh County and Mobile, Ala., before relocating to Fort Walton Beach in 1966. She was a retired retail sales associate having worked many years for Leon\u0027s in Fort Walton Square and in Santa Rosa Mall. Mrs. Merrill was an accomplished seamstress and she enjoyed reading, solving puzzles, working in her yard and watching birds.    Mrs. Merrill is pre-deceased by her parents, her husband of 40 years, J.C. Merrill, and her grandson, Timothy Carl Merrill. She is survived by her son and daughter-in-law, Carl T. and Harriet C. Merrill of Mobile; her daughter, Sandra M. Lefstad of Fort Walton Beach, and her daughter and son-in-law Marsha and David Smith of Jacksonville, Ala. Mrs. Merrill leaves two granddaughters, Alice McIntosh of Mobile, and Carole Shea of Alexandria, Va.; one grandson, Steven Taylor Park of Fort Walton Beach; and two great grandsons, Josh Everett and Matt McIntosh of Mobile.    Funeral services for Mrs. Merrill will be held on Monday, April 21, 2008 at 11 a.m. at the Emerald Coast Funeral Home, 113 Racetrack Road N.E., Fort Walton Beach. Dr. Mickey Hawkins, Pastor of Cinco Baptist Church will conduct the service. The family will receive friends for viewing and visitation at 10 a.m. prior to the service. A private burial with family members will follow in Castleberry, Ala.    Floral expressions of sentiment would be welcome; however, in lieu of flowers, donations to Emerald Coast Hospice would be an appreciated tribute.    Mrs. Merrill\u0027s family would like to thank Dr. Vergil Brown, Mrs. Betty Dreumont, and many Emerald Coast Hospice caregivers for their gracious, ender care and assistance provided to her.    You may express condolences and sign the guest register at www.emeraldcoastfuneralhome.com",
  "date_of_death": null
}, {
  "id": "12044324",
  "date_of_birth": null,
  "obituary_text": "  Joseph M. Emerson 0ct. 7, 1927 - Feb. 11, 2020   OKLAHOMA CITY Joseph Myron Emerson, 92, passed away on February 11, 2020. Joe was born in Oklahoma City, to Arthur Emerson and Sophia (Barnicoat) Emerson. Joseph retired as a Machinist. He was of the Christian faith and enjoyed spending time with his family and friends. We will miss his kind gentle nature and hearing him tell us to \"Take the time to be careful\". He is survived by his children, Dorothy Owen of Oklahoma City, OK, John Emerson of Edmond, OK, Larry Emerson of Moore, OK, 6 grandchildren, and 12 great-grandchildren. He is preceded in death by his parents; wife married over 50 years, Bertha (McKinzy) Emerson; brother, Russell Emerson; and his loving sister, Viola York. Visitation will be held Friday, Feb. 21, 2020, from 4 pm to 8 pm. Funeral Services will be held Saturday, Feb. 22, 2020, at 2:00pm at the Sunny Lane Funeral Chapel. Interment will follow at Sunny Lane Cemetery. ",
  "date_of_death": null
}, {
  "id": "26179787",
  "date_of_birth": null,
  "obituary_text": "JEAN KUPILLAS MELBOURNE Jean Kupillas, 84, a retiree, died Saturday, March 4, 2006, at her residence. Mrs. Kupillas was born in Germany. She came to Brevard County in 2000 from West Palm Beach, FL. She retired from the Massa pequa, New York School District. Mrs. Kupillas is survived by her husband, Francis Kupillas; daughter, Karen Wahy of Mel bourne; son, Frank Kupillas of Arkansas; five grandchildren; and eight great-grandchildren. A memorial service will be held at 2 p.m., Thursday, March 9th, in the Florida Memorial Funeral Home Chapel. In lieu of flowers, per Mrs. Kupillas request, donations may be made to the Brevard Alzheimers Foundation. Florida Memorial Funeral Home in Rockledge is in charge of arrangements.",
  "date_of_death": null
}, {
  "id": "16810519",
  "date_of_birth": null,
  "obituary_text": "Reese, Steven L. Ypsilanti Twp. Age 47, passed on February 28, 2016. The public visitation will be held on Sunday, March 6, 2016 from 4 pm to 8 pm at C\u0026H Community Home for Funerals, Lucille\u0027s Memorial Chapel, 411 S. Adams St., Ypsilanti. The funeral will be held on Monday, March 7, 2016 with the family hour at 10 am and the funeral at 11 am at Abundant Life Ministries, 855 Clark Rd., Ypsilanti. Burial will take place at United Memorial Gardens, Plymouth, MI. Please sign his guestbook at www.chfuneral.com",
  "date_of_death": null
}, {
  "id": "8329690",
  "date_of_birth": null,
  "obituary_text": "Carolyn A. Sherrill CHARLOTTE - Carolyn Arrants Sherrill, 81, of Charlotte, passed peacefully on October 21, 2020. She was born February 12, 1939, in Bishopville, South Carolina. Carolyn was a loving and dedicated daughter, sister, wife, mother, grandmother, great-grandmother and friend to all. Carolyn was preceded in death by her husband Don who passed in 1971. She is survived by her daughter Leslie S. Edmond of Charlotte, her son Don W. Sherrill, Jr. of Myrtle Beach, SC and a long list of family and friends who adored her greatly. In a time where kindness is needed now more than ever, Carolyn offered hers daily and was known for her gentle smile and pure heart. She will be missed by all who knew her. In lieu of flowers, memorial contributions can be made to Levine \u0026 Dickson Hospice House Huntersville.",
  "date_of_death": null
}, {
  "id": "16172717",
  "date_of_birth": null,
  "obituary_text": "CAROL J. BAUCHER, age 76, of Mentor formerly Fairview Park. Loving wife for 54 years of Robert R. Baucher; dear mother of Polly Condon, Todd Baucher and Jeffrey Baucher; grandmother of Aaron and Katie Condon, Terry and Kim Baucher; sister of David (Fran) Casperson; daughter of the late Harold and Geraldine Casperson. Funeral Service will be held on Monday, December 29, 2008, 11 AM at the BRUNNER FUNERAL HOME \u0026 CREMATION SERVICE, 8466 MENTOR AVE., MENTOR, where the Family will receive friends SUNDAY, DECEMBER 28, 2008, from 2-6 PM. Interment in Mentor Cemetery. Memorial contributions may be made to Hospice of the Western Reserve, 300 East 185th. St., Cleveland 44119, in Mrs. Baucher\u0027s memory. Online obits@www.brunners.com",
  "date_of_death": null
}, {
  "id": "23127085",
  "date_of_birth": null,
  "obituary_text": "Leon Wilbur Strosnider, 70, of Stephens City, Virginia, died Tuesday, May 27, 2014, in Winchester Medical Center surrounded by family and friends.Leon was born in 1943 in Winchester, Virginia, the son of Nevaline Strosnider of Stephens City and the late Wilbur Joseph Strosnider. He was a graduate of James Wood High School and Reisch Auctioneering School in Mason City, Iowa. He was a self employed Auctioneer for over 43 years, a lifelong member of Refuge United Methodist Church and a member of the Clarke County Ruritan. He was passionate about auctioneering and was the first auctioneer in the local area to attend auctioneering school. Leon enjoyed hunting and fishing, especially with his grandsons and loved helping his family, friends and neighbors.He married Mary Ritter Shepard on February 8, 1964 at Refuge UMC in Stephens City, recently celebrating their Golden Anniversary.Surviving with his mother and his wife are two sons, Scott Shepard Strosnider, Seth Danner Strosnider, both of Stephens City, Virginia, two grandsons, Hunter Strosnider, Colt Bauserman; two sisters, Dianne Garber of Stephens City, Donna McFarland    of Winchester, brother, Ronald Strosnider of  Wardensville, West Virginia, special aunt, June DeHaven, numerous nieces and nephews along with great nieces and nephews.One son, Todd Schofield Strosnider and two granddaughters, Jessica Lynn Strosnider and Brittany Loy Strosnider, preceded him in death.Prior to the service, family and friends will be received on Tuesday, June 3, 2014 from 4:00-6:45 PM at Refuge United Methodist Church.A celebration of life will be conducted at 7:00 PM on Tuesday, at Refuge United Methodist Church, with Reverend John E. Lock officiating. Interment will be private.In lieu of flowers, memorial contributions may be made to Refuge United Methodist Church 717 Refuge Church Road, Stephens City, Virginia, 22655.Please view obituaries and tribute wall atwww.ompsfuneralhome.comSign the Guest Book atwww.nvdaily.com/obituaries",
  "date_of_death": null
}, {
  "id": "12316775",
  "date_of_birth": null,
  "obituary_text": "Alfons A. \"Al\" Kluthe, 97, of Fremont died Sunday, Oct. 5, 2003, at Pathfinder House in Fremont. Kluthe was born May 28, 1906, in Dodge. He attended school in Olean and grew up near Dodge. He lived on a farm between Snyder and Scribner where he farmed for 10 years. He moved to West Point and was employed at the Farmers Union Store for 10 years. He moved to Fremont in 1960 and worked at Montgomery Ward \u0026 Co. as a receiving clerk and then worked at Dave\u0027s Drive-In Liquor for 20 years. He married Irene Ulrich on Jan. 16, 1940, in Monterey. She preceded him in death June 27, 1976. He was a member of St. Patrick\u0027s Catholic Church in Fremont and a member of the Knights of Columbus Council 1497 at Fremont. He was a former member of the Fraternal Order of Eagles at Fremont. Survivors include: a daughter, Jeanette (Mrs. Norbert) Starman of Elgin; a brother, Edmund (and wife, Clara) Kluthe of Las Vegas; five sisters, Philemena Steffensmeier of Sioux Falls, S.D., Camilla Ulrich of Omaha, Ann Marie Kluthe and Micky Kluthe, both of Fremont, and Bernadine Kluthe of Dodge; two stepgrandchildren and two stepgreat-grandchildren. He also was preceded in death by four sisters. The funeral will be 10:30 a.m. Wednesday at St. Patrick\u0027s Catholic Church in Fremont with the Rev. Owen Korte officiating. A Knights of Columbus rosary will be said at 7 p.m. Tuesday at Moser Memorial Chapel in Fremont. Visitation will be from 1-9 p.m. Tuesday at the funeral home and continues one hour prior to service time at the church. Burial will be in Calvary Cemetery in Fremont. A memorial has been established to St. Patrick\u0027s Catholic Church in Fremont. ",
  "date_of_death": null
}, {
  "id": "11921546",
  "date_of_birth": null,
  "obituary_text": "Dorothy WolfeSt. Louisville - Dorothy Anne Wolfe, 88, of St. Louisville, died Saturday, March 28, 2020 at Licking Memorial Hospital. She was born August 25, 1931 in St. Louisville to the late Ira and Goldie (Parker) Wolfe.Dottie is survived by special friends, Virginia \"Ginny\" Matthews, Connie McDaniel, and Fran Heimerl; nephew, Bill (Pauline) Wolfe and numerous other nieces, nephews and friends.In addition to her parents, she was preceded in death by four brothers, James, Charles, Leslie, and William H. Wolfe; and three sisters, Myrtle Randles, Mabel Maharg, and Marie Kolz.Dottie retired from State Farm, Park National Bank, and Rickenbacker Air National Guard as MSG. She was a member of numerous clubs including the Eastern Star, International Training in Communication, and was a vocalist and actress in the biennial 20th Century Flyer.Memorial contributions may be made in Dottie\u0027s memory to the Licking County Veterans Service Commission, 935 Buckeye Avenue, Newark, OH 43055.Funeral services will be held privately, but a public memorial service will be held at a later date.To sign an online guestbook, please visit www.brucker-kishlerfuneralhome.com",
  "date_of_death": null
}, {
  "id": "37300118",
  "date_of_birth": null,
  "obituary_text": "In Memoriam  George \"Lindy\" Rimmer March 1, 1959 - July 16, 2020 In life we love you dearly; in death we love you still, in our hearts you hold a place no other one can fill. It broke our hearts to lose you, but you did not go alone. For part of us went with you the day God took you home.  Sadly missed by family.",
  "date_of_death": null
}, {
  "id": "18629201",
  "date_of_birth": null,
  "obituary_text": "Barbara Taylor Social worker; 1925-2014 Barbara Taylor of Montclair, N.J., passed away on Oct. 12, 2014. A memorial service will be held at the Unitarian Universalist Church, 67 Church St., Montclair, on Saturday, Nov. 29, from 1 to 5 p.m. Barbara, the first child of Robert F. and Bethel Stevenson, was born Jan. 25, 1925, in Brooklyn, N.Y. The family lived in Englewood, N.J., prior to moving to Montclair. Barbara graduated from Montclair High in 1943 and earned a bachelor\u0027s degree from Fisk University in 1947. Barbara held several positions in social work prior to becoming a caseworker for the Essex County Welfare Board in 1959. She earned an MSW from Rutgers in 1977. Barbara retired from the welfare board in 1986 and became a social worker for the East Orange Board of Education until retiring 1995. Barbara married Samuel Taylor on Dec. 6, 1952. They were blessed with two sons, Geoffrey B. Taylor (deceased) and William J. Taylor. She also had two granddaughters, Taylor Alice Marie Jones and Samora Stevenson Jones (deceased). Barbara\u0027s husband, Sam Taylor, passed away in 2003. Barbara was a member of Alpha Kappa Alpha Sorority, The Montclair Drifters, the Crawford Crews American Legion Unit, The Four Seasons Bridge Club, and the National Council of Negro Women (NCNW). Barbara was the granddaughter of Ann and Edward Spencer, whose home and garden is a registered national and state historic site in Virginia, www.annespencermuseum.com. Barbara is survived by her son, William Taylor; sister, Ann S. Johnson; granddaughter, Taylor Jones; grandchildren, Kyle and Tayah Spady; dear friend, Jimmie Jones; several nieces, nephews, many beloved friends; her sorority sisters of Alpha Kappa Alpha, and cherished companions with the Montclair Drifters.",
  "date_of_death": null
}, {
  "id": "33766867",
  "date_of_birth": null,
  "obituary_text": "Robinson, Edward, 84, Butler, GA, died Saturday. Funeral Service: Tuesday at 3:00 pm at Turner\u0027s Chapel Free Will  Baptist Church, Edwards- McLeighton Funeral Home, Butler, GA.",
  "date_of_death": null
}, {
  "id": "10628426",
  "date_of_birth": null,
  "obituary_text": "BLUMENFELDSOPHIA (nee Goldberg), Feb. 18, 2008. Beloved wife of the late Abraham. Devoted mother of Jonathan Blumenfeld. At Sophia\u0027s request there are to be no Services. www.levinefuneral.com",
  "date_of_death": null
}, {
  "id": "30844599",
  "date_of_birth": null,
  "obituary_text": "TILLMAN Josh Anthony, died Dec. 22. Visitation and Service begin Dec. 27 at 5PM at Clark Legacy Center in Brannon Crossing. www.clarklegacycenter.com",
  "date_of_death": null
}, {
  "id": "44595876",
  "date_of_birth": null,
  "obituary_text": "SUBLETTCOLE CAMP - Robert Lee Sublett, 76, of Cole Camp, died Sunday, Nov. 16, 2014, at his home. Memorial services will be held at a later date. Arrangements are under the direction of the Fox Funeral Home in Cole Camp.",
  "date_of_death": "2014-11-16"
}, {
  "id": "8922634",
  "date_of_birth": null,
  "obituary_text": "Charles L. DeckerTitusvilleCharles L. Decker 65, passed away peacefully on September 14, 2015.  He was born in Atlanta, GA to Edward and Rosemary.  He was a United States Air Force veteran and retired from the Title Insurance Business. Chuck was an avid Florida Gators fan, and enjoyed golf, football and a cold glass of ice tea.  Chuck and his wife Linda owned and operated Flowers Of Distinction in Titusville. Chuck always enjoyed spending time with his granddaughter Mia.Chuck is survived by his loving wife of 46 years Linda, son Shane and his wife Stacey,granddaughter Mia, mother Rosemary, brother Matt, sister Allyson, sister Cathy, and brother Fred.He is preceded in death by his father Edward and brother Ken.The family will receive friends from 10 - 11 am Saturday with the funeral to follow at 11 am all at North Brevard Funeral Home.  Online condolences can be left for the family at www.northbrevardfuneralhome.com",
  "date_of_death": null
}, {
  "id": "15615646",
  "date_of_birth": null,
  "obituary_text": "WHITE James A. White, 66, passed away Wednesday, September 20, 2006 at his residence. Funeral Service 7 p.m. Thursday, September 28, 2006 at the Triedstone Baptist Church, 858 E. 3rd Ave., Columbus. Bishop Jerome Ross eulogizing. Family will receive friends at 6 p.m. until time of service. Burial Friday at Dayton National Cemetery. Arrangements entrusted to PORTER QUALLS \u0026 GARY FUNERAL HOME, 2500 Cleveland Ave. Marlan J. Gary, Funeral Director, 267-8310.",
  "date_of_death": null
}, {
  "id": "23842655",
  "date_of_birth": null,
  "obituary_text": "WILLIAMS DOROTHY M. Age 74, August 29, 2011. Beloved wife of the late Burney. Dearest mother of Kelley Risi, Karen (Scott) McVean, and Kevin (Cindy). Loving grandmother of Nicolas, twins Mark and Mario, Aiden, Gavin, Mackenzie, and Tyler. Dear sister of Sophie March and Edward (Sharon) Karas. Also survived by several nieces and nephews. Visitation Wednesday 6-9pm and Thursday 2-8pm at McCabe Funeral Home, 31950 W. 12 Mile Rd., Farmington Hills. Wake service 6:30pm Thursday. In State Friday from 9:30am until time of Mass 10:00 am at Our Lady of Sorrows Catholic Church, 23815 Power Rd., Farmington. Interment St. Hedwig Cemetery. www.mccabefuneralhome.com",
  "date_of_death": null
}, {
  "id": "51057928",
  "date_of_birth": null,
  "obituary_text": "News Death NoticeTURNER, Rena (Ballard) 82, of Lebanon, Thursday, December 23. Services Tuesday, December 28, 12 noon Lebanon Church of God. Oswald-Hoskins, Lebanon",
  "date_of_death": null
}, {
  "id": "34084275",
  "date_of_birth": null,
  "obituary_text": "KINGS MOUNTAIN -- Ionia B. Smith, 88, died December 31, 2008. Funeral 2pm Sunday, Harris Funeral Home; burial, Mountain Rest Cemetery. Visitation Saturday, 6-8pm at the funeral home.",
  "date_of_death": null
}, {
  "id": "38007508",
  "date_of_birth": null,
  "obituary_text": "Dottie DeMatteo God\u0027s Garden must be a beautiful place, because now it is graced with Dottie\u0027s smiling face. Love and Miss you, Flo",
  "date_of_death": null
}, {
  "id": "13482786",
  "date_of_birth": null,
  "obituary_text": "Feb. 14, 1924 - March 4, 2011Leo Charles Studach passed away Friday, March 4, 2011, at his home in Hansville, Wash., with his loving family by his side.Leo was born to Jacob and Rosa Studach on Feb. 14, 1924, in Wells.Leo worked hard his entire life, but said he lived the American dream. He was a resident of Hansville for nearly 50 years, and had a wonderful 61-year marriage to his loving wife, Iona (Onie). Together they owned and operated the Point No Point Fishing Resort throughout much of the 1960s and \u002770s, retired young and traveled often. Prior to settling in Hansville, Leo owned a logging and trucking company in Oregon.He is survived by his son, Dan Studach of Poulsbo, Wash.; daughter, Diane, and her husband, Mitchell Jones, of Poulsbo; a brother and sister, Alfred Studach and Margaret Hales, both of Corvallis; grandchildren Leah, Scott, Leo and Josiann; and great-grandchildren Noah, Alex and Annabella.A private family inurnment will be held for Leo. Please sign the online guest book at www.tuellmckeebremerton.com. ",
  "date_of_death": null
}, {
  "id": "24332804",
  "date_of_birth": null,
  "obituary_text": "June 30, 1938 - January 23, 2008. William H. Watkins Jr. born June 30, 1938 in New Orleans, LA passed away January 23, 2008. William joined the Air Force June 2, 1958 serving for 26 years and then spent 25 years in Federal Civil Service. He is survived by his wife of 42 years, Nancy E. Watkins, daughter; Catherine Crane, sons; William H. Watkins, and Joseph C. Watkins, brother; Michael A. Watkins, and granddaughter Cody M. Crane. Visitation will be Wednesday, January 30, 2008 from 5:00 pm – 7:00 pm. Service will be Thursday, January 31, 2008 at 2:00 pm. Both will take place at Memorial Gardens Funeral Home Chapel 3825 Airport Rd. In lieu of flowers please make donations to The American Lung Association or the Arthritis Foundation.",
  "date_of_death": null
}, {
  "id": "26933552",
  "date_of_birth": null,
  "obituary_text": "CAPTAIN DANIEL T. McCARTHY July 27, 1918 ~ January 1, 2005 At peace January 1, 2005 at Orange Coast Memorial Hospital, Fountain Valley, California. Dan left behind his loving wife, soulmate and valiant caregiver, Norene, along with daughters, Cheril, Tamara, Sidney and Annette; sons, Vance, Patrick; granddaughters, Jenny, Monica, Dana, Shannon and Jordyn; grandson, Cris and beloved little sister, Adele. Dan was preceded in passing by his brother, Desmond. Both Dan and Des loved aviation, Dan soloed at Oakland Airport, flew in the Army Air Corps leaving as a major, he began a career as an airline Captain with Transocean Airlines, South Pacific Airlines and World Airways. Then in post retirement with Big Island Air in Hawaii. Besides aviation he loved his four legged friends (horses and dogs) loved to play tennis, travel and sail with his beloved wife, Norene. Dan\u0027s friendliness, humor and skill as an aviator touched many lives and he will be missed. Captain Dan has gone West for his final flight, at peace and in God\u0027s hands. A memorial service will be held at the Western Aerospace Museum at Oakland Airport, North Field on January 23, 2005, 1:00 p.m. O\u0027Connor Laguna Hills Mortuary Directors, 949-581-4300, www.oconnormortuary.com.",
  "date_of_death": null
}, {
  "id": "3140982",
  "date_of_birth": null,
  "obituary_text": "Perz, Marie A. (Nee Banaszynski) Born to Eternal Life Nov. 30, 2006 at the age of 93 years. Beloved wife of the late Max. Loving mother of Adrian, Nancy Laughridge and Jerome (Bonnie). Proud grandmother of Christine (Nick) Hernke, Christopher Laughridge, Dominic (Charlotte) Perz and Zachary Perz and great - grandmother of Kylie Wagner. Dear sister of Florence Bozewicz, the late Ralph (Harriet) Banaszynski and the late Louie (Dorothy) Banaszynski. Further survived by other relatives and friends. Funeral Tues., Dec. 5, at 10:15 AM, from the Funeral Home. Mass of Christian Burial to be celebrated, at 10:30 AM, at the BASILICA OF ST. JOSAPHAT, 601 W. Lincoln Ave.. Private interment at The Assumption of the Blessed Virgin Mary Cemetery, Pulaski, WI. Visitation Tuesday at the Funeral Home from 9:00-10:15 AM. ROZGA FUNERAL HOME \u0026 Cremation Services 703 W. Lincoln Ave. 414-671-5200 ",
  "date_of_death": null
}, {
  "id": "12679392",
  "date_of_birth": null,
  "obituary_text": " LAKE, Mary \u0027\u0027Bette\u0027\u0027 (Merkley) Entered into eternal rest March 6, 2009. Beloved wife of 39 years to Richard \u0027\u0027Dick\u0027\u0027 Lake; loving mother of Sharon (Brown) Muir \u0026 dear mother-in-law to John Muir. Mom was a devoted grandmother to Nathan \u0026 Nik Prawdzik \u0026 great-grandmother to Kai Alexander Prawdzik; has numerous surviving stepchildren, aunts, nieces, nephews, cousins, her half brother, Wally Merkley \u0026 friends. Born December 28, 1932 in Sacramento, Mary has been a resident of West Sacramento since 1992 at which time she and Dick moved to Sacramento. She was an active member of the Women of Moose, Chapter #1431 of West Sacramento for over 50 years. Visitation hours will be Wednesday, March 11, 2009 from 2:00pm to 8:00pm at the River Cities Funeral Chapel. All are invited to attend funeral services on Thursday, March 12, 2009 at 10:00am, also in the funeral home chapel. Private entombment St. Mary\u0027s Cemetery. Mom cherished her animals and it would make her so happy to know that memorials would be sent to the S.P.C.A., 6201 Florin-Perkins Road, Sac., CA 95825.River Cities Funeral Chapel910 Soule St., West Sac., CA 95691www.rivercitiesfuneralchapel.com",
  "date_of_death": null
}, {
  "id": "28132096",
  "date_of_birth": null,
  "obituary_text": "On September 16, 2001 RUTH (nee Sunderland), beloved wife of Vincent Stafford, devoted mother of Ann Stafford Ebersberger and her husband Marc L., Elizabeth Stafford Cone, Mark Sunderland Stafford and his wife Peggy B., loving grandmother of Carey H. Ebersberger, M, Lee Ebersberger, Jr., Jessica E. Stafford, Kathleen C. Stafford, Caroline S. Cone and Robert W. Cone, Jr.  Friends may call at the Sterling-Ashton-Schwab Funeral Home, Inc., 736 Edmondson Avenue ( mile W. of Beltway Exit 14) on Tuesday from 7 to 9 P.M. and Wednesday from 2 to 4 and 7 to 9 P.M. Mass of Christian Burial will be celebrated at the Church of the Resurrection, Ellicott City on Thursday at 11 A.M. Interment in St. Johns Cemetery. Christian Wake service on Wednesday at 3 P.M. In lieu of flowers family request donations to the Oblate Sisters of Providence, 701 Gun Road, Baltimore, MD 21227 or The House of Good Shepherd, 4100 Maple Avenue, Baltimore, MD 21227.",
  "date_of_death": null
}, {
  "id": "48222365",
  "date_of_birth": null,
  "obituary_text": "Of Nanuet, passed away peacefully on December 2, 2001. She was born on February 20, 1916 in the Bronx, to Frank and Maria (LaRusso) Giampietro. Angelina married her husband Angelo in 1937. He predeceased her in 1983. Mrs. Casale was a sample maker for Maryanns Blouse Co. in the Bronx for many years. She is predeceased by two sisters, and one brother. Angelina is survived by her children, Rose and her husband John Cione and Marie and (her late husband John) DeCicco of Nanuet; five grandchildren, Diana DeCicco, Joseph and his wife Lorena Cione, Angela DeCicco, Jimmy and his wife, Sarah DeCicco and Angelo Cione. Also surviving are two sisters, Jean Paliwoda and Tessie Giampietro and loving aunt to many nieces and nephews. Angelina will be sorely missed by all who knew her. A Mass of Christian Burial will be celebrated on Wednesday at 11 am at St. Anthony\u0027s parish Church in Nanuet with entombment to follow at Ferncliff Cemetery Shrine of Memories Mausoleum in Hartsdale, NY. The family will receive friends on Tuesday from 2-4 and 7-9 pm at the Michael J. Higgins Funeral Service, New City, NY. Donations in Angelina\u0027s memory can be made to the charity of one\u0027s choice. HIGGINS FUNERAL HOME, INC 321 S. Main St, New City (845)634-6110",
  "date_of_death": null
}, {
  "id": "34929382",
  "date_of_birth": null,
  "obituary_text": "Taft Johnson\u0027s passing on Friday, April 22, 2022 has been publicly announced by Jackson-Brooks Funeral Home in Aiken, SC.According to the funeral home, the following services have been scheduled: Service, on April 29, 2022 at 6:00 p.m., ending at 8:00 p.m., at Jackson-Brooks Funeral Home, 126 Fairfield Street S.E., Aiken, SC.The most recent obituary and service information is available at the Jackson-Brooks Funeral Home website.",
  "date_of_death": "2022-04-22"
}, {
  "id": "19021594",
  "date_of_birth": null,
  "obituary_text": "Sept. 6, 1937 - July 15, 2004 Masako Inuzuka Atteberry of Corvallis died Thursday in Corvallis. She was 66. She was born in Tokyo, Japan, to Yoshio and Misao (Fujita) Inuzuka. She grew up in Tokyo and received a scholarship to Western Washington University, where she earned a bachelor\u0027s degree in education. She married Pat Atteberry. They eventually moved to Corvallis. She taught art and Japanese to kindergarten through 12th-grade students, as well as giving instruction to private companies. She also taught calligraphy and cooking classes and worked as an interpreter and translator. She enjoyed sewing, snow skiing and music. She was a member of Alpha Delta Kappa Sorority and the OSU Folk Club. Survivors include her sons, Ko Atteberry of Corvallis and Dr. Yo Atteberry of Portland; daughter, Yumi Atteberry of Portland; sisters, Yoshiko and Kiyoko of Japan; and brothers, Takaaki and Shigeki of Japan. Her husband, Pat, preceded her in death. A memorial service will be held at 2 p.m. Monday, July 19, at the First United Methodist Church in Corvallis. Private family inurnment will be at Crystal Lake Cemetery. Memorial contributions can be made to Benton Hospice Service. Arrangements are under the direction of DeMoss-Durdan Funeral Home. ",
  "date_of_death": null
}, {
  "id": "17994164",
  "date_of_birth": null,
  "obituary_text": "Ann Marie Riffert of Malvern Ann Marie Riffert, 87, of Malvern passed away on Monday, Feb. 23, 2015 peacefully in her sleep. Born July 30, 1927 in Putte, Belgium, she immigrated to the U.S. at the age of 9. She was predeceased by her late husband of 52 years, Quentin (Bink). She is survived by one daughter, Susan Tudor and husband Scott of Port St. Lucie, Fla., two granddaughters Rachel M. Gross of Hammonton, N.J. and Emily S. Gross of Malvern; and two great-grandsons Gabriel and Caleb. More information can be found at www.allcounty.com. A Celebration of Life Memorial service will be held at Philadelphia Memorial Park in Frazer in May. Donations can be made to the National Council on Aging, 1901 L Street, NW, Washington, DC 20036",
  "date_of_death": null
}, {
  "id": "12277962",
  "date_of_birth": null,
  "obituary_text": "RITA GRIMALDI BENENATI MAY 10, 1924 - MAR 17, 2010 Beloved mother and grandmother In our hearts always. Rita was born to Leo and Josephine Grimaldi in Detroit, Michigan. She was proceeded in death by her brother Ben Grimaldi and is survived by her sisters Carmella Nancett and Lena Mendes. In the early 40\u0027s, Rita worked at the Ford plant in Detroit as a riveter for World War II planes. She worked in canneries till her late 60\u0027s. She was a fun-loving person that loved the Lord, her family, and her friends. She enjoyed gardening, animals, and cooking for her family. She also enjoyed the outdoors and camping with her husband (Frank) and family. She is survived by her son Jack, daughter-in-law Annie, and her son Leonard, her grandchildren Dr. Nathan Benenati, Jill and Sao Chhim, and Alicia Pharr, her great-grandchildren Ashleey and Matthew Chhim.We love you mom. Rosary: Wednesday, March 24th, 6:00 p.m. @ Franklin \u0026 Downs, 12th \u0026 G Street, Modesto, CA Funeral: Thursday, March 25th, 9:30 a.m. @ St.Joseph\u0027s Church, 1813 Oakdale Rd., Modesto, CA www.modbee.com/obituaries",
  "date_of_death": null
}, {
  "id": "17434920",
  "date_of_birth": null,
  "obituary_text": "Celebration of Life for Jerline Caselberry, who died on August 21, 2014, will be at 1 p.m. Sunday at Antioch United Methodist Church, Rev. Percy Nolan officiating.Jerline is survived by six children, Mary Lee Caselberry, Huntsville, Ala., Gary Caselberry, Weaver, Ala., Charlie (Cynthia) Caselberry, Gadsden, Ala., Harold (Sharon) Caselberry, Fayetteville, N.C., Coleman Caselberry Jr., Attalla, Ala., Carol Caselberry, Attalla, Ala.; 18 grandchildren, Demetrius Caselberry, Keisha (Tori) Askew, Weaver, Ala., Pandora, Wanda, Leah, Gary Jr., Sarah, Benjamin, Megan, Marissa, Lee Lee, Kristopher, Lia, Terrance (Sharon), Duncan (Katie), Broderick (Donna), Rosaland Caselberry; 30 great-grandchildren; sisters, Ruby Lee, Boston, Mass., and Emma Cylar, Attalla; and a host of nieces, nephews, other family and friends.Cremation service provided by Adams-Buggs Funeral Service: \"Competent Service You Have Come To Know And Trust.\" www.adams-buggs.com",
  "date_of_death": null
}, {
  "id": "14033776",
  "date_of_birth": "1920-08-25",
  "obituary_text": "Rodger Applegate born August 25, 1920 passed away on September 6, 2017 in Monterey, California.  Rodger was proud to have served in the US Army during WWII including his participation in the Battle of the Bulge.Arrangements under the direction of The Paul Mortuary, Pacific Grove, CA.",
  "date_of_death": "2017-09-06"
}, {
  "id": "38655705",
  "date_of_birth": "1966-08-31",
  "obituary_text": "An obituary is not available at this time for Evelyn Khan. We welcome you to provide your thoughts and memories on our Tribute Wall.To plant a beautiful memorial tree in memory of Evelyn, please visit our Tree Store or plant a tree.",
  "date_of_death": "2023-01-13"
}, {
  "id": "52055068",
  "date_of_birth": "1935-09-07",
  "obituary_text": "Fernando Castro\u0027s passing at the age of 87 on Monday, May 22, 2023 has been publicly announced by Fierro Family Funeral Home - Dos Palos in Dos Palos, CA.According to the funeral home, the following services have been scheduled: Graveside service, on June 8, 2023 at 11:00 a.m., at Dos Palos District Cemetery, 1800 Elgin Ave., Dos Palos, CA.The most recent obituary and service information is available at the Fierro Family Funeral Home - Dos Palos website.",
  "date_of_death": "2023-05-22"
}, {
  "id": "16896151",
  "date_of_birth": "1927-09-15",
  "obituary_text": "Jean M. MahoneyWilmington - Jean Mary (Gosse) Mahoney, 92, peacefully passed away on Thursday, March 12, 2020.Born in Brooklyn, New York on September 15, 1927, she was the daughter of the late Alfred and Jean (Coady) Gosse. She was employed as a laboratory technician at the DuPont Experimental Station and retired after 35 years of service. Jean was a devoted member of St. Ann\u0027s Church and volunteered with the parish Athletic Association. In addition, she was a member of the Stapler Athletic Association and the New Castle County Irish Society.Her husband, James A. Mahoney, passed away on January 4, 1970. She was also predeceased by her sister, Mary Carillo and her twin sister, Helen Frances Wright.Jean is survived by her son, Jim Mahoney and wife, Denise; her daughter, Jeanne Abbott; 3 grandchildren; 6 great grandchildren; 2 great-great grandchildren.Family and friends are invited to visit at the Doherty Funeral Home, 1900 Delaware Avenue, Wilmington on Wednesday, March 18 from 9:30-10:30AM. A Mass of Christian Burial will be celebrated at St. Ann\u0027s Church, Gilpin Avenue and N. Union Street at 11:00AM, immediately followed by interment in All Saints Cemetery.In lieu of flowers, donations in memory of Jean may be made to St. Ann\u0027s Parish, 2013 Gilpin Avenue, Wilmington, DE 19806.To offer condolences, visit www.dohertyfh.com 302.652.6811",
  "date_of_death": "2020-03-12"
}, {
  "id": "6429687",
  "date_of_birth": "1943-04-07",
  "obituary_text": "Ray White\u0027s passing has been publicly announced by Geo. H. Lewis \u0026 Sons Funeral Directors in Houston, TX.The most recent obituary and service information is available at the Geo. H. Lewis \u0026 Sons Funeral Directors website.",
  "date_of_death": "2021-09-03"
}, {
  "id": "30445848",
  "date_of_birth": "1935-01-08",
  "obituary_text": "COBERN, Raymond Charles, 77, a Prattville resident, passed away Sunday July 22, 2012.  Visitation will be begin at 12:00 PM followed by funeral services at 2:00 PM  on Wednesday July 25, at the Prattville First Baptist Church with Dr. Travis Coleman and Pastor Dave Burns officiating.  Burial will follow in Prattville Memorial Gardens with Military Honors.  Mr. Cobern was born on January 8, 1935 to the late Raymond E. and Elena Thrailkill Cobern.  He was a retired supervisor with Union Camp Paper Company with 30 years of service, a U.S. Army veteran, a 50 year member of the Prattville Masonic Lodge and a faithful 30 year member of the Gideon\u0027s International.  He loved gospel singing and was highly active in many civic affairs but will always be remembered as a Christian model of what a husband and father should be.  He is survived by his loving wife of nearly 58 years, Willodean, a son and daughter-in-law: David and Emily Cobern, a daughter; Diane Burkhalter, five grandchildren; Jason Hittenrauch, Ashley (Chris) Barnes, Tyler Williams, Charlie Cobern ,Ally Cobern and a sister: Ann Hutchins.    Active Pallbearers will be Jason Hittenrauch, Tyler Williams, Charlie Cobern, Ron Bryant, Charles Perry and Lawrence Banks.  Honorary Pallbearers will be the Bruce Ward Sunday School Class and fellow Gideons.   In lieu of flowers memorial contributions may be made to the Cancer Wellness Foundation of Central Alabama, the Gideon\u0027s International or to the Prattville First Baptist Church.",
  "date_of_death": "2012-07-22"
}, {
  "id": "619050",
  "date_of_birth": "1924-06-10",
  "obituary_text": "Lillian Mutschler was born on Tuesday, June 10, 1924 and passed away on Sunday, February 23, 2020. Lillian Mutschler was a resident of Pennsylvania at the time of passing.",
  "date_of_death": "2020-02-23"
}, {
  "id": "35895056",
  "date_of_birth": "1982-04-16",
  "obituary_text": "Tanya Rayford\u0027s passing on Sunday, July 10, 2022 has been publicly announced by WFG Fuller Funerals in Richmond, CA.The most recent obituary and service information is available at the WFG Fuller Funerals website.",
  "date_of_death": "2022-07-10"
}, {
  "id": "35110257",
  "date_of_birth": "1957-11-13",
  "obituary_text": "Terry N. Joy, 64, passed away unexpected peacefully at home on June 5, 2022. He is predeceased by his father Ken, mother Lila Romanczuk and her husband Benjamin; sister Cathie DeLisa. He is survived by his son Todd (Brandi) Joy; daughter Sara Joy; three grandchildren Harper, Beckett Joy and Alayna; brother Gary (Robin) Joy. Terry graduated from North High in 1975 and retired from Chenango Valley School District after over 20 years. Visitation will be held on Friday, June 10, 2022 from 3pm to 4pm at the THOMAS J. SHEA FUNERAL HOME, INC., 137 Robinson St. Binghamton. A Memorial Service will follow at 4pm. In lieu of flowers memorial contributions can be made to Project PAW in Terry’s memory.To send flowersto the family or plant a treein memory of Terry N. Joy, please visit our floral store.A Memorial Tree was planted for TerryWe are deeply sorry for your loss - the staff at Thomas J. Shea Funeral Home, Inc. Join in honoring their life - plant a memorial tree",
  "date_of_death": "2022-06-05"
}, {
  "id": "16942575",
  "date_of_birth": "1941-01-25",
  "obituary_text": "Leo was born on January 25, 1941 and passed away on Wednesday, August 24, 2016.  Leo was a resident of Cedar Rapids, Iowa at the time of his passing.        He was the companion of Susan Stramel.  No service.",
  "date_of_death": "2016-08-24"
}, {
  "id": "1071187",
  "date_of_birth": "1934-07-29",
  "obituary_text": "Alice Beth Lemmon (Lusk) was born on Sunday, July 29, 1934 and passed away on Friday, January 18, 2013. Alice Beth Lemmon (Lusk) was a resident of Ogden, Utah at the time of passing.",
  "date_of_death": "2013-01-18"
}, {
  "id": "8701515",
  "date_of_birth": "1936-09-12",
  "obituary_text": "Sara Lee Allen, age 82, of Alabaster passed away on March 12, 2019.  She was a member of First Presbyterian Church of Alabaster.  Sara was a loving wife and mother who loved spending her time being a caring \"SaSa\" to her grandchildren, nieces and nephews.Sara was preceded in death by her parents, Howard and Lucile Lee, and her brothers, Bob Lee and Lynn Lee.She is survived by her husband of 63 years, Ted Allen, daughters Pam Tucker (Jim) and Leigh Oelmann (Jeff) and son Mike Allen (Marcia.)  She is also survived by grandchildren Sarah Nan Gillis, Mary Beth Cline (Jon), Michael Allen (Michelle), Allen Tucker, Alex Tucker, Janie Oelmann, Anna Oelmann, and Allie Oelmann, and great-grandchildren Murphy Cline, and Perry Cline.Visitation for Sara Allen will be held on Friday, March 15, 2019 at First Presbyterian Church of Alabaster from 11:00 am – 12:00 pm followed by a funeral service at 12:00 pm. Burial will take place at Elliotsville Cemetery in Alabaster, Alabama In lieu of flowers, memorials may be made to First Presbyterian Church of Alabaster.",
  "date_of_death": "2019-03-12"
}, {
  "id": "53259906",
  "date_of_birth": "1976-06-20",
  "obituary_text": "An obituary is not available at this time for Edgar Ruben Garcia Vazquez. We welcome you to provide your thoughts and memories on our Tribute Wall.To plant a beautiful memorial tree in memory of Edgar, please visit our Tree Store or plant a tree.",
  "date_of_death": "2023-10-02"
}, {
  "id": "30135935",
  "date_of_birth": "1963-05-03",
  "obituary_text": "Martin Mynatt\u0027s passing has been publicly announced by Cochran of Hiawassee in Hiawassee, GA.The most recent obituary and service information is available at the Cochran of Hiawassee website.",
  "date_of_death": "2021-10-12"
}, {
  "id": "53196490",
  "date_of_birth": "1946-05-27",
  "obituary_text": "Molly Ann Lindsey Studenroth, a kind-hearted individual with an unwavering dedication to her family and community, passed away on Friday, September 22, 2023. Molly was born on May 27, 1946, in Chicago, Illinois to James and Myrtle Goin Lindsey. Throughout her life, she touched countless lives with her generosity, compassion, and commitment.Molly began her professional journey as a teller, showcasing exceptional skills and becoming a familiar face to many in the Elizabethtown, Kentucky community. For over 15 years, Molly diligently served the public as a teller.  She dedicated 10 years at First Hardin National Bank, where she worked tirelessly to ensure the financial well-being of others.While Molly\u0027s career was remarkable, it only scratched the surface of her incredible character and passions. Cats held a special place in Molly\u0027s heart; she carried an immense love for felines and made it her duty to rescue as many as possible. Countless animals found solace in her care and were fortunate enough to experience all-encompassing love. Her nurturing spirit never faded and will be deeply missed by the feline friends she left behind.Genealogy also captivated Molly\u0027s interest; delving into family connections brought her great joy. She spent countless hours poring over historical records and tracing family branches that had long been forgotten. Through her dedication to genealogy, Molly strengthened familial bonds and built bridges that spanned generations. Her passion for connecting relatives was truly remarkable.Molly was predeceased by her beloved husband Karl R. Studenroth in 1980 along with three sisters and three brothers. She cherished the memories they made together throughout their married life and carried their legacy within her heart.Left to cherish their memories are those whom Molly held dear. Her son, Karl Studenroth, will forever carry his mother\u0027s love with him, taking solace in the countless memories they shared; two sisters; and three brothers.  Molly\u0027s impact reached far beyond her immediate family, touching the lives of extended family members and close friends who will remember her warm smile and unwavering support.Molly Lindsey Studenroth lived a life filled with love and a dedication to her passions. Her compassion for animals, commitment to the community, and zeal for genealogy were guiding forces that brought joy to all those fortunate enough to know her. As we bid farewell to this remarkable woman, let us be comforted by the fact that her spirit lives on through the lives she touched and the everlasting memories she created. To celebrate her life, a memorial service is being planned for next spring.May Molly\u0027s soul find eternal rest as she reunites with loved ones who have gone before her. She will forever hold a special place in our hearts, and her goodness will continue to inspire all who have had the privilege of knowing her. The care of Mrs. Studenroth has been entrusted to Wells Funeral Home of Canton and an online memorial register is available at \"Obituaries\" at www.wellsfuneralhome.com.  ",
  "date_of_death": "2023-09-22"
}, {
  "id": "31400821",
  "date_of_birth": "1934-08-22",
  "obituary_text": "Kenneth Robert Corwin Kenneth Robert Corwin 83, of Capac, died Wednesday evening April 4, 3018, at Blue Water Hospice Home, Marysville. He was born August 22, 1934, in Yale the son of the late Kenneth and Hazel (Curvin) Corwin. His marriage to Ethel Ondrus was November 6, 1954, in Port Huron. He was employed by Mueller Brass, Port Huron for 50 years until his retirement. Ken enjoyed fishing, motorcycling, working on cars, farming, gardening and the out doors and especially spending time with his grandchildren. Surviving in addition to his wife Ethel of 63 years are three children, Roberta Lane of OK, Rebecca Corwin of St. Clair and Robert Corwin of Port Huron; seven grandchildren, Heather, Aimee, Tara, Raechel, Renae, Lauren and Devin; brothers, James (Kathy) Corwin, Mark (Anna) Corwin, David (Beverly) Corwin, Jerry Corwin, Charles (Madeline) Downing, Gene (Barbara) Downing, Michael (Carol) Downing, John (Linda) Downing, Lowell (Donna) Downing and Terry Downing, sisters, Clara Lloyd, Barbara (Michael) Gurnsey, Gail (Jack) Williams and Bethel Beery and many nieces, nephews and friends. He was preceded in death by a grandson, George Robert Lane and brothers, Frederick and Robert Corwin. The family honors the memory of Ken and invite you to visit and share memories Sunday, April 8, 2018, from 3:00 to 7:00 p.m. at Kaatz Funeral Directors, Capac. Funeral services will be 11:00 a.m. Monday with 10:00 a.m. visiting. Rev. Lisa Clark will officiate. Burial will be in Capac Cemetery, Mussey Twp. Memorials are suggested to \"Wishes of the Family\". For information and Guest Book kaatzfunerals.com",
  "date_of_death": "2018-04-04"
}, {
  "id": "10229588",
  "date_of_birth": "1925-09-17",
  "obituary_text": "Rosa KREISEL passed away on October 11, 2018.  Funeral Home Services for Rosa are being provided by I.J. Morris of Dix Hills, NY.",
  "date_of_death": "2018-10-11"
}, {
  "id": "34893194",
  "date_of_birth": "1935-04-25",
  "obituary_text": "Marilyn Norman, of Montevideo, died Thursday, May 19, 2022 at Centracare - St. Cloud Hospital at the age of 87.Funeral services will be held on Thursday, May 26, 2022 at 1:00 PM at Our Saviors Lutheran Church in Montevideo with Rev. Donald S. McKee officiating.Visitation with the family will be held on Wednesday, May 25, 2022 from 5:00 - 7:00 PM at Anderson – TeBeest Funeral Home in Montevideo with a prayer service beginning at 6:30 PM. Visitation will continue one hour prior to the service at church on Thursday.Arrangements are with Anderson – TeBeest Funeral Home of Montevideo.Marilyn Alva Norman (Amundson) was born April 25, 1935 in Benson, MN to Harris and Mable (Alsaker) Amundson. She was baptized and confirmed into the Christian Faith. She was united in marriage to Milo Norman Jr. at Our Saviors Lutheran Church in Montevideo in 1951. They moved to Edina where Marilyn spent time working as a butcher at Jerry’s Lucky Dollar. Milo and Marilyn moved to Madison in 1967 and settled in Montevideo in 1970, where she worked at Trailways Café for 34 years, retiring in 2004.Marilyn enjoyed crocheting and knitting, and with this talent she made many creations for her family and friends. She was also an excellent baker and cook. Marilyn had a love for fishing, which she shared that love with her family. She even taught a class in Montevideo on fishing and how to use certain equipment. Marilyn was an active member of Our Saviors Lutheran Church, at Heritage Hill, and the Ford Fordson National Collectors Club.She is survived by her children, Bruce Norman of Montevideo, Jenell (Kurt) Dahl of Montevideo, Brian (Patty) Norman of Granite Falls, Kevin (Sarah) Norman of Montevideo, and Tom (Deanne) Norman of Montevideo; grandchildren, Matthew and Adam Norman, Tanya (Jeff) Vanden Einde, Lori (Mike) Huntley, Tim Dahl, Jason Norman (Michelle Magnuson), Candice (Jamey) Freese, Morgan and Isabelle Norman, Kayla (Caleb) Cornelius, and Brandon (Jackie) Norman; several great-grandchildren and great-great-grandchildren; special friend and partner of 22 years, Doug Norman; brothers, Roger (Charolett) Amundson, Dorvin (Karen) Amundson, Dennis Amundson, and Kenny (MaryJane) Amundson; sister, Irene (Kelly) Lindblad; and several nieces, nephews, extended family and friends.She was preceded in death by her parents, and brother, Jerry.",
  "date_of_death": "2022-05-19"
}, {
  "id": "52419766",
  "date_of_birth": "1964-07-24",
  "obituary_text": "William Charles “Chuck” Drake, age 58, of Yukon, OK, passed away on Thursday, July 6, 2023 in Oklahoma City from complications related to pneumonia.He is preceded in death by his grandmother, Lola King, grandfather, Virgil King, and uncle, Dean King. He leaves behind his wife, Cheryl, and three children, Ashley, Megan, and Justin. He also leaves behind his mother, Lawana King Bray, father, Danny George (Sharry), and brother, Joe (Valerie). Chuck was a family man and made an effort to spend time with all of his extended family: his parents-in-law, Ed and Sharon Turk of Chandler, sisters-in-law Debbie (Glen) and Vicky (Paul), step siblings David (Kim) and Marjorie (Adam), nieces Jessica (Blain), Devin, Rebecca, Alexis, and Elizabeth (Larry), and nephews Micah (Ashley), Andrew (Charlotte), and Caden.Chuck was a loyal husband, loving father, devoted son, and avid hunter and fisherman. He was born on July 24, 1964 in Cushing, OK. He graduated from Grace Christian Academy in Oklahoma City. Chuck met his beloved wife, Cheryl Turk Drake, formerly of Chandler, while working as an armored guard for a bank in downtown Oklahoma City, where Cheryl worked in the vaults. He would always bring her candy before finally asking to see her outside of work. They married on August 7, 1993. As they welcomed their three children, Chuck was committed to teaching his children, nieces and nephews, and any who wanted to learn a love of fishing and the outdoors. For many years, he was involved in an annual fishing derby for kids, where he would convince novice anglers that they should kiss the worm for good luck, and he also competed semiprofessionally in bass fishing tournaments with his fishing partner, Roy Fryer. Each year, he took a trip to visit his friend Cecil’s cabin in McAlester, OK with at least one of his children, where they hunted and made lifelong friends and memories. Chuck worked at Tinker Air Force Base as a third generation civilian mechanic for 25+ years, first as an aircraft electrician on B-52s, and later as an aircraft analyst. Whenever groups visited for tours, Chuck was the person who showed them around with great pride and humorous storytelling. But wherever he was, the topics he could talk about the most about were his pride regarding his wife and children, and, usually, whatever bass fishing tournament in which he’d recently participated.Chuck is remembered as a generous friend who gave all that he could; he could be counted on to lend a helping hand for household projects and keep you entertained with a long, humorous story after he finished it. In his last act of generosity, Chuck was an organ donor, and even in death is giving someone else a chance at life. In all facets of his life, Chuck leaves behind a legacy of humor, hard work, generosity, and loyalty.Visitation will be held on Monday, July 10 from 6:00 to 8:00 p.m. at Buchanan Funeral Service, and Tuesday, July 11 from 11:00 a.m. to 12:45 p.m. at New Heights Baptist Church. Services will be held immediately following the Tuesday visitation at the church. In lieu of flowers, the family requests that donations be made to Casts for Kids, a charity that teaches children with special needs to fish.",
  "date_of_death": "2023-07-06"
}, {
  "id": "6786387",
  "date_of_birth": "1940-07-04",
  "obituary_text": "Mrs. Mary Lee Battie was born on July 4, 1940, in Newton Grove, to the late Pearlina and Charlie Sinclair. On August 16, 2021 at 7:00 a.m., she was called home.Mary received her education in Wayne County Public Schools and later received an Associates Degree in Business from Tarrant County Jr. College in Ft. Worth TX. On June 12, 1970, Mary married the love of her life, James Battie, and shared over 51 glorious years with him. After retirement they settled in Fayetteville NC and in 2004, Mary joined Berean Baptist Church where she served as an active member until her health declined.She was preceded in death by their son, DeWayne Smith and her brother, Roland Sinclair.Mary leaves to cherish her precious memories, her beloved husband, James Battie; 1 aunt, Adelle Virgil (Dunn,NC); her sister, Blanch Sinclair (Clinton, NC); her brother, Charlie Sinclair, Jr. (Miami, FL); 2 granddaughters, Taytana Smith (Fayetteville, NC) and Duwana Smith (Bethlehem, PA); 4 great-grandchildren; and a host of nieces, nephews, cousins and friends.Funeral services will be held on Monday, August 23, 2021 at Berean Baptist Church at 12:30 p.m. Burial will follow at Sandhillls State Veterans Cemetery. The family will receive friends from 2-4 p.m. on Sunday, August 22, 2021 at Jernigan-Warren Funeral Home.Online condolences may be left at http://www.jerniganwarren.comArrangements by Jernigan-Warren Funeral Home, 545 Ramsey St. Fayetteville, NC 28301To send flowers to the family or plant a tree in memory of Mary Lee (Sinclair) Battie, please visit our floral store.",
  "date_of_death": "2021-08-16"
}, {
  "id": "18485379",
  "date_of_birth": "1946-10-08",
  "obituary_text": "Francis P. Aste, 68, of East Andover passed away Tuesday, January 13, 2015.Francis was born in Woburn, Mass. on October 8, 1946 to Joseph and Anna (Criss) Aste. He earned an Associate\u0027s degree in electronics from NHTI in Concord and applied his knowledge as a supervisor with BEA Systems in Nashua. Francis was an Army Veteran who was stationed in Vietnam from 1968 to 1970 with Battery C of the National Guard Unit out of Franklin, N.H.; one of the top artillery units. He received an honorable discharge and was awarded the National Defense Service Medal, the Vietnam Campaign Ribbon w/ 60 Device, the Vietnam Service Medal and one overseas bar. Francis was a HAM radio operator under the call sign WA1VTS. He was deeply devoted to his family.Francis is survived by his wife, Susan (Perreault) Aste; his son, Paul L. Aste; his daughter-in-law, Leann; his grandchildren, Andrea and Sarah; his mother, Anna Bailey; and many dear friends. He was predeceased by his father, Joseph Aste. A graveside service with military honors will take place Thursday, January 22nd at 1 p.m. at the New Hampshire State Veterans Cemetery, 110 Daniel Webster Highway, Boscawen, N.H.The Cremation Society of New Hampshire, Boscawen office, is assisting the family with arrangements. For more information please go to csnh.com.",
  "date_of_death": "2015-01-13"
}, {
  "id": "15954871",
  "date_of_birth": "1934-07-02",
  "obituary_text": "Mary J. DennhardtAGE: 83 • Wall TownshipMary J. Dennhardt, 83 of Wall Township passed away on July 16, 2017 at Jersey Shore University Medical Center, Neptune with her family by her side. Mary was born and raised in Jersey City, NJ and lived in Union City and there is where she married her husband Robert and raised her family for almost 30 years before moving to Belmar, NJ in 1980. Mary was a communicant of St. Anthony\u0027s in Union City and St. Rose Church, Belmar. She had been a secretary for 40 years working for several companies, Holy Rosary Academy, Union City and Duffy Electronics, Belmar to name a few before retiring in 1987.Mary was predeceased by her husband of 57 years Robert Dennhardt in 2012. She is survived by her children Robert Dennhardt of Oak Ridge, N J, Ron (Debra) Dennhardt of Brick and Marianne (Greg) Brodmerkel of Tampa, Fl.; five grandchdildren Bobby Dennhardt, Nicole Dennhardt, Michael Jon Dennhardt, Russ Koss and Gregory Brodmerkel. Mary is also survived by a brother Frank (Daren) Hanley, Jr., nieces Meghan (Danny) Delacruz and Christina (Billy) Robinson; great nieces Ava Robinson and Macaela Delacruz; great nephew Billy Robinson.Family and friends are invited to attend a visitation on Sunday July 23, 2017 from 1-4 pm at Orender Family Home for Funerals 2643 Old Bridge Road Manasquan, NJ. A Mass of Christian Burial will be 10:30 am Monday July 24 at St. Rose Church, Belmar. Interment will be 1 pm at Brig Gen William C. Doyle Veterans Memorial Cemetery, Wrightstown, NJ. To send condolences to the family please visit www.orenderfamilyhome.com.",
  "date_of_death": "2017-07-16"
}, {
  "id": "31644093",
  "date_of_birth": "1937-08-10",
  "obituary_text": "William Jackson Milton\u0027s passing at the age of 84 has been publicly announced by Campbell \u0026 Sons Funeral Home in Savannah, GA.The most recent obituary and service information is available at the Campbell \u0026 Sons Funeral Home website.",
  "date_of_death": "2021-11-17"
}, {
  "id": "38320295",
  "date_of_birth": "1927-05-02",
  "obituary_text": "Duk-Soon ShadleyDuk-Soon Shadley, of Lombard, at rest November 26, 2016Arrangements entrusted to West Suburban Funeral Home \u0026 Cremation Services. Info 630-852-8000 or www.westsuburbanfh.com#h.com",
  "date_of_death": "2016-11-26"
}, {
  "id": "31324676",
  "date_of_birth": "1922-07-11",
  "obituary_text": "C. W. Bill Phillips - Lensing Funeral \u0026 Cremation | Iowa City, Coralville C. W. \"Bill\" Phillips, 95, of Iowa City, died peacefully on Monday, July 9, 2018 at The Solon Nursing Care Center, surrounded by family. A Mass of Christian Burial will be celebrated at 10AM, Saturday, July 14, 2018 at St. Patrick Catholic Church, Iowa City with the Very Rev. Rudolph T. Juarez officiating. Visitation will be held one hour prior to the service, at the church. Burial will be in St. Joseph Cemetery, Iowa City. In lieu of flowers, memorials may be directed to The American Cancer Society, St. Patrick Catholic Church, or Iowa City Hospice Bill was born on July 11, 1922 in Iowa City, the son of Thomas and Ruth (Smith) Phillips. He was united in marriage to Florence Nolan in Iowa City; she preceded him in death on February 23, 2018. Bill lived on the same farm his entire life. He was a member of St. Patrick Catholic Church, Knights of Columbus and Eagles. Bill enjoyed spending time with his family especially his grandchildren. Bill is survived by his two sons, Allan (Linda) Phillips of West Branch and Dale Phillips of Solon; eight grandchildren; eleven great grandchildren; one great-great granddaughter; and numerous nieces and nephews. He was preceded in death by his parents; wife, Florence; son, Curt; and grandson, Brian.",
  "date_of_death": "2018-07-09"
}, {
  "id": "5905658",
  "date_of_birth": "1987-08-10",
  "obituary_text": "There are no words that one could write to fully describe this amazing young man. As a kid, Stephen loved the great outdoors, riding his bike, and hanging out (or getting into trouble) with his brothers and friends. At age 16, Stephen was paralyzed from the chest down, as a result of an accident. He never let it define who he was or wanted to be in life. Stephen continued his love of fishing and hunting at the family farm. Even with his challenges, he was still able to shoot the largest deer in the field. Stephen always found a way to make people laugh with his quick jokes and his infectious smile which would always brighten the room. Family was very important to him, as he enjoyed the many family gatherings and quality time with everyone, accompanied by his English bulldog and faithful companion, Gus. He also really enjoyed spoiling his niece and nephew. Stephen just had a way about him that will leave an enduring legacy of courage, strength, and fortitude in the face of such unimaginable adversity. Stephen was preceded in death by his Grandmother, Betty Joann Gibson, Grandfather, Robert JosephRountree, and Aunt, Robyn Rountree Bunce. Stephen is survived by his Father, Robert LeeRountree, Mother, Teresa Tule, Brothers, Joseph Rountree and Justin Rountree, Sisters, CheyenneRountree and Alexis Tule, Grandparents, Monyeen and George Cooper, Aunts, Kristin Rountree Voigt and Tracy Price, Uncles, Terry Price and David Bunce, Niece, Anabella Rountree, Nephew, Simon Rountree, Special Cousins: Monica Bunce, Maggi, Ryan, Vincent and Leo Carmichael, Connor and Lucas Greer, Ethan Voigt, Kristin Young, Kody Cross, Geoffrey Price, Lauren LeVesque, and Sadie White, and childhood friend, Christopher Martinez. Stephen will be forever loved and missed by many.Visitation will be held at Cashner Funeral Home in Conroe, Texas on Wednesday, July 7, 2021, from 5:00pm to 7:00pm. Funeral service for Stephen Allen Rountree will be held at the Cashner Colonial Chapel on Thursday, July 8. 2021 at 2:00pm. There will be a private family interment.",
  "date_of_death": "2021-07-02"
}, {
  "id": "28501736",
  "date_of_birth": "1943-04-24",
  "obituary_text": "Burial arrangements under the direction of National Memorial Park.",
  "date_of_death": "2013-08-04"
}, {
  "id": "52482961",
  "date_of_birth": "1935-08-07",
  "obituary_text": "James Curtis Barbee, 87, was born on August 7, 1935, in Ripley, Tennessee, and passed away on July 12, 2023, in North Ridgeville, Ohio.   Visitation will be held from 9:00 AM to 10:00 AM on July 22, 2023, at Elyria Church, 276 Washington Avenue, Elyria, Ohio. The service will follow at 10:00 AM at the same location. Burial will take place at Brookdale Cemetery in Elyria.   James was employed at Harshaw Chemical and served in the U.S. Army.   In order to honor James\u0027s memory, donations can be made to the Friendship Animal Protective League, located at 8303 Murray Ridge Rd, Elyria, OH 44035.   ",
  "date_of_death": "2023-07-12"
}, {
  "id": "53429846",
  "date_of_birth": "1961-02-03",
  "obituary_text": "Priscilla M. Parks, 62, of New Brunswick, NJ, recently passed away on October 19, 2023 in Monroe Twp., NJ.   A memorial service will be held on November 5, 2023 at 1:30 PM at Prince of Peace Lutheran Church, 177 Princeton Hightstown Road, Princeton Junction, NJ.   Priscilla attended Monroe Twp. High School.   She worked for UMDNJ.   In order to honor Priscilla\u0027s memory, donations can be made to Chi Eta Phi Sorority, Nursing Scholarship Fund, 3029 13th Street Washington, D.C. 20009.   ",
  "date_of_death": "2023-10-19"
}, {
  "id": "8132695",
  "date_of_birth": "1940-08-12",
  "obituary_text": "N/A",
  "date_of_death": "2020-09-01"
}, {
  "id": "19354151",
  "date_of_birth": "1966-09-19",
  "obituary_text": "Michael Zaragoza\u0027s passing has been publicly announced by Ray and Martha\u0027s Funeral Home - Hobart in Hobart, OK.The most recent obituary and service information is available at the Ray and Martha\u0027s Funeral Home - Hobart website.",
  "date_of_death": "2021-10-03"
}, {
  "id": "1856398",
  "date_of_birth": "1950-05-17",
  "obituary_text": "  ROBERT DARNELL MOTEN  On Sunday, September 8, 2019, Robert Darnell Moten of Brandywine, MD, was called to rest. He leaves to cherish his memory his loving wife, Veronica Moten; daughters, LaDonya Moten-Thiam (Ngagne) and LaVeeta Moten (Steven Young); sister, Fern Williams (Ronald) and brother, Reginald Moten; three grandchildren; a host of other relatives and friends. Family will receive friends on Monday, September 23, 2019 at Brighter Day Ministries / Shaw Campus, 2525 12th Place SE, Washington, DC from 10 a.m. until time of funeral service at 11 a.m. Interment Maryland Veterans Cemetery, Cheltenham, MD on Friday, September 27, 2019 at 1 p.m. Arrangements by Strickland Funeral Services. www.stricklandfuneralservices.com  ",
  "date_of_death": "2019-09-08"
}, {
  "id": "4150613",
  "date_of_birth": "1927-10-22",
  "obituary_text": "Bernice Ready\u0027s passing has been publicly announced by Carpenter Memorial Chapel - North Platte in North Platte, NE .The most recent obituary and service information is available at the Carpenter Memorial Chapel - North Platte website.",
  "date_of_death": "2020-12-17"
}, {
  "id": "38678151",
  "date_of_birth": "1939-09-06",
  "obituary_text": "Celeste Stewart\u0027s passing at the age of 83 on Saturday, January 14, 2023 has been publicly announced.According to the funeral home, the following services have been scheduled: Visitation, on January 19, 2023 at 10:00 a.m., ending at 12:00 p.m., at Juniper Grove Baptist Church. Funeral service, on January 19, 2023 at 12:00 p.m., at Juniper Grove Baptist Church.",
  "date_of_death": "2023-01-14"
}, {
  "id": "14189039",
  "date_of_birth": "1931-08-30",
  "obituary_text": "Arrangements under the direction of Fort Lincoln Funeral Home, BRENTWOOD, MD.",
  "date_of_death": "2017-08-15"
}, {
  "id": "52586962",
  "date_of_birth": "1940-08-20",
  "obituary_text": "Terance Dean Mosher, 82 years old, was born on August 20, 1940 in Rockwell City, IA. He died on July 29, 2023 at Eastern Star Masonic Home in Boone, IA.   Visitation will be held from 2:00 PM to 4:00 PM on August 3, 2023 at Laufersweiler Funeral Home. Graveside services will take place at 5:00 PM on the same day at Lake City Cemetery.   Terance attended Rockwell City High School.   He was employed at Filer turkey farm, IBP, Umthun\u0027s, ACE Lines, and Roadway Enterprises.",
  "date_of_death": "2023-07-29"
}, {
  "id": "53623871",
  "date_of_birth": "1931-04-05",
  "obituary_text": "Rita Troiani, 92, passed away peacefully at the Wayne Center on November 16, 2023.Her funeral service will be held Wednesday 11am at the St. Denis Church, 2401 St. Denis Ln., Havertown, PA, 19083 with a visitation at the church from 10-11am. Burial will take place after mass at St. Denis Cemetery.Online condolences can be sent via www.batemanallenfuneralhome.com",
  "date_of_death": "2023-11-16"
}, {
  "id": "11806665",
  "date_of_birth": "1924-10-02",
  "obituary_text": "Mildred Oldham passed away on December 24, 2013.  Funeral Home Services for Mildred are being provided by Gateway Little Chapel of the Chimes | Portland OR of Portland, OR.",
  "date_of_death": "2013-12-24"
}, {
  "id": "48018630",
  "date_of_birth": "1968-11-04",
  "obituary_text": "Beth-Lyn Pisko, affectionately known as “Choo-choo”, died at her home in Elephant Butte on Monday, October 24, 2022, she was 53. She was born on November 4, 1968 in Greensboro, PA to Charles S. Beehner and Linda K. Danner. Beth-Lyn loved her career as a registered nurse at the New Mexico State Veterans Home. She was a member of the Moose Lodge in T. or C. Beth-Lyn loved baking for the holidays, she was an avid Pittsburg Steeler fan, and was a collector of anything Coca-Cola. She had a very special place in her heart for her dog, Riley. Survivors include her husband, Brian Pisko; parents, Charles S. Beehner and Linda Beehner; and friends, Carol Trent; Cathy Harkins and family; and others. She was preceded in death by George Danner, Gertrude Danner, Marguerite F. Beehner, Wade Pete Danner, and William D. Beehner. Send flowers to the service of Beth-Lyn Pisko",
  "date_of_death": "2022-10-24"
}, {
  "id": "3420804",
  "date_of_birth": "1944-11-20",
  "obituary_text": "Jean Smith\u0027s passing at the age of 76 on Tuesday, November 24, 2020 has been publicly announced by Northern Indiana Funeral Care in Fort Wayne, IN .The most recent obituary and service information is available at the Northern Indiana Funeral Care website.",
  "date_of_death": "2020-11-24"
}, {
  "id": "36894529",
  "date_of_birth": "1944-09-02",
  "obituary_text": "Helen M. Barnhart Spangler, age 78 of Lancaster, died October 23rd, 2022 at Fairfield Medical Center. She was born to the late Hugh and Martha Baker Barnhart, on September 27, 1944 in Royalton, OH. Helen enjoyed quilting and crocheting. She was a devoted mother, who loved and adored her grandchildren and great grandchildren. Her amazing personality and love for life will be greatly remembered.She is survived by her children, Herbert Thomas, Harry Thomas, Jennifer (Bryan) Harmon, Martha Spangler, and Betty Spangler; grandchildren, Thomas, Heather, Anthony, Sebastian, Leo, and Helen; great grandchildren, Elliot, Layne, Nora, Freya, Luke, Dominic, and Aria; brother, Robert Barnhart; and several nieces and nephews.Helen was preceded in death by her husband, Russell Spangler Sr.; her parents; siblings, Donald (Betty) Barnhart, Franklin Barnhart, and Ann Nichols.A private graveside service will take place at a later date at Floral Hills Memory Gardens. Arrangements have been handled through the Frank E. Smith Funeral Home. Online condolences can be made at www.funeralhome.comTo send flowersto the family or plant a treein memory of Helen M. (Barnhart) Spangler, please visit our floral store.",
  "date_of_death": "2022-10-23"
}, {
  "id": "52077243",
  "date_of_birth": "1942-08-03",
  "obituary_text": "To plant a beautiful memorial tree in memory of Mary, please visit our Tree Store or plant a tree.",
  "date_of_death": "2023-05-26"
}, {
  "id": "30431190",
  "date_of_birth": "1921-06-19",
  "obituary_text": "Pebble C. Wood died on August 8, 2012 in Portland, Oregon at the age of 91.  She was born on June 19, 1921 in Mabel, Oregon to Mr. and Mrs. James (Smith) Kinman.Pebble grew up in Mabel, Oregon.  In 1951 she moved to Myrtle Creek, Oregon and has resided in the Portland area since 1985.  Pebble graduated from Mohawk High School in Marcola, Oregon in 1938.  She married George Wood in 1938 in Eugene, Oregon.  He passed away in 1983.Hobbies included gardening, traveling, walking,  playing cribbage, doing jigsaw puzzles and spending time with her family.Survivors  include her son Thomas Wood, of Arlington, Texas, daughter, Terry Copper of Kent, WA., brother Ward Kinman, of Houston, Texas and two sisters, Sara of Springfield, OR., and Eva of Lakeside, OR., 4 grandchildren, Lydia and Richard Copper, Michelle Wood and Matthew McAllister, and two great-grandchildren, Dominik and Savannah.No services will be held.  Bateman Carroll Funeral Home in Gresham, Oregon has been entrusted with funeral arrangements.  Please visit our web site to leave condolence messages at: Batemancarrollfunerals.com",
  "date_of_death": "2012-08-08"
}, {
  "id": "9573508",
  "date_of_birth": "1946-09-19",
  "obituary_text": "When I come to the end of the road and the sun has set for me I want no rites in a gloom-filled room. Why cry for a soul that\u0027s set free. Miss me a little, but not too long and not with your head bowed low. Remember the love that we once shared. Miss me, but let me go. For this is a journey that we all must take and each must go alone. It\u0027s all a part of the Master\u0027s plan, a step on the road to home. When you are lonely and sick of heart, go to the friends we knew and laugh at the things that we used to do. Miss me, but let me go.",
  "date_of_death": "2018-10-07"
}, {
  "id": "51526965",
  "date_of_birth": "1982-07-14",
  "obituary_text": "Zenobe Randall\u0027s passing at the age of 40 on Monday, March 27, 2023 has been publicly announced by Oliver \u0026 Eggleston Funeral Establishment - Minor B Eggleston Chapel in Farmville, VA.According to the funeral home, the following services have been scheduled: Service, on April 4, 2023 at 1:00 p.m., ending at 2:00 p.m., at New Life Church, 9 Mahan Rd, Farmville, VIRGINIA. Funeral service, on April 4, 2023 at 2:00 p.m., at New Life Church, 9 Mahan Rd, Farmville, VIRGINIA.The most recent obituary and service information is available at the Oliver \u0026 Eggleston Funeral Establishment - Minor B Eggleston Chapel website.",
  "date_of_death": "2023-03-27"
}, {
  "id": "30763300",
  "date_of_birth": "1923-10-08",
  "obituary_text": "ATCHISON, Hazel Dennis, 87, a resident of Prattville, AL, passed away on Friday, July 22, 2011. She was preceded in death by her husbands, The late Andrew L. Dennis and the late Virgil Atchison. She is survived by three sons, Andrew E. (Sherry) Dennis, James A. (Brenda) Dennis, Richard W. (Lana)  Dennis, Rev. Paul (Gail) Atchison; one sister, Elizabeth (Bud) Kirsch; nine grandchildren, twenty one great grandchildren, one great great grandchild. A special thanks to the staff of Prattville Health and Rehab for their wonderful care. In lieu of flowers memorials can be made in her honor to the Gideons International www.gideons.org or the Prattville First Baptist Church Benevolence Fund.Funeral services will be held at 2:30 p.m. on Sunday, July 24, 2011 at Ridout\u0027s Prattville Chapel with Dr. Travis Coleman, Rev. Douglas Powell and Rev. Paul Atchison officiating. Burial will follow in Memorial Cemetery, Maplesville, AL. Visitation will be held one hour prior to the service.",
  "date_of_death": "2011-07-22"
}, {
  "id": "30829840",
  "date_of_birth": "1918-10-11",
  "obituary_text": "Chester A. Hoffner Jr., 92, of Kingman, Arizona passed away Sunday May 8, 2011 at the Garden Care Center, Kingman, Arizona.   Chester was born in Chest Twp, on October 11, 1918; he was a son to the late Mr. Chester A. Sr. and Idella (Mervine) Hoffner.  He was employed as an Air Craft Supervisor, by Boeing in Witchia, Kansas and retired form Rohr, in Spring Valley, California.  He was preceded in death; in addition to his parents buy his wife Josephine (Westbrook) Hoffner who passed away on October 18, 1998 a daughter Elaine E. Smith and a son Correll D. Smith.  Surviving is a daughter in law Martha Smith of Kingman, Arizona granddaughter Joe LaBas of Mesa, Arizona a grandson David Chester Smith of Kingman, Arizona; grate grandchildren Dieena Rae Nelson, Michael and Mark LaBas and David Baxter Smith.  great-great grandchildren Griffin C. and Spencer Nelson and Blake Labus a brother Loyd Hoffner, of Baltimore M.D. and many nieces and nephews.  Grave side funeral services will be held on Tuesday May 17, 2011 at 2:00 P.M. at the Stroudsburg Cemetery, with Rev. John Harding Officiating.",
  "date_of_death": "2011-05-08"
}, {
  "id": "6290898",
  "date_of_birth": "1987-07-05",
  "obituary_text": "Kassitty Denise Whaley, 33, of Decatur, IL passed away August 11, 2021 at St. Mary’s Hospital.Kassitty was born July 5, 1987 in Decatur, IL, the daughter of Manolito Conner Sr. and Jill Whaley.Kassitty was a hairdresser, nail technician and a talented makeup artist. She was a loving mother and a wonderful person who will be missed dearly.Surviving are her mother, Jill Whaley of Decatur, IL; father, Manolito Conner Sr. of Decatur, IL; children, Jerimiah Howard, Kella Whaley, Calvin Drew III, Kamia Whaley; siblings, Manolito Conner Jr (Alexis) of Decatur, IL, Devin Conner of Decatur, IL, Robert Conner of North Carolina, Byron Conner of North Carolina, Sierra Conner of Decatur, IL, Cora Lee Conner of Decatur, IL, Honey Conner of Decatur, IL, Stoney Whaley of Decatur, IL and Quenton Gude of Decatur, IL.Graveside funeral service will be 11:00 AM Wednesday, August 18, 2021 at Lester Barnett Cemetery.The Graceland Fairlawn Funeral Home has been entrusted with the care of Kassitty. Condolences may be left to her family at www.gracelandfairlawn.com.",
  "date_of_death": "2021-08-11"
}, {
  "id": "51842777",
  "date_of_birth": "1934-07-13",
  "obituary_text": "Rosie Dulaney\u0027s passing on Monday, May 8, 2023 has been publicly announced by Tomblyn Funeral Home Inc in Elkins, WV.According to the funeral home, the following services have been scheduled: Visitation, on May 12, 2023 at 5:00 p.m., ending at 7:00 p.m., at Tomblyn Funeral Home, 45 Randolph Ave., Elkins, WV. Funeral service, on May 13, 2023 at 11:00 a.m., at Tomblyn Funeral Home, 45 Randolph Ave., Elkins, WV.The most recent obituary and service information is available at the Tomblyn Funeral Home Inc website.",
  "date_of_death": "2023-05-08"
}, {
  "id": "5521580",
  "date_of_birth": "1923-02-15",
  "obituary_text": "Betty J. Nicholas, 98, longtime resident of Lake Nebagamon, WI went to her heavenly home on May 6, 2021.She was born February 15, 1923 in Middle River, WI to Gustaf and Ida (Smestad) Gronquist, the fourth of five daughters. Betty spent her early years in Rockmont before moving to Superior, where she graduated from Central High School. She worked at the Franklin Creamery to help pay off the family dairy bill. Later she worked at the co-op wholesale building packing coffee and operating their switchboard. She married Lindy Nicholas at Concordia Lutheran Church in Superior on July 12, 1947. They raised three boys together: Charles Linfred, James Scott, and Steven Tate.Betty and Lindy exemplified the commitment and determination so prevalent in that ‘greatest’ generation. Betty worked alongside Lindy building their house including mixing mortar and tending block. She also painted with watercolors and enjoyed photography, sign painting, sewing, baking, and cooking. She was a leader with 4-H. Betty helped Lindy and his cousin start a golf course in the 60’s and ran it while the men were working. She was an avid golfer for many decades. Her example encouraged her boys and many others to face life with patience, determination, and compassion.Betty became a widow in 1997 after caring for Lindy during his many years of kidney failure. She lovingly helped raise two of her granddaughters, Lesley and Carah Nicholas and opened her home to many, showing selfless hospitality.Betty was preceded in death by her parents, her four sisters Doris Farmer, Alice Kinser, Lois Anderson, and Edna Tatge.She is survived by her three sons, Charles (Shirley), James (Shannon), and Steven (Tami); 5 grandchildren: Cameron, Trevor (Renee), Carah, Lesley, Emma (Ja’lon); great grandchildren Ethan and Everett (Trevor and Renee), and numerous nieces and nephews including Phyllis and Tom Flaherty who cared for her when she could no longer live alone. Special thanks to the able staff at St. Croix Hospice and the generous caregivers at Cedar Ridge who became like family in their faithful care for Betty.Visitation will be from 10 until the 11 a.m. service, Thursday May 13, 2021 at Trinity Lutheran Church, 11416 E. 1 Street N., Lake Nebagamon, WI 54849. Reverend Darrell Kyle will officiate.Burial will be in the family lot at the Lake Nebagamon Cemetery. Following the committal service, everyone is invited back to the church for a luncheon.",
  "date_of_death": "2021-05-06"
}, {
  "id": "6361641",
  "date_of_birth": "1958-09-24",
  "obituary_text": "Christopher Ralston Meehan\u0027s passing has been publicly announced by Fellows, Helfenbein \u0026 Newnam Funeral Home in Chestertown, MD.The most recent obituary and service information is available at the Fellows, Helfenbein \u0026 Newnam Funeral Home website.",
  "date_of_death": "2021-08-27"
}, {
  "id": "6833220",
  "date_of_birth": "1927-01-11",
  "obituary_text": "William Hendry Father, mechanical engineer and veteran, 89 William Hendry, 89, of Cranford, N.J., passed away on March 1, 2016. Funeral services will be held on Saturday, March 5, 2016, at 9:30 a.m. in The Gray Memorial Funeral Home, 12 Springfield Ave., Cranford. Interment will follow at Somerset Hills Memorial Park, Basking Ridge, N.J. Visitation and Life Celebration will be on Friday, March 4, 2016, from 2 to 4 and 7 to 9 p.m. at the funeral home. Born in Harrison, N.J., Mr. Hendry lived in Cranford for 55 years. He served in the U.S. Coast Guard during World War II, and then in the U.S. Army during the Korean War. He spent the majority of his career as a mechanical engineer with Western Electric Co. and AT\u0026T. He also spent many years teaching college as an adjunct faculty member at NJIT and Union County College. Over the years, he was a member of the Cranford VFW Post 335, the Masonic Lodge, the Juvenile Diabetes Foundation, Foundation for Diabetes Research, and was a member and elder of Osceola Presbyterian Church. He was predeceased by his wife of 50 years, Gladys, and is survived by his sons, William and his wife, Jennifer, Bruce, and Brian. He is also survived by his granddaughters, Melissa and Kristen. In lieu of flowers, the family requests that donations be made to the Foundation for Diabetes Research, 513 West Mount Pleasant Ave., Suite 220, Livingston, N.J. 07039, diabetesnj.org.",
  "date_of_death": "2016-03-01"
}, {
  "id": "52111716",
  "date_of_birth": "1960-09-11",
  "obituary_text": "Edward Kopchak\u0027s passing on Tuesday, March 21, 2023 has been publicly announced by Joseph J. Stutz, Inc. Funeral Home in Mount Carmel, PA.According to the funeral home, the following services have been scheduled: Visitation, on March 31, 2023 at 10:00 a.m., at Joseph J. Stutz, Inc. Funeral Home, 40 South Market St., Mount Carmel, PA. Service, on March 31, 2023 at 12:00 p.m., at Joseph J. Stutz, Inc. Funeral Home, 40 South Market St., Mount Carmel, PA.The most recent obituary and service information is available at the Joseph J. Stutz, Inc. Funeral Home website.",
  "date_of_death": "2023-03-21"
}, {
  "id": "8604049",
  "date_of_birth": "1976-03-27",
  "obituary_text": "Kelley, Chris \"Crumb\" 42 of Mascot, TN went to be with the Lord Sunday, March 24, 2019. He gave his life to the Lord in 2017. Chris absolutely adored his 4 grandchildren. His favorite thing in the world to do was special effects makeup and scaring people. Chris loved his wife\u0027s cooking. He was quick witted and enjoyed bonfires with friends and family. Chris always had a joke on the tip of his tongue. He loved and cared about people and would help others, within his capabilities. Chris came from a large family, which helped to add to his huge personality. He was preceded in death by mother, Shelia Hansen; father, Jimmy Kelley; daughter, Shelia Cheyenne Kelley. Chris is survived by spouse, Shawn \"Pryj\" Kelley; children, Ryan Shown, Bethany (David) Vincil, Melanie (Eric) Morgan, Logan Kelley; grandghouls, Xander \"Goblin,\" Kelton, Harper \"Boo,\" Mr. Elliott; brother, Jason Harden; sisters, Serena Kelley, Joni Baston, Amanda Reneau-Conrad; multitude of aunts, uncles, nieces, nephews, and cousins who think he\u0027s the bomb diggity. Family will receive friends Wednesday, March 27th from 5-7pm  with funeral service following at 7pm at Berry Highland West on Sherrill Blvd. In lieu of flowers, please make memorial contributions to Shawn Kelley to assist with funeral expenses.",
  "date_of_death": "2019-03-24"
}, {
  "id": "52360242",
  "date_of_birth": "1925-04-03",
  "obituary_text": "ObituaryIt is with profound sadness that the McNulty family shares the news of the passing of Emily, their family’s matriarch, mother, “Glam-ma”, great “Glam-ma”, aunt, godmother and treasured friend to so many, in the early morning hours of Monday, June 26th. She was 98 years old (1925-2023). Emily truly lived a life well lived.Born by a mid-wife at home (often common in 1925), she was the daughter of George and Anna Gago who had immigrated from Czechoslovakia. Not many can say this, but Emily lived her entire 98 years within a 50 block radius in the greater Milwaukee area. Always impeccably dressed and coifed with a keen sense of style in fashion and home decorating, her French twist hairstyle was her signature.She was a graduate of the class of 1939 from St. Michael’s Grade School. St. Michael’s perhaps has one of the most active and well run alumni programs in the country (remember this is a grade school!). Emily was passionately active in running key year reunions for her class, even hosting the 70th in her home and garden.Emily had many fond memories and again established lifelong friendships when she attended Holy Angels Academy, graduating with the class of 1943. Once again, she used her creative talents to spearhead the reunions to ensure they were well orchestrated with eye catching invitations, angel name tags, programs and centerpieces.Emily was honored to be awarded 1 of the 7 Boston Store Retail College Scholarships, assisting her to attend Marquette University. She was so proud to represent Marquette University on the Boston Store College Travel Bureau reception committee, modeling for their fashion shows and working as an assistant buyer in Better Sportswear. She earned her BA in Business Administration in 1948. At Marquette, she met the love of her life and future husband of 53 years, Truman Quentin McNulty, who she fondly referred to as “Tru-heart”. His exceptional ballroom dancing skills and many MU mixers sealed the deal. She had a storybook wedding in 1950, with her wedding dress from Hixon’s, reception in the Imperial Grand Ballroom of the Pfister Hotel, a full orchestra and 300 in attendance.Family was everything to Emily. She provided her children/grandchildren with guidance, discipline, strength, family values, work ethic and was supportive of their dreams. 110% of her focus was on her husband and raising her children, Mark, Mary Kay, Brian, and Erin. She was often teased for having the perfectly planned Catholic family, having them two years a part.! Her career became roles, such as scout den mother of Pack 56, Den 7, supreme hostess of countless elaborately decorated themed birthday parties for the children, Marquette High School Mother’s Guild, DSHA Parent’s Club, and more. On her husband’s side, a member of Milwaukee Lawyer’s Wives (hosting May 1 Law Day for new USA citizens), State Bar of Wisconsin and ABA Lawyer’s Wives, board member of Marquette University Association of Women, and hosted the MU “Dinner for 12 Strangers” that brought new students and faculty together. She also devoted time to two Wauwatosa Women’s Clubs, was a lifetime member of the Christ Child Society and Slovak Catholic Sokols Wreath 93. Always very proud of her 100% Slovak heritage. She was a consummate host to home dinner parties, Washington Highland’s newcomer parties, coffees for various political candidates, and too many more to mention.What was truly remarkable about Emily was her wide range of friends from all backgrounds and ages, sometimes 25 years her junior to 20 years her senior, who came to her for advice, decorating tips, recipes, serving dishes, party planning decorations, etc. She was even nominated by a young, just married lawyer for the Milwaukee Journal Best Cook on the Block publication.Emily always said she lived a charmed life. A travel agent friend of her once told her “You are not considered well traveled until you book passage on the QE-2, fly the Concorde and ride the Orient Express.” Emily accomplished all 3. She treasured her two trips to her mother’s home village in Slovakia, once with her mother and 25 years later with her daughter. One of her cherished memories was attending the Presidential Inauguration and Ball in Washington DC.Emily’s last years were graced by the immeasurably compassionate care and loving, loyal and constant support of Betty V. Heartfelt thanks to the other caregivers who also supported Emily on her final journey. They all were instrumental in allowing her to stay in the Highland’s home she treasured since 1971.Just a glimpse into the life of a 98 year old woman who gave so much to so many for them to succeed and enjoy life.Emily is reunited in heaven with her husband Truman (2004), daughter Erin (2010), son Mark (2019), brother Rudy Gago (1983) and her faithful canine companion Riley (2021). She leaves to celebrate her life her devoted daughter Mary Kay of San Francisco, loving son Brian (Luanne) of Green Bay, cherished grandchildren Natalie Bowling (Scott), Kelly, Brigette and Sam and great-grandson Ace Bowling, along with many other relatives and friends. Visitation for Emily will be on Friday, July 7th from 4 PM – 7 PM at Wisconsin Memorial Park, Chapel of the Chimes, 13235 W. Capitol Dr. Brookfield. Mass will be on Saturday, July 8th at 12 Noon, with eulogies at 11:50 AM, at St. Sebastian Catholic Church, 5400 W. Washington Blvd., Milwaukee. Private interment.Contributions to the Truman \u0026 Emily McNulty Scholarship and Award Fund at Marquette University Law School (Checks may be made payable to Marquette University Law School, with McNulty Fund written in the memo line. Please mail checks to Marquette University, PO Box 7013, Carol Stream, IL 60197-7013.) or the Wisconsin Humane Society (4500 West Wisconsin Avenue, Milwaukee, WI 53208) requested.Mom, you are now reunited with dad and enjoying a ballroom dance that will last an eternity. As was your telephone ritual with Brigette, we say to you “we love you, we love you more, we love you the mostest, we love you to the moon and now love you to the heavens”.To send flowersto the family or plant a treein memory of Emily Ann (Gago) McNulty, please visit our floral store.",
  "date_of_death": "2023-06-26"
}, {
  "id": "6322556",
  "date_of_birth": "1932-07-12",
  "obituary_text": "Alberto Quezada Escudero, age 89, entered into eternal rest on Wednesday, August 18, 2021 in El Paso, Texas. He was a wonderful father, brother, and son and will be greatly missed. Alberto is preceded in death by his loving parents; Moises Quezada and Maria De Jesus Escudero, and daughter Haydee Nicolas. He is survived by his adoring children; Patricia Gonzalez, Alberto Quezada, Norma Ortiz, Eva Corral, Jesus Manuel Quezada, Martin Arturo Quezada, Cristina Bruneta, Judith Quezada, his loving siblings, and many beautiful Grandchildren and Great Grandchildren. He is also survived by many extended friends and family to cherish and honor his memory.Visitation will be held Monday, August 23, 2021 from 5:00pm to 8:00pm at Sunset Funeral Home- West.Services are entrusted to Sunset Funeral Home-West, 480 N. Resler Dr.",
  "date_of_death": "2021-08-18"
}, {
  "id": "17786932",
  "date_of_birth": "1994-07-24",
  "obituary_text": "Austin David Huyck, 20 years old, left us on April 1 2015.   He was born on July 24th 1994 in Lompoc California, and was raised in Lompoc.   Austin suffered from Prader Willi Syndrome and was diagnosed at birth.   Austin attended Fillmore Elementary, and graduated from Cabrillo High School.  He was currently attending Lompoc High School Adult Education.  Austin always enjoyed sports and was Conqs thirteenth man for the Cabrillo boys\u0027 basketball team and lettered in the sport.  Austin leaves many friends behind.  Austin loved to attend all the special events in Lompoc and never went anywhere without his paper play money.  Austin was proceeded in death by his loving nana Erika Reprogle, grandpa Jerry Pukowietz, great aunt Katie Meadors, great uncle Henry Meadors, great grandmother Hideko Whichelo, Jimmy Huyck and Aunt Lorrinda.  Austin is survived by his grandpa George Reprogle, dad Karl Loss, mom Doreen Huyck, stepmama Heather Rideout, 6-yearold brother Kyle Loss, 10-monthold sister Kendall Loss, brothers Mike and Greg Huyck and nieces Kaytee and Zoe, aunt Katie Nord, uncle Charles Nord, cousins Rosalind and Erik Nord, aunt Darlene Reprogle, uncle Leroy Reprogle, aunt Janine Jones, Roger, grandma Lola and many other friends and family.  He will be greatly missed.The memorial service will be Wednesday, April 8, 2015, at 9am at Lompoc Foursquare Church.",
  "date_of_death": "2015-04-01"
}, {
  "id": "3046303",
  "date_of_birth": "1953-02-05",
  "obituary_text": "Penny Moore\u0027s passing at the age of 67 on Tuesday, October 20, 2020 has been publicly announced by Best Funeral Home in Middlefield, OH .The most recent obituary and service information is available at the Best Funeral Home website.",
  "date_of_death": "2020-10-20"
}, {
  "id": "52420940",
  "date_of_birth": "1938-04-12",
  "obituary_text": "Doris Lea Ruble, 85, of Parkersburg, WV passed away at her residence on July 7, 2023. She was born April 12, 1938 in Parkersburg, WV, a daughter of the late Shirley D. Elliott and Iva A. Dotson Elliott.Doris was a retired nurse of 50 years from CCMH and St. Joseph Hospital. She also retired as a receptionist from Consumer Credit Counseling Service. She loved camping, baking, shopping, and crocheting. She loved her River family.She is survived by one son, James F. “Jim” Elliott (Gretchen) of Houston, TX; one daughter, Tammy Gaston (Buddy) of Parkersburg; one granddaughter, Mistie Gaston-Smith of Wadesville; five great-grandchildren, Brent, Andrew, Ashley, Claire, and Ava Gaston; one sister, Shirley Ann Berlin of San Marcos, TX and several nieces and nephews.In addition to her parents, she is preceded in death by her husband, Raymond Ruble; two grandchildren, Jason and Joey Gaston; five sisters, Nellie Dailey, Margie Starcher, Lucille Hoce, Marcella Garretson, and infant sister, Mary; and one brother, Howard Elliott.Special thanks to Amedysis and all who took care of her, especially Amanda.Funeral Services will be Tuesday, July 11, 2023 at 1:00 PM. Burial will follow at Sunset Memory Gardens. Visitation will be Monday, July 10, 2023 from 6:00 – 8:00 PM.Lambert-Tatman Funeral Home, South Parkersburg is honored to serve the family.To plant Memorial Trees in memory of Doris Lea Ruble, please click here to visit our Sympathy Store.",
  "date_of_death": "2023-07-07"
}, {
  "id": "3086149",
  "date_of_birth": "1996-09-04",
  "obituary_text": "Matthew Franklin Jolley passed away on November 4, 2020 in Asheville, North Carolina. His struggles are over and now he is at peace. Matthew is survived by his mother Rhonda Whicker Jolley of Winston-Salem, his father and step-mother, Frank and Sherry Jolley of Winston-Salem, his step-brother Nick Siano of Wilmington, his step-sister Samantha Siano of Raleigh,  and his paternal grandmother Violet Jolley. He is preceded in death by his paternal grandfather Osee Jolley of Winston-Salem, his  sister Brandy Whicker of Winston-Salem, and his maternal grandparents Jay and Beatrice Whicker.Matthew’s life was too short, but all who knew him will remember his kind heart and caring nature. He loved the outdoors and was happiest with a fishing rod in his hand and a dog by his side. A celebration of life will be held at a later date. Because, if he could, Matthew would have given every shelter dog a home, in lieu of flowers the family asks you make donations to AARF of Winston-Salem, www.aarfws.org.",
  "date_of_death": "2020-11-04"
}, {
  "id": "11051479",
  "date_of_birth": "1969-11-19",
  "obituary_text": "Michael \"Mike\" Anthony Mann, 48 of Vinemont, passed away on Tuesday, July 24, 2018.Mike was a loving husband, father, grandfather, son, brother and friend. He had the biggest heart and was always willing to help anyone in need. He enjoyed hunting, football; especially Alabama and Addison High School, boating on Smith Lake and riding in his truck with his buddy Oreo his beloved dog. He loved coaching his kids in baseball and football. He was the owner and operator of Mike\u0027s Mobile Home Moving. He also owned a saw mill and loved making beautiful wood with it.He is preceded in death by his father, Travis Leyon Mann; grandson, Dayson Leyon Herron; half-brother, Travis Leyon Mann, Jr.; and grandpa, Marvin Jackson.He leaves to cherish his memory, his wife, Donna Mann; sons: Daniel Mann and Matthew Mann; daughter, Chelsea Mann; grandsons: Bryce Herron and Ashton Herron; granddaughter, Emilee Mann; mother, Billie Stovers; step-father, Ray Stovers; sisters: Cindy (Eddie) Hamby and Melissa Elliott and a host of nieces, nephews, aunts and uncles.His family will receive friends on Friday, July 27, 2018 from 5:00 p.m. until 9:00 p.m. at Moss Service Funeral Home. The Celebration of Life for Mike Mann will be on Saturday, July 28, 2018 at 11:00 a.m.  in the chapel of Moss Service Funeral Home with Burial immediately following at Mt. Vernon Cemetery.Please visit Mossservicefh.com to leave online condolences for the family. Moss Service Funeral Home is directing.",
  "date_of_death": "2018-07-24"
}, {
  "id": "8410660",
  "date_of_birth": "1974-11-26",
  "obituary_text": "David Wayne Levette was born November 26, 1974 to Rose Marie Levette in Jasper, Texas. He attended and graduated from Jasper High School. David had a big imagination and big dreams as well as a good heart.He is preceded in death by his mother, the late Rose Marie Levette.David leaves to cherish his memory, a daughter, Tameria Beatty; three sisters, Tamora Hadnot (Albert), Renee Levette (Wadell Barlow) and Sandy Crumedy and a brother, Michael McDaniel. He also leaves a host of nieces, nephews, cousins, aunts, uncles and friends.",
  "date_of_death": "2020-05-11"
}, {
  "id": "35300823",
  "date_of_birth": "1993-02-14",
  "obituary_text": "Anthony Chin\u0027s passing on Saturday, June 18, 2022 has been publicly announced by Lincoln Memorial Park - Portland in Portland, OR.The most recent obituary and service information is available at the Lincoln Memorial Park - Portland website.",
  "date_of_death": "2022-06-18"
}, {
  "id": "42705629",
  "date_of_birth": "1939-08-16",
  "obituary_text": "On Sunday, February 5th, Stanley M “STAN” Stark of 1628 Courthouse Rd left this earth to once again join his loving wife Wanda in eternal embrace.Stanley was born on August 16th, 1939, in Brattleboro, Vermont to Malcolm and Stella Stark. Born a few years before the attack on Pearl Harbor, Stanley and his family moved several times during his childhood. World War II was on, and Malcolm Stark moved his family from Vermont to Massachusetts, Topsham Maine, and Washington tate in search of work. Shortly after the war, Stanley and his family returned to Maine.Stanley spent his remaining childhood in small, rural New England where he developed an unmatched work ethic logging in the woods of Maine while employed at his fathers’ sawmill.Stanley graduated from Appleton High School and enlisted in the United States Navy in 1957. This would be the beginning of a remarkable military career that saw Stanley serving his country in Europe, Africa, the Indian Ocean, and Vietnam. During his impeccable military career Stanley rose to the rank of Master Chief Petty Officer, the highest rank afforded to enlisted personnel. It was during his first tour of duty in Naples, Italy, that Stan would meet and fall in love with his beloved wife Wanda. For 58 years Stan and Wanda would build an unshakeable marriage that would lead them on adventures across the world and see them raise three children. Stan and Wanda exemplified complete and total love, joy, and commitment. This wonderful bond would live on well beyond Wandas’ passing in 2018.In recent years, Stan discovered his passion for salt and freshwater kayaking. Stan competed in many races throughout the Southeast and loved paddling with his new group of friends.The older, wiser Stan was dubbed the “Zenmaster” by his new-found brotherhood. In July of 2020, Stan embarked on his dream of paddling the entire length of the Mississippi River. What appeared to be an “impossible dream” that began in a tiny town in Minnesota ended some 2500 miles later in the Gulf of Mexico as Stanley became the oldest man in history to accomplish this feat at 81 years of age. For those who knew Stan, none were surprised. He loved the bond he formed with these men and women with whom he shared the winding rivers.Stanley leaves behind two brothers, James Stark and Malcolm Stark Jr. Stan also leaves a sister, Molly Leigher and was pre-deceased by sister Nancy Turner.Of all the many achievements and accomplishments that Stanley Stark was credited with, there are none greater than having been a devoted husband to his wife, adoring grandfather to his three grandchildren, Marty, Sam and Haley, and an amazing father to his three children. Stanley leaves behind two daughters, Linda Baker and her husband Kelly Baker and Ada Stewart and her husband James Stewart, both from Gulfport and a son, Larry Stark, and his wife Diana Stark from Maine.Dad, we love you and can’t imagine a better father and role model. Simply put, Stan Stark made everyone he came in contact with a better person for knowing him.Your soul is free to join your darling Wanda and free to paddle greater waters.Friends are invited to join the family for visitation and services on Saturday, February 11, 2023, at Riemann Family Funeral Home, 11280 Three Rivers Road, Gulfport. Visitation will be held from 10:00 to 11:00 a.m., with the Funeral Service at 11:00 a.m. Mr. Stark will be laid to rest at Floral Hills Memorial Gardens in Gulfport.",
  "date_of_death": "2023-02-05"
}, {
  "id": "34402147",
  "date_of_birth": "1930-10-11",
  "obituary_text": "ObituaryLaVonne Marie Aberle, age 91, passed away at Littleton Adventist Hospital on April 19, 2022.LaVonne was a caring and loving wife, mother, grandmother, great-grandmother, sister and friend to those in her life.She grew up in the Black Hills area of South Dakota and married Bill Aberle in 1961. They moved to Littleton in 1968 with their young daughter, Maren. She gave birth to her son, Kevin, in 1969 and raised her family with Bill.LaVonne enjoyed many activities, such as taking drives, cooking and dancing, but most of all she enjoyed spending time with her family and friends. Her granddaughters and great-granddaughter brought her tremendous joy.LaVonne is survived by her husband Bill, daughter Maren Buckley (Clay), son Kevin, granddaughters Elizabeth Buckley (Ryan Murphy), Carolyn Floistad (Paul), Julia Buckley (Garrett Ranum), great-granddaughter Lucy Floistad and sister Selma Thompson.Funeral services will take place at Horan \u0026 McConaty (County Line \u0026 Holly) on Tuesday, April 26 at Noon with a luncheon to follow. Burial will be at Chapel Hill at 3PM.",
  "date_of_death": "2022-04-19"
}, {
  "id": "37271234",
  "date_of_birth": "1947-12-06",
  "obituary_text": "Mardell Louise Wohlrabe of Prescott Valley, AZ passed away on November 7th, 2022, in Phoenix, AZ At Barrow Neurological St. Joseph Hospital.Mardell was born Dec. 6th, 1947, in Herman, MN. to Harold E. Zopf and Mary Zopf (Brunkow).Mardell grew up in Herman, MN. Where she graduated High School and was the Homecoming Queen. She attended Alexandria Technical School With achieving a degree in Secretarial. She worked for the State of MN, Capital in St. Paul.Then she married Jerald Wohlrabe in 1967. She then went to work for the University of MN.She and her husband moved to Phoenix, AZ. in 1972. Then moved to Prescott Valley in 1977 where she raised her family.She is survived by spouse Jerald and their two sons, Christopher “CJ” and Joshua “Jenny”Three grandchildren, Hunter, Rylee, and GretchenThree sisters, Stella Hamilton, Cindy Carnell, and Paula ZopfMardell had her own motorcycle in the 70’s and proudly rode alongside her husband at a time most women were only riding behind their men. She had numerous hobbies, including artistic rock painting.Mardell is loved and will be missed by all.To send flowers to the family or plant a tree in memory of Mardell, please visit our floral store.",
  "date_of_death": "2022-11-07"
}, {
  "id": "52867386",
  "date_of_birth": "1930-05-06",
  "obituary_text": "Clifford John Palacio was born and partially raised in Seine Bight, a quintessential Garifuna village in Belize.  Born on May 6, 1930, Clifford John Palacio was the eldest son of Santiaga and Fulgencio Palacio. He attended school under one of Belize\u0027s most outstanding Garifuna teachers, Simeon M. Sampson, Sr. (a.k.a. Master Bam). After Clifford’s father returned from Scotland during World War II in 1942, at the age of fifteen, his family moved from Seine Bight to Dangriga Town where he continued his elementary education at Sacred Heart School managed by the Sisters of the Holy Family. In 1946, when Primary School Certificate examination was first introduced in Belize by the Colonial Education Department, young Clifford passed the test qualifying him to become a pupil (student) teacher. On January 13, 1947, Clifford\u0027s teaching career officially began. At the age of nineteen, together with then Garifuna student-teachers Eugene Hernandez, Augustine Flores, and George Guerrero, he attended St. John\u0027s College (high school) under a Jesuit Mission teacher-training scholarship program initiated by late Fr. John M. Knopp S.J., Superior. (Those were part of the Garifuna cream-of-the-crop historically selected and trained for missionary work in rural Belize.) While in St. John\u0027s College (high school.), together with Theodore Palacio, Austin Flores, Eugene Hernandez and Govel Morgan, Clifford Palacio assisted in the compilation of a Garifuna dictionary headed by seminarian John Stochl, S.J. It was the first of its kind ever published in Belize in 1951. The same group of Garifuna students also produced a Catholic prayer book titled \"Lebeneri Cielu\" --The Gate of Heaven. Clifford’s remarkable class was the first group to graduate from Landívar Campus the new location of St. John’s College. Some members of that student body became prominent public figures of the country. Hon. Curl Thompson became Deputy Prime Minister under the administration of former Prime Minister Manuel Esquivel. Eustace Usher became chief radio announcer of Government Radio Belize. For many years, Charles Woods headed the Labor Department of Belize. Johnny Price became a medical doctor. From Yo Creek, Guadalupe Pech became a politician and held the post of Minister of Education under the administration of Hon. George Cadle Price. Santiago Perdomo also entered politics and became a Minister of government.  Paul Lewis created history by becoming the first principal of Lynam College in Dangriga Town, while Eugene Hernandez held the post of first principal of Muffles College in Orange Town in 1953. This was the first time in the history of Belize that high school education became available to students outside of Belize City.  For fifteen years, Augustine Flores was principal of Ecumenical College in Dangriga Town. Oswald Reyes was ordained a Roman Catholic priest. Over the years, Mr. Palacio accumulated a wealth of experiences as a teacher, as a Garifuna activist and as an effective leader. After graduating from S.J.C. in 1953, Clifford, having passed the First Class Teachers\u0027 Exam while still in high school taught in San Jose Palmar, a one-teacher school, one year after pioneer Eugene Hernandez started Muffles College, Orange Walk Town. He later attended St. John\u0027s Teacher Training College for two years.In 1955 he married his high-school sweetheart Rita Servio, then a student-teacher. This union produced nine wonderful children, six boys and three girls. Rita, a trained teacher and a Child Development Specialist with the State of California, stood firmly by her husband quietly raising and harmoniously educating their nine successful children. Their careers as a team, teaching in rural Belize, started in San Pedro, Ambergris Caye immediately after their honeymoon. Both Rita and Clifford are multilingual, fluent in Garifuna, Spanish, English, Creole and Clifford some Maya. In 1970 Mr. Palacio migrated to the United States with the aim of providing for his family the opportunity to acquire a college education. One of the girls earned a Ph. D in Instructional technology from USC and another girl earned an M.B.A. from the Catholic University of America; one of the boys played professional basketball with the N.B.A. and Overseas for ten years; one boy is a computer technician. One of the boys is a respiratory therapist. One of the girls is a cosmetologist and healthcare caregiver. One of the boys was a supervisor with AT\u0026T, now an entrepreneur and another boy, with varied skills is a Garifuna artist, a painter and a master drummer. He is also a composer having released some songs. One of the boys was a tool designer in the airplane manufacturing industry, now retired. In 1973, Mr. Palacio joined the Garifuna Settlement Day Committee of Los Angeles. During the time he was secretary and president for sixteen years, he initiated and promoted several trends (Garifuna traditions) in Los Angeles, such as, nine-day-novena culminating in a beluria, Garifuna Mass prayers and hymns, outdoor Garifuna drumming and dancing, annual Settlement Day celebrations, annual dinner dance, yearly excursions from Dangriga, radio program, annual presentation of young Miss Garifuna to the Los Angeles City Council Meeting, Miss Garifuna pageant and traditional Christmas grand ball. This is one of the traditions that our ancestors brought with them from Yurumein in the eighteenth century.           In connection with the promotion and preservation of the Garifuna culture and history, Clifford established contacts with several universities, such as, Columbia University, Stanford University, UCLA, USC, Irvine University, Maryland University and Texas A\u0026M - Commerce University.           After working for thirteen years as an ESL (English as a Second Language) Instructor with Center for Employment Training, Mr. Palacio retired in July of 1997. But his love for teaching did not allow him to stay away all together from classroom teaching and sharing his experiences and knowledge. As a retiree, he got engaged in the teaching of Garifuna history and language pro bono. November 1st, 1999 marked the anniversary of the beginning of an era in the Garifuna history -- the formal study of the Garifuna unique history and language in Los Angeles, California. Clifford\u0027s wish was, someday, to have Garifuna history and language taught in all predominant Garifuna communities in Belize, Guatemala, Honduras, Nicaragua, and St. Vincent and the Grenadines. Viewing :Friday, August 5, 2022 9:30 a.m. to 10:30 a.m.Holy Cross Mortuary :Room D5835 West Slauson AvenueCulver City, CA 90230Celebrants:Bishop David G. O’Connell and Father Peter Thang C. NgoDirector: Alice AugustineChoir: Village Voices Rosary:Friday, August 5, 2022 10:30 to 11:15Holy Cross Mortuary :Room D5835 West Slauson AvenueCulver City, CA 90230Celebrants:Bishop David G. O’Connell and Father Peter Thang C. NgoDirector: Alice AugustineChoir: Village Voices  Mass:  Friday, August 5, 202211:30 a.m.Risen Christ ChapelHoly Cross Mortuary5835 West Slauson AvenueCulver City, CA 90230Choir: Village VoicesChoir Director: Alice Augustine Burial: Friday, August 5, 202212:30 p.mHoly Cross Cemetery5835 West Slauson AvenueCulver City, CA 90230  Repast:Friday, August 5, 2022   2:00 p.m., Mayra’ Banquet Hall6075 South Normandie AvenueLos Angeles, CA 90047    ",
  "date_of_death": "2022-07-06"
}, {
  "id": "38217359",
  "date_of_birth": "1937-08-31",
  "obituary_text": "Susanne Johnston\u0027s passing on Monday, November 21, 2022 has been publicly announced by National Cremation Society - Jacksonville in Jacksonville, FL.The most recent obituary and service information is available at the National Cremation Society - Jacksonville website.",
  "date_of_death": "2022-11-21"
}, {
  "id": "52013479",
  "date_of_birth": "2022-04-12",
  "obituary_text": "An obituary is not available at this time for JAI\u0027VON AMARI LEWIS.  We welcome you to provide your thoughts and memories on our Tribute Wall.",
  "date_of_death": "2022-08-01"
}, {
  "id": "38406716",
  "date_of_birth": "1963-10-07",
  "obituary_text": "Robert Brindley\u0027s passing at the age of 59 on Tuesday, December 13, 2022 has been publicly announced by Paradis-Givner Funeral Home in Oxford, MA.According to the funeral home, the following services have been scheduled: Calling hours, on December 18, 2022 at 4:00 p.m., ending at 8:00 p.m., at Paradis-Givner Funeral Home, 357 Main Street, Oxford, MA. Funeral Mass, on December 19, 2022 at 10:00 a.m., at St. Roch\u0027s Church, 332 Main Street, Oxford, MA.The most recent obituary and service information is available at the Paradis-Givner Funeral Home website.",
  "date_of_death": "2022-12-13"
}, {
  "id": "20653942",
  "date_of_birth": "1963-04-01",
  "obituary_text": "Canaan, NH – Richard W. Roy, 48, died Saturday, August 06, 2011 at the Dartmouth Hitchcock Medical Center in Lebanon, NH after a brief illness.  He was born April 1, 1963 in Berlin, NH a son of Richard E. and Jeanne C. (L\u0027Heureux) Roy.  Richard attended school in Berlin, and moved to Texas as a teenager, where he met his future wife Rebecca L. Lovell and they were married on September 23, 1983.  They started a family and lived in Texas for a time before moving to the Upper Valley thirteen years ago.  He has spent the last eleven years working for New Hampshire Industries in Lebanon, NH.Richard was known as one of the most outgoing people you would ever meet.  He enjoyed watching NASCAR and was a fan of Kasey Kahne and liked going to the races at Canaan Fair Speedway.  He had a love for life and his motorcycle, but his biggest love was his family.He was predeceased by both of his parents, his step father Joseph Grenier and a brother Dennis Roy.He is survived by his wife Rebecca L. Roy of Canaan; a son Michael Roy of Hanover; a daughter ReaJeanna Roy-Rogers and her husband Shawn of Hanover; three grandsons Dante Christopher Roy, Bentley Jameson Guyette-Roy and Ethan Nicodemus; a sister Darlene Amero of Edgewood, MD; a brother Anthony Grenier of Maryland and several nieces and a nephew.A Memorial Service will be held on Saturday, August 13, 2011 at 10 AM at the Ricker Funeral Home in Lebanon.  In lieu of flowers, Richard\u0027s family feels he would want people to donate blood to help",
  "date_of_death": "2011-08-06"
}, {
  "id": "5142243",
  "date_of_birth": "1964-11-30",
  "obituary_text": "Daniel Steen\u0027s passing has been publicly announced by Eternal Valley Memorial Park \u0026 Mortuary in Newhall, CA.The most recent obituary and service information is available at the Eternal Valley Memorial Park \u0026 Mortuary website.",
  "date_of_death": "2021-03-24"
}, {
  "id": "32267690",
  "date_of_birth": "1965-08-28",
  "obituary_text": "Toni Royal\u0027s passing on Saturday, January 8, 2022 has been publicly announced by J. L. Dodson and Sons Funeral Establishment in Petersburg, VA.The most recent obituary and service information is available at the J. L. Dodson and Sons Funeral Establishment website.",
  "date_of_death": "2022-01-08"
}, {
  "id": "36844879",
  "date_of_birth": "1925-01-23",
  "obituary_text": "Charles Thomson\u0027s passing on Sunday, October 16, 2022 has been publicly announced by Advantage Funeral \u0026 Cremation Services - Golden Door in Youngtown, AZ.The most recent obituary and service information is available at the Advantage Funeral \u0026 Cremation Services - Golden Door website.",
  "date_of_death": "2022-10-16"
}, {
  "id": "19723540",
  "date_of_birth": "1916-04-28",
  "obituary_text": "Mr. Robert Lee (R.L.) Fuquea, age 96 of  the Red Bud Community, died  Monday, March 18, 2013 at his residence following an extended illness. He was born in the Pleasant Hill Community in Gordon County on April 28, 1916, son of the late Robert Milton Fuquea and Sally Powell Fuquea, and was preceded in death by a sister, Avanell Fuquea, a brother Ralph Fuquea, and a niece, Phyllis Roberson. Mr. Fuquea was a well known educator, having taught Physics, Biology and Science at Red Bud School for 27 years. He taught the Farm Training Program at Calhoun Veterans School in Calhoun just after graduating from college. He attended Abraham Baldwin Agricultural Collage in Tifton, GA for two years, and was a graduate of the University of Georgia. He was a veteran of the United States Army. Mr. Fuquea was a member of Bethesda Baptist Church, and served as an ordained deacon from 1954 until 2006. He was the chairman of Deacons for 20 years and served as Sunday School Superintendant from 1950 until 1967. He was instrumental in Bethesda Baptist Church progressing from a church with bi-monthly worship services, to having weekly worship services. He organized the Royal Ambassadors Boy\u0027s Mission Program and began the van ministry, which is a vital ministry of the church at present.Mr. Fuquea enjoyed the outdoors and tending his gardens. He had established 25 different varieties of apple trees at his farm. Survivors include his loving wife, Geneva Coats Fuquea, to whom he was married for 61 years; a nephew, Terry Fuquea of Marietta, GA; three great-nephews; a great niece; and a great-great nephew.Funeral services for Mr. Robert Lee (R.L.) Fuquea will be conducted Tuesday, March 19th at 1:00 PM from Bethesda Baptist Church, with Pastor Wesley Hunt officiating. Interment will follow in Fain Cemetery. The deacons of Bethesda Baptist Church will serve as active pallbearers. Honorary pallbearers are members of the Bethesda Men\u0027s Sunday School Class, and the Bethesda Baptist Adult and Sunday School Class.The family will receive friends Monday between the hours of 5:00 PM and 7:00 PM at Max Brannon and Sons Funeral Home.Online condolences may be expressed and the guest book signed at www.maxbrannonandsons.com. Max Brannon and Sons Funeral Home is in charge of the funeral services for Mr. Robert Lee (R.L.) Fuquea of the Red Bud Community.",
  "date_of_death": "2013-03-18"
}, {
  "id": "52070204",
  "date_of_birth": "1924-03-05",
  "obituary_text": "Sadie Scotola\u0027s passing on Monday, May 29, 2023 has been publicly announced by Martin \u0026 Castille Funeral Home- Downtown in Lafayette, LA.According to the funeral home, the following services have been scheduled: Visitation, on June 3, 2023 at 10:00 a.m., ending at 12:45 p.m., at Martin \u0026 Castille Funeral Home - Downtown Location, 330 St Landry St, Lafayette, LA. Rosary, on June 3, 2023 at 11:00 a.m., ending at 11:30 a.m., at Martin \u0026 Castille Funeral Home - Downtown Location, 330 St Landry St, Lafayette, LA. Mass of Christian Burial, on June 3, 2023 at 1:00 p.m., ending at 2:00 p.m., at Cathedral of St. John the Evangelist, 515 Cathedral St, Lafayette, LA.The most recent obituary and service information is available at the Martin \u0026 Castille Funeral Home- Downtown website.",
  "date_of_death": "2023-05-29"
}, {
  "id": "32321312",
  "date_of_birth": "1947-10-04",
  "obituary_text": "Mary \"Lynn\" Ferguson, of Amarillo died February 25, 2018. Memorial services will be 10:00 am Thursday, March 29, 2018 at Lif of Praise Fellowship, 1814 N. Mirror. COX FUNERAL HOME",
  "date_of_death": "2018-02-25"
}, {
  "id": "52321507",
  "date_of_birth": "1958-09-23",
  "obituary_text": "Kevin Lester Abraham, 64, of Richmond passed away on Sunday, June 18, 2023.A viewing will be held from 2 to 3 p.m. Friday, June 30, 2023, with a funeral service with military honors to follow at 3 p.m. at Affinity Funeral Service, 2720 Enterprise Pkwy, Richmond, VA 23294. Click here to view the livestream for Kevin Lester Abraham.",
  "date_of_death": "2023-06-18"
}, {
  "id": "8497341",
  "date_of_birth": "1941-10-21",
  "obituary_text": "Hilary Barrera LuevanoWalkervilleHilary Barrera Luevano, 78, of Walkerville, passed away Wednesday, May 20, 2020. She was born Oct. 21, 1941, in Odem, Texas, the daughter of Juan and Epimenia (Alvarez) Barrera.On April 5, 1964, Hilary married Greg Luevano in Violet, Texas, and they moved to Michigan shortly after to start their lives together. They were married for 56 wonderful years.Hilary was a paraprofessional with Walkerville Public Schools, and loved working with children. She enjoyed trips to the casino, dancing and cooking the best brisket around. Hilary loved spending time with family, especially her granddaughters.Hilary is survived by her husband, Greg Luevano; daughter, Amanda (Matthew) Adams; granddaughters, Haidyn Adams and Devyn Adams; and siblings, Juana, Raul (Terry), Felipe (Maria), Raquel (Sam), Noemi, Rosa (Jesse), Ruben (Delia), John Jr. and Julian (Chris).Hilary was preceded in death by her parents.A private funeral service has been planned and interment will take place at Mt. Calvary Cemetery.Beacon Cremation \u0026 Funeral Service, King-Hart Chapel, is in charge of arrangements.www.beaconfh.com",
  "date_of_death": "2020-05-20"
}, {
  "id": "51613025",
  "date_of_birth": "1956-01-16",
  "obituary_text": "Harlan Thomas PierceJanuary/16/1956 - December/9/2022“The song has ended, but the melody lingers on ”Harlan “Thomas” Pierce of Toledo, Ohio was called home unexpectedly on Friday, December 9th, 2022 at the age of 66. The world has lost a great father, grandfather, friend, and loved one.Thomas was born on January 16, 1956 to Harlan and Carol (Martin) Pierce. In his younger years, Tom enjoyed racing dirt bikes and his love of motorcycles was evident throughout the years. He was a former Journeyman Tool and Die Maker, but perhaps that was never his true passion. He was adventurous and enjoyed camping and taking road trips, visiting many state parks across the country in his motorhome. He lived for beautiful scenery. Tom was also a passionate pet lover and considered his pets to be members of his family, speaking to them as people instead of animals. Above all else, Tom was an accomplished musician. He played both the lead and bass guitar and played them well. His heart and soul belonged to music. From his years spent with the Whoodoo Men, playing alongside Josh Boyd and the VIP Band, to his most recent adventure with the Fabulous Disaster, he put everything he had into his music.Tom was most proud of his family. He was very much involved in his grandchildren’s lives, supporting their passions whether it was football, BMX, dirt bikes, go-karts, or most recently the enlistment of his oldest grandson into the Army National Guard. Tom loved his only daughter and never failed to tell her and everyone else how proud of her he was.He was preceded in death by his parents Harlen and Carol, and sister, Susan. He is survived by his only daughter Sarah Pierce (Eric), grandsons Cameron Beasley and Caden Stewart, nieces and nephews Kristin, Amanda and Phillip, his long-time love Joni WhiteCoats, and many dear friends who will miss him deeply.The family will be receiving friends in the Urbanski Funeral Home a Life Celebration Home 5055 Secor Rd Toledo, Ohio on Sunday, December 18, 2022, from 2:00 p.m. until 8:00 p.m. where funeral services will begin at 7:00 p.m.Memorial ServicesThe family will be receiving friends in the Urbanski Funeral Home a Life Celebration Home 5055 Secor Rd Toledo, Ohio on Sunday, December 18, 2022, from 2:00 p.m. until 8:00 p.m. where funeral services will begin at 7:00 p.m.",
  "date_of_death": "2022-12-09"
}, {
  "id": "5956939",
  "date_of_birth": "1991-05-03",
  "obituary_text": "Raleigh -It is with profound sorrow and grief that we the management and staff of Serenity Memorial Funeral Home join with the Taylor and connected families to announce the earthly transition of Mr. Devin Taylor , 30, of Raleigh, NC.Devin Taylor was born in Newark, N.J. to Verna Paygar and the late Frederick Taylor on May 3, 1991. He departed his earthly home on the early morning of July 6, 2021 at his home in Raleigh NC, surrounded by family and friends. Devin relocated to NC, with his family in his early childhood years he attended Wayne and Wake County Public Schools. He was employed as a cook at a Raleigh Restaurant.He was preceded in death by his father Frederick Taylor, his grandfather Fred Taylor, Sr. Mary Anderson(Grandmother)He is survived by two sons; Zyaire and Elijah Santos of (Raleigh), NC. His mother Verna Paygar, fraternal grandmother of Raleigh, Emma Taylor of (Rahway. NJ) three sisters; Geisha Brooks(Nicholas), Ebon Flaum(Micah) and Elaina Paygar; three brothers; Tevin Taylor(Heather) Antwan Paygar(Tammy) both of Charlotte and Deon Taylor of (Rahway, NJ); three aunts; Michelle Saunders of (Rahway, NJ) Rhonda Blackmon of Snow Hill, NC and Karen Anderson of Raleigh, NC; two uncles; Eric Anderson of Roselle, NJ and Michael Anderson of Goldsboro, NC; one great uncle Linwood Ronald Best of Raleigh, NC; nine nieces and two nephews; a special friend Shawn of Raleigh, NC and a host of cousins and friendsServices of Love \u0026 Compassionate Care have been entrusted to Serenity Memorial Funeral Home \u0026 Cremations, LLC.",
  "date_of_death": "2021-07-06"
}, {
  "id": "8682191",
  "date_of_birth": "1931-04-25",
  "obituary_text": "June J. Jackson, 88, of Maple Grove, Minnesota and formerly of Oelwein, Iowa died Monday evening, January 27, 2020 at Arbor Lakes Senior Living in Maple Grove, Minnesota.Funeral Service: 11:00 A.M. Saturday, February 1, 2020 at Zion Lutheran Church in Oelwein with Rev. Josh Schunk officiating.Visitation:  3:00 to 7:00 P.M. Friday, January 31, 2020 at the Jamison-Schmitz Funeral Home in Oelwein and for one hour before the service at the church on Saturday.Inurnment: At a later date in Woodlawn Cemetery, Oelwein.A memorial fund has been established in her name.Online obituary at www.jamisonschmitzfuneralhome.com June Janet Silvest was born April 25, 1931 at Buckeye, Iowa, the daughter of Clifford and Mabel (Rasmussen) Silvest.  On November 17, 1950, she was united in marriage to Meryl Jackson at Eldora, Iowa.  June and Meryl owned and operated Sam\u0027s Clothing Store in Oelwein for 38 years.  She was a member of Zion Lutheran Church, WELCA, bridge club and ladies golf league.  June enjoyed golfing and boating on the Mississippi River.June is survived by her 2 sons: Jeff Jackson of Overland Park, Kansas and Jim Jackson of Savage, Minnesota; daughter: Jeanne (Paul) Otten of Maple Grove, Minnesota; daughter-in-law: Mary (Mark) Jackson Rinehart of Cedar Rapids; 8 grandchildren: Christopher Jackson, T.J. Jackson, Josh Otten, Laura Otten, Libby Jackson, Abby Jackson, Joey Jackson and Taylor Jackson; and 10 great grandchildren.She was preceded in death by her parents; husband; son: John Jackson; grandson; Joshua James Jackson; brother: Robert Silvest; sister: Bernedine Mulane and infant sister: Berdelle Ann Silvest.",
  "date_of_death": "2020-01-27"
}, {
  "id": "34891632",
  "date_of_birth": "1936-03-01",
  "obituary_text": "Robert E. \"Bob\" Martine, 86, passed away Thursday, May 19, 2022. He was born March 1, 1936 in Akron to the late Edson and Ruby (Harrison) Martine and retired from General Tire. Bob was an SSGT in the Army Reserves and an Eagle Scout, He loved all Cleveland sports, Krispy Kreme Donuts, Heggy\u0027s Nuts, traveling, camping, gardening, and play cards. Bob had a great sense of humor and most of all loved spending time with his family and The Lord.Bob is survived by his loving wife of almost 62 years, Gay \"Marty\" Martine; son, Don Martine; daughter, Jill Smith (Tom) Olesen; grandsons, Andrew (Kara) Smith and Alex Olesen and brother, David Martine.Funeral Services will be held TUESDAY, May 24, 2022, 1:00pm at the Swigart-Easterling Funeral Home, 624 Cherry St. E. (Rt. 93) Canal Fulton. Burial at Sunset Hills Memory Gardens. Visitation Tuesday, 11:30am to 1:00pm at the funeral home.To send flowersto the family or plant a treein memory of Robert \"Bob\" Edson Martine, please visit our floral store.A Memorial Tree was planted for Robert \"Bob\"We are deeply sorry for your loss - the staff at Swigart-Easterling Funeral Home Join in honoring their life - plant a memorial tree",
  "date_of_death": "2022-05-19"
}, {
  "id": "36280969",
  "date_of_birth": "1947-01-15",
  "obituary_text": "“Jo Jo” Guerra passed away peacefully on August 18, 2022 at the age of 75 years. Beloved mother of Kathy Randle (Luis Ortega). Sister of Ken A. Huggins, James R. Huggins, Lila P. Huggins, and the late Jeanette Kirk. Grandmother of Gary “Bucko” Randle (Katherine Stone) and the late Samantha Jo Randle. Great-grandmother of Olivia Randle, Sophia Randle, and Autumn Randle. Aunt of Angela Huggins, Gale Kirk, Paula de la Gardelle, and Timothy Kirk. Great-aunt of Allie Bourgeois. Also survived by other loving relatives and many friends.She retired from the Monteleone Hotel in New Orleans after 30 years of service and worked as a mixologist at the Prime Time Lounge in Marrero. She will be sadly missed.",
  "date_of_death": "2022-08-18"
}, {
  "id": "44814688",
  "date_of_birth": "1939-05-16",
  "obituary_text": "Woodrow W. \"Bill\" Ramey Jr., 75, of Jeffersonville, Ind., died Sunday, July 6, 2014.He was born on May 16, 1939, in Galax, Va., to the late W.W. and Edith (Calloway) Ramey.  Survivors include his wife of more than 32 years, Donna (Pruitt) Ramey; his children, Michael E. Ramey of Pfafftown, N.C., Sherri L. Ramey of Winston-Salem, N.C., W. Scott Ramey (Sandra) of Lakeland, Fla., Krista Perdue (Sam) of Lafayette, Ind.; three grandchildren; his siblings, R. Renn Ramey of Mocksville, N.C., Elizabeth Ramey-Estrada of Walkertown, N.C., and David Ramey (Linda) of Aspen, Colo.Newcomer Funeral Home was in charge of arrangements.",
  "date_of_death": "2014-07-06"
}, {
  "id": "31750279",
  "date_of_birth": "1937-07-31",
  "obituary_text": "Arlene Kule\u0027s passing has been publicly announced by Riverside Gordon Memorial Chapels in Miami, FL.The most recent obituary and service information is available at the Riverside Gordon Memorial Chapels website.",
  "date_of_death": "2021-12-02"
}, {
  "id": "31712534",
  "date_of_birth": "1930-05-05",
  "obituary_text": "Hazel F. LeeMay 5, 1930-November 22, 2021Hazel Florence Webb was born in Los Angeles to Walter J. Webb (1894-1989) and Jessie A. (Anstiss) Webb (1898-1973). She passed away in Portland, Oregon.Just before her fourth birthday, Hazel’s parents negotiated a sight-unseen property swap with folks in Mosier, Oregon. Soon after, the family relocated to the small town in the Columbia River Gorge. The Webb family lived in several places in Mosier, most famously the big yellow house on 4th Ave., with 54 steep steps leading to the front door. Hazel cherished her childhood in Mosier. She attended Mosier grade school and high school.During her senior year, Hazel met the love of her life, Odell F. Lee, from Hood River. They married on June 19, 1948, shortly after Hazel’s graduation. Odell and Hazel made their first home together in Veneta, Oregon. With Odell’s carpentry skills and Hazel’s creative eye, they refurbished a small structure into a cozy home where they lived for several years. In May 1950, son Gary was born, joined by another son, Steven, in August 1951. After Veneta, Hazel and Odell moved to Portland, living first on SE Flavel Street, then on NE Wasco Street. In February 1956, son Robert was born, followed by son Pat in June 1959. The Wasco Street residence was small, and with four boys, the family needed more room. In the early ‘60s, Odell made a deal to have a house moved to their Wasco Street property, greatly expanding the family’s living space. Hazel was so excited, and to the boys, it was a grand event. At this time, there were other family members living on Wasco Street as well. It was a happy place to live and raise a family. It was also not too far from Mosier, and the family traveled there often to reminisce and tell stories. After 15 or so years on Wasco Street, Hazel and Odell moved to NE 160th Street in Portland, in 1971. Hazel was still residing in this home at the time of her passing.Hazel was a woman of abundant talents and numerous accomplishments, mostly self-taught and many stemming out of necessity. She was an excellent seamstress, and sewed her boys’ school shirts, made fancy square dancing dresses, and created a beautiful wedding dress for a daughter-in-law. She made adorable dolls, stuffed toys and quilts for grandchildren. She was a phenomenal baker and cook—there were always baked goodies on hand for visitors, and her Christmas treats were legendary. Hazel was an exquisite gardener and had a natural green thumb. She tended to the loveliest roses, raised the tastiest raspberries and grew from seed all the flowers used at a son’s wedding reception. She liked to take trips to gather rocks, which she used to build walls and ponds in her beautiful yard—she could tell you where every rock came from! Hazel was a whiz at budgeting and at running a household, making every penny count and skillfully stretching resources, while maintaining a loving, nurturing home.Hazel enjoyed many things, including camping trips, doll collecting, antiquing and simply sitting in her garden, where you could usually find her on a sunny day. In retirement, Hazel and Odell built a garden railroad that was so impressive, it drew visitors from all over the world. They were even filmed for television. Most of all, Hazel enjoyed her family; they were her pride and joy. She delighted in every visit, phone call, letter and Facebook interaction.Hazel was predeceased by her parents, her husband, her brother Walter Webb, sister Gladys Roberts, and grandson Austin Lee. She is survived by her four sons Gary (Jonette), Steven (Sharon), Robert, Patrick (Melody); nine grandchildren Michele Lanter (Brandon), Justin Lee (Jenifer), Brandon Lee (Allyson), Cassandra Locke (Aaron), Stephanie Mahaffey, Carson Lee, Dallas Lee, Bryce Lee, Collin Lee; and seven great-grandchildren Chase Bross, Madeline Lanter, Alexis Lee, Aiden Lee, Gabriella Locke, Eva Locke and Isla Locke. Hazel is also survived by many nieces and nephews.Hazel was an incredible daughter, sister, wife, mother, aunt, mother-in-law, and grandmother. She was the sweetest and dearest person, loved by all, and the family misses her terribly.Arrangements are under the direction of Anderson\u0027s Tribute Center (Funerals • Receptions • Cremations) 1401 Belmont Avenue, Hood River, Oregon 97031. Visit www.AndersonsTributeCenter.com to leave a note of condolence for the family.",
  "date_of_death": "2021-11-22"
}, {
  "id": "50635801",
  "date_of_birth": "1955-07-17",
  "obituary_text": "James Donnelly\u0027s passing on Friday, March 10, 2023 has been publicly announced by Wynantskill Funeral Home, LLC  in Wynantskill, NY.According to the funeral home, the following services have been scheduled: Visitation, on March 17, 2023 at 10:30 a.m., ending at 11:30 a.m., at Wynantskill Funeral Home, 294 Whiteview Road, Wynantskill, NY. Funeral service, on March 17, 2023 at 11:30 a.m., at Wynantskill Funeral Home, 294 Whiteview Road, Wynantskill, NY. Committal, on March 17, 2023 at 12:15 p.m., at St. Mary\u0027s Cemetery, 79 Brunswick Road, Troy, NY.The most recent obituary and service information is available at the Wynantskill Funeral Home, LLC  website.",
  "date_of_death": "2023-03-10"
}, {
  "id": "15275423",
  "date_of_birth": "1935-08-26",
  "obituary_text": "Franklin Starkweather\u0027s passing has been publicly announced by Leppert Mortuary \u0026 Crematory Services - Nora in Indianapolis, IN.The most recent obituary and service information is available at the Leppert Mortuary \u0026 Crematory Services - Nora website.",
  "date_of_death": "2021-09-30"
}, {
  "id": "4243043",
  "date_of_birth": "1933-12-03",
  "obituary_text": "Margaret Flynn\u0027s passing has been publicly announced by William G. Neal Funeral Homes, Ltd. - Washington in Washington, PA .The most recent obituary and service information is available at the William G. Neal Funeral Homes, Ltd. - Washington website.",
  "date_of_death": "2021-02-11"
}, {
  "id": "31143916",
  "date_of_birth": "1944-05-02",
  "obituary_text": "Betty Dove Carter\u0027s passing has been publicly announced by Whitley Garner At Rosehaven Funeral Home in Douglasville, GA.The most recent obituary and service information is available at the Whitley Garner At Rosehaven Funeral Home website.",
  "date_of_death": "2021-10-24"
}, {
  "id": "34473179",
  "date_of_birth": "1932-04-19",
  "obituary_text": "Bobby Jack\u0027s passing on Monday, April 25, 2022 has been publicly announced by Stringer and Griffin Funeral Home - Jasper in Jasper, TX.The most recent obituary and service information is available at the Stringer and Griffin Funeral Home - Jasper website.",
  "date_of_death": "2022-04-25"
}, {
  "id": "31258932",
  "date_of_birth": "1932-05-31",
  "obituary_text": "Edith Bruno\u0027s passing has been publicly announced by Vainieri Funeral Home in North Bergen, NJ.The most recent obituary and service information is available at the Vainieri Funeral Home website.",
  "date_of_death": "2021-11-02"
}, {
  "id": "6404576",
  "date_of_birth": "1952-07-15",
  "obituary_text": "James Magnotti\u0027s passing has been publicly announced by Potomac Valley Cremation Center in Hagerstown, MD.The most recent obituary and service information is available at the Potomac Valley Cremation Center website.",
  "date_of_death": "2021-08-09"
}, {
  "id": "14948293",
  "date_of_birth": "1962-05-02",
  "obituary_text": "John M Wall, Jr passed away Sunday, September 15th. John was born May 2,1962, to John M Wall and Pricilla Hall Wall. John\u0027s life was marked by entertainment, whether it was bringing his family to tears with laughter, or his long career in the entertainment industry, John was always found captivating others. John met the love of his life at fourteen, they shared a universe together, this included three wonderful daughters. For those who knew John around town, he was often accompanied by a little redhead, a lukewarm cup of coffee, and hand to anyone who needed help. He is survived his wife Elizabeth, his three daughters, Abigail, married to Matthew and his grandson Jude, Emma and her wife Annie, and Lottie, the little redhead, his sister\u0027s Elizabeth Rutherford and her family, Katie Donahue and her family.In lieu of flowers the family requests donations to a charity close to John\u0027s heart Adopt-a - Native Elder Program anelder.org ",
  "date_of_death": "2019-09-15"
}, {
  "id": "34893246",
  "date_of_birth": "1954-11-01",
  "obituary_text": "Buford Goforth\u0027s passing on Thursday, May 19, 2022 has been publicly announced by Halls Funeral Home in Halls, TN.The most recent obituary and service information is available at the Halls Funeral Home website.",
  "date_of_death": "2022-05-19"
}, {
  "id": "52716551",
  "date_of_birth": "1952-11-25",
  "obituary_text": "Aleyamma Mathew, affectionately known as Santhamma by her family and friends, was born on November 25, 1952 to the late Mr. and Mrs. Thundil Mathai Thomas, Thundyil Puthen Veedu House Thatta, Kerala. She was the eldest of her family and was lovingly raised alongside her four siblings. After completing her high school diploma in 1968, she pursued a two year diploma course in Malayalam literature to become a Malayalam teacher. God, however, had a different plan and through the advice of a local priest she left home in 1971 to enroll in a nursing school in Pushpagiri Hospital Thiruvalla, Kerala. Upon completing her nursing degree, she moved to Florida in February 1975, (at the age of 22 years,) to pursue a nursing career.   Although she was raised in the Catholic tradition, her faith was challenged by a family friend who gave her a bible and encouraged her to read the New Testament for herself. Eagerly diving into the Word of God for the next six months, she quickly realized the importance of having a personal relationship with the Lord. Without hesitation, she accepted Jesus Christ as her Lord and Savior. From then on, she dedicated her life to seeking Him and doing His will. In 1977, she was baptized and maintained regular fellowship with the local baptistBaptist church in Florida.   In 1979 she moved to New York and began sincerely praying for a husband who would support and encourage her moving forward in her walk with Christ. On August 4th, 1980 she married Abraham Mathew (Raju) from Vadasserikara, Kerala. They began their married life in Bronx, New York in January 1981. As the eldest child in both of their families, they were united in their desire and responsibility to support their siblings in immigrating to the United States.   Aleyamma and Abraham were blessed with three children, Sherry, Shawn and Sheena. They lived in New York for 18 years maintaining fellowship with believers in Bronx and Rockland County. In 1998, the family moved to Houston, Texas and lived there for 20 years. After their retirement in 2018, they moved to Dallas to be close to their children and grandchildren.  Throughout her life she was dedicated to her faith and love of the Lord. She was committed to raising her children in the ways of God and was instrumental in teaching them to love the Lord and grow in their relationship in Christ. She was diagnosed with breast cancer in 2015, and the Lord extended her life for another eight blessed years where she was able to continue to witness His goodness and faithfulness. Even during her recent struggles with her cancer recurrence, she maintained her strong faith in the Lord and knew her Savior was with her every step of the way.  On August 12, 2023, Aleyamma was promoted to glory. She is survived by her husband Abraham, her daughter Sherry and husband Subi and their children Gabriel and Evelyn, her son Shawn and his wife Ashley and children Luke, Levi and Lydia and her daughter Sheena. She is also survived by her siblings Sister Karunniya, Saramma, Jose and Sicily, along with their spouses and children. She will be remembered for her dedication to her faith and reliance on the Lord. Her family eagerly awaits the day when they will be united with her again.",
  "date_of_death": "2023-08-12"
}, {
  "id": "35033481",
  "date_of_birth": "1940-11-27",
  "obituary_text": "Vivian Owens\u0027s passing on Tuesday, May 31, 2022 has been publicly announced by Day Funeral Home in Marshfield, MO.The most recent obituary and service information is available at the Day Funeral Home website.",
  "date_of_death": "2022-05-31"
}, {
  "id": "52639713",
  "date_of_birth": "1937-06-23",
  "obituary_text": "  KERNERSVILLE -  Jenell Rayfield Hart, 86, passed away peacefully Sunday, August 6, 2023, at her home surrounded by her family. Jenell was born on June 23, 1937 in Forsyth County to Bradley Jerome and Nell Holland Rayfield.  Jenell retired from Sara Lee and was a faithful member of Sedge Garden United Methodist Church for many years. After retirement, she shared her love for helping others by volunteering at Kernersville Medical Center as long as her health would allow. She baked wonderful cakes and loved sharing them with her family and friends. Dancing, clogging, painting, and playing the piano were among her favorite past times. Jenell’s greatest joy was spending time with her family, especially her grandchildren and great grandchildren. In addition to her parents, Jenell was preceded in death by her brother, Tommy Rayfield and his wife, Gaynell. Surviving are her husband of 62 years, John Hart, Jr.; a son, Greg Hart (wife, Julie);  a daughter, Kim Shaver (husband, Mark) ; seven grandchildren; nine great grandchildren; a sister, Linda Hooven (husband, E.W.); a brother, Don Rayfield (wife, Beverly); and many nieces and nephews. Per Jenell’s request, there will be no formal services at this time. Memorials may be made to Mountain Valley Hospice, 129 Veterans Drive, Pilot Mountain, NC 27041. Hayworth-Miller Kernersville Chapel is assisting the family.  ",
  "date_of_death": "2023-08-06"
}, {
  "id": "52216280",
  "date_of_birth": "1957-01-15",
  "obituary_text": "Eddie Wilson\u0027s passing at the age of 66 on Wednesday, June 7, 2023 has been publicly announced by Dixon Funeral Home Inc in Angleton, TX.According to the funeral home, the following services have been scheduled: Visitation, on June 16, 2023 at 4:00 p.m., ending at 7:00 p.m., at Dixon Funeral Home-Angleton, 2025 E. Mulberry, Angleton, TX. Funeral service, on June 17, 2023 at 11:00 a.m., at First Presbyterian Church, 130 South Arcola Street, Angleton, TX.The most recent obituary and service information is available at the Dixon Funeral Home Inc website.",
  "date_of_death": "2023-06-07"
}]